[{"score": "9/10", "review": "Alien Covenant is a return to form for the Alien franchise whilst also being a Alien prequel and sequel Prometheus and in the movie it works well and helps enhance the story, Alien Covenant is a more enjoyable movie than Prometheus and helps clear things that where blurred in that movie.Alien Covenant has impressive visuals and a sleek look that keeps the viewer invested even if no dialogue is present, the first two acts are more based on the science fiction element and the third act focuses more on the alien slasher element but the movie is already riveting without the slasher element so when it shows up it just a bonus.The cast is very good even though some are expendable but nothing we haven't come to imagine. Pacing does drag here and there so don't let your expectations subvert you and don't expect lots of action with xenomorphs very early on although your plate will be filled by the end. I like to think its a blend of Alien, Aliens mixed with some shades of Prometheus.Whilst this movie is not as good as Aliens I do believe its the best Alien movie since it."}, {"score": "7/10", "review": "I adore Prometheus and had been looking forward to a sequel. Covenant lacks Prometheus' grandiose ambiance, mood and atmosphere and many intriguing questions regarding the motivations of the Engineers left unanswered in Prometheus are ignored in Covenant, so I was disappointed in these regards. And yet, seen on its own terms, Covenant is quite satisfying as a space-monster(s)-on-the-loose movie. It's pretty violent and gory. Yes, it recycles elements from Alien especially, but does not do it in a lackluster manner."}, {"score": "9/10", "review": "Oh~ my first review. After this movie, I was totally understood what I had been looking for the key of the puzzle. Where the Aliens are from~ The story was unexpected and Sound and graphics are amazing. The only thing that I was disappointed is the fighting scene with alien is too short for me."}, {"score": "8/10", "review": "Saw this last night as an early 4k preview showing. Found it so much better than Prometheus which to me, fell flat on its face. Visuals are stunning , characters are likable and the xenomorphs kick butt. Only criticism is that the middle part of the movie looses pace for a while but then picks up nicely in the end."}, {"score": "6/10", "review": "Alien: Covenant follows colony ship Covenant which is bound for a remote planet on the far side of the galaxy. As they arrived in the planet, they noticed a beautiful landscape. At first of what they think is an uncharted paradise, they soon discover that it is actually a dark and dangerous world, rampant with mysterious creatures and a sole inhabitant who has been hiding for years after a doomed explosion.The first few sequences of Alien: Covenant are breathtaking, the movie quickly establishing an ambitious tone with elaborately conceived visuals. That's the best thing about it. The production is as great as it can get. It is a marvelously realized vision. The design of the Alien is also great, both leaving me terrified and fascinated by its beautiful design. The rest of the movie, though, doesn't exactly follow suit. The ambition is still there, and the movie continues to delight with its sci-fi flourishes. The thing is, amidst the grandiose tone and spectacular visuals, the characters end up feeling pretty thin, cardboard cutouts doing what they have to do just for the sake of it. There is quite a huge cast here, and none of them really get any attention. They just feel like bodies waiting to be killed. In addition, some of them are actually dumb for doing what they did throughout the movie. It sometimes doesn't make sense, their actions just a device to hurl the plot forward, making it hard for me to suspend my belief. I also felt the script to be clumsy, not reaching the heights that its visuals have intended it to. The actors weren't anything special except for Fassbender, who gives David both a sinister and a sympathetic outlook. As a sequel to Prometheus and a prequel to Alien, it did its job as it answered some of the questions I had; however, the answers are really vague. It doesn't really provide a huge revelation of what's actually going on, but one can see the connections between the three. I wouldn't call it a \"direct\" prequel and/or sequel, but it's all through the tiny links and loose threads in which they are interconnected. Having said all that, Alien: Covenant is worth seeing for its scale, and for the ambition that's embedded through its spectacle. It is as good-looking as a movie could possibly be at this point, the technology all put towards bringing sci-fi concepts to life. Even the gory sequences are great; they're genuinely terrifying, the movie raising the bar up a notch. Though as stunning as the film is, it might leave audiences a little cold. There's no underdog, the characters all feel thin, and their decisions may question the viewer on why they are there on that specific mission in the first place, given their idiosyncrasy. Alien: Covenant is still worth a look, but it's not so special in its entirety."}, {"score": "10/10", "review": "A return to form after the awful Alien: Resurrection and spin off movies!!!Good pacing - Relatable characters with a degree of depth, more than just Alien fodder! - Action and Horror! - Great CGI, SFX, PFX and VFX - Good story - Some genuine scares & disturbing/awesome gore! (BACKBUSTER!!!) - Some amazing cinematography - Some real throw back moments to Alien 1979 - Ranks along side Alien, Aliens, Alien3"}, {"score": "4/10", "review": "We still go to sequels of great movies with the dumb expectation that somewhere in the mind of the lazy same old screenwriters there is a trace of fresh inspiration left. And again we find out it's not! Hollywood's obsession with franchises and going safe by using on and on the same creative gurus lead to the today's sci-fi apocalypse where for years now there is not one single sequel to rise to the grandeur of the original movie. It's the case of Covenant where there is no major innovative plot twist to save this movie. Just some mediocre philosophical rhetoric which can't compensate for the chronic lack of ideas. And as always with every recent sci-fi movies, the screenwriters are not only creatively dry, but they are technically outdated, presenting future technology inferior to today's one."}, {"score": "4/10", "review": "In the middle of repeating all the tested and tried alien scenes in a new order and in a new setting with (mostly) new actors, Alien Covenant manages to find a single reason to exist and that is to give Michael Fassbender space to chew the scenery in a dual role. The usually reliable Fassbender fails to lift the material above the ground, largely due to the predictable script that crawls to an obvious ending with a snail pace, dutifully disposing most of the human crew on the way.Worst than the movie itself, though, is Scott's attempt to tie all movies together. It looks increasingly like he makes things up as he goes, and the plot gets overly repetitive and curly. Those who love the original Alien might wish to skip these movies from now on, as Scott is approaching the original mythos from a deeply unsatisfying angle that probably lacks only one more piece to become his midichlorian moment. Once you see it, you cannot un-see it. You are warned."}, {"score": "10/10", "review": "Covenant has less suspense than Prometheus but more bloody, intensity and Alien. Michael Fassbender and Katherine Waterston carry the movie .Visuals are stunning, Xenomorph, such a beautiful creature.Even though Covenant didn't give us full answer about Engineers and also left us some question, but still an enjoyable movie.It is so great that I even watched twice in one day.Definitely one of the best in the Alien franchise"}, {"score": "3/10", "review": "Some movies almost don't need a narrative at all (Alien, Aliens, Mad Max: Fury Road come to mind). In these works, the whys and hows are left as an exercise to the viewer and fade into the background to let the action create an emotional resonance.Alien: Covenant attempts the opposite, and smothers its own pace with lazy exposition and confusing explanations. After so many years of xenomorphs killing humans, the franchise was in dire need of either a return to its source, or some drastic innovation, expectation which aren't met either as the movie deliver action scenes everyone is already used to, without proper build up and without any surprise at all. One would have also expected Alien:Covenant to have learned from the many mistakes committed by Prometheus. Sadly, the story only goes forward thanks to plot holes combined to the terrible absent-mindedness of the characters who seem to repeat the very same gaffes as the crew of the previous movie.In short, a film which would have deserved a moist, dark, intense claustrophobic atmosphere and desperate struggles for survival was instead given the plot of, well, mostly every other action movie with disappointing CGI monsters thrown-in, shaped like xenomorphs to remain faithful to the license. I wish I could give it more than 3 stars (for the okay acting), but considering the waste of potential of this movie and the hype it created, it's only fair (at least in my books).Not recommended. Wait for the DVD if you're curious."}, {"score": "8/10", "review": "\"Alien: Covenant\" is directed by Ridley Scott and is the second \"Alien\" prequel and the sequel to 2012's \"Prometheus.\" In \"Alien\" Covenant,\" the crew of the ship Covenant, make way to find a planet that they can colonize, only to be terrorized by creatures hunting them down and an unknown inhabitant that lives on the planet.I went to a press screening go this in Boston, and going into this screening I prayed and hoped for it to be better than \"Prometheus.\" I only saw Prometheus once when it was first released, and just watched it again for the second time earlier today to prepare for \"Alien: Covenant.\" Prometheus was a bland, very uneventful movie. It answered none of the questions that Ridley Scott wanted it to answer, so I was skeptical about this sequel. Luckily....it turned out to be good. \"Alien: Covenant\" is a vast improvement over Prometheus that really expands the series' mythology and is a very entertaining and enjoyable ride.One thing I noticed was that shaky camera was used for the action scenes, but used very well in a way where you could still tell what was going on. Not a lot of directors, barely any for that matter, can perfect that, but I think Ridely Scott was on point when it came to how those scenes were shot and directed. It gave the film this kind of realness that I did not expect it to have. Luckily, there is more action in this movie than there was in its predecessor. The action scenes are really fun. They're bloody, they're gory, they're everything we want an Alien movie to be. No, nothing was all that ground breaking when it came to writing and crafting these scenes, but these scenes present a sense of claustrophobia since most of them are filmed in small locations and in the dark. The final action scene in the movie feels very similar to the way the first one ended but doesn't feel like a complete ripoff of that film. This is visually the best movie of the year so far. The cinematography is lush. The vast landscape from this planet is so well captured and so well realized that you get a sense that planets like the probably do exist in this universe. Many, not all, but many questions about where the Xenomorph comes from are answered in this movie. There are still some blurry spots, still some things I'm not too sure about or a little hazy on, but for the most part most of the questions we have regarding the Aliens and where they come from are starting to get answered and our remaining questions will be (or should be) answered by the time the third prequel comes around.This movie felt like it breathed new life into a series that was waning. Ridley Scott seemed to take all of the complaints fans had about Prometheus to heart and set out to create something that would both please those fans and create new fans. It's almost like he knew Prometheus wasn't a good movie and accepted the fact that fans were right, and made a movie for the fans. It is a good blend between the claustrophobic, psychological horror of \"Alien,\" and the sci-fi action adventure of \"Aliens,\" with the worst parts of \"Prometheus\" chucked out the window.This movie does have its faults, and most of those faults lie within the characters and the decisions they make. Nobody in this movie is really all that fleshed out, save for Michael Fassbender's characters. There's nothing really there emotionally to help you latch on to these characters. None of the really have backstories. Katherine Waterston's character has somewhat of a backstory, but even then it's not much. I did not find the need to care for these characters or even care at all if I had to because most of these characters aren't fleshed out and are just expendable. The characters aren't very smart either. When you see a giant egg covered in goo, probably a good idea not to touch it...right? Or shoot an alien that's calm just to make it mad...right?Another problem is predictability. This is easily the most predictable movie I have seen this year. Just judging from the trailer you knew which of the crew were gonna die. There were certain plot points that I guessed about halfway through, and something at the end that I saw coming from a mile away. It just did not sit well with me. When I can predict things like that, it brings the movie down for me.Overall, a solid return to form for the \"Alien\" franchise. Nowhere near as good as \"Alien\" or \"Aliens,\" but LOADS better than Prometheus. The other two don't count.I'm going to give \"Alien: Covenant\" a 7.7/10Check out my video review on YouTube here: https://www.youtube.com/watch?v=06cSmrtQRH4&t=1s"}, {"score": "7/10", "review": "Well, this movie was rather enjoyable as a sci-fi horror movie. It had the ingredients of the usual Alien franchise movies and it was directed by Ridley Scott who also directed the original Alien movie, as well as Prometheus. Now those of you who did not follow the Alien films, this movie was a direct sequel of Prometheus released in 2012. It was the second movie to a supposedly trilogy of prequel before the events of Alien which spawned to 3 more sequels. So it is already the 6th movie relating to these aliens (excluding the movie Alien Vs Predator).Back to the film itself, my wife and I enjoyed the suspense and action sequences whenever the aliens were around and trying to do some killing (she quite frequently screamed whenever there was shocking scene). However, I for one was feeling that the first part of the movie was moving in a rather slow pace. We would not be having the suspenseful part until after one third of the movie. And even then, I felt there were too much breathing time especially during the conversations scenes which made the movie rather than having almost nonstop suspenseful time, became less horrifying. I get that the movie was trying to show the background story towards the Alien, but personally I felt it took too long (or rather too deep). Although, I had to admit that the action sequences were top notch! You would not be disappointed in those parts, especially with the very very cool special effects. And if you are watching it in a theater with good sound systems, then you would be even more satisfied with the sound effects (the voice the aliens making were amazingly added to the element of suspense).As for the story itself, it was actually good and it did provide us more understanding about the origin of the aliens which you would not have guessed. There was also the classic ending of an Alien movie which would be the background of the future sequel(s). But there was no post- credit scene, so there is no need to wait to watch it, if you happened to like seeing these scenes. Another point that I would like to highlight here was that out of the 15 crews here, I think most of them did not stood out, except for Tennessee's character. I guess 15 were too much? And it was rather unfortunate that Daniels character did not seem to be too convincing as a female heroine, much lesser if you compared with Sigourney Weaver as Ripley. But then again, that's my opinion.If you are a true fan of Alien franchise and really love the story involving aliens (or as they called it xenomorph), then I am very sure you would definitely be enjoying this one. Now if you are a fan of full action movie though, pls be reminded that despite having a 2 hour duration, the action suspenseful sequences may not be satisfying enough. And as I said above, this is the 6th movie in Alien franchise so it is highly recommended that you see Prometheus first before watching this one to avoid having difficulty in understanding the main story. for my complete review, pls have a look at michaelnontonmulu.blogspot.co.id"}, {"score": "7/10", "review": "This will be the sixth time we get to see a xenomorph explode from a human chest after using the human host as baby gruel (eighth if you include the Alien vs Predator abominations). In the world of narratives, the shock value depreciates like the value of cars, but there is still a tingling thrill if the story is well-told. After the ponderous top-heavy Prometheus (2012), it is nice to see Ridley Scott serving up a back-to-basics Alien entry that has many fan-nods to his 1979 sci-fi-action-horror classic Alien.Some years after the events of Prometheus, the ship Covenant, loaded with the hibernating bodies of settlers, is en route to colonise another planet. A tragedy forces the crew – Daniels (Katherine Waterson), Oram (Billy Crudup), Tennessee (Danny McBride), Lope (Demian Bichir), Karine (Carmen Ejogo), the android Walter (Michael Fassbender) and others – to make an emergency landing on an uncharted planet, where they uncover a threat beyond their imagination, they must attempt a harrowing escape.Tell me the plot doesn't resemble Alien. These days movie franchises like to reboot itself by making a \"new\" film, case in point being Star Wars: The Force Awakens. This is not necessarily a bad move because it gets to keep the old fans and new ones to the franchise happy. Frankly, after being weighed down by all the lofty God and Creator ideas in Prometheus, we are due for some let's-kill-em-all balls-to-the-wall action.Alien: Covenant is definitely a piece of effective sci-fi-horror gut-bucket filmmaking and IMHO Ridley Scott hits the mark (not the bullseye though). Sure, the characters are hackneyed and are largely cannon fodder for the aliens. Sure, the world may be different but the actions of the crew are the same. But at least none of them does dumb things like yakking cringe-y lines to a baby alien like it is a puppy and getting crushed by a giant rolling croissant (here's looking at you, Charlize Theron). That said, the crew of Covenant, especially the captain, are still gullible, but I can forgive that for the matter of storytelling.The action set-pieces are well-staged and have the right amount of freshness and yet could harken me back the classic, like the flushing out of the alien onboard the ship and the closing of the hatches after them. That gave me goosebumps of the good kind. Daniels (Katherine Waterson) is no Ripley (Sigourney Weaver), but still she channels a compelling yet softer edge. But the movie is really a Michael Fassbender show whose performance is sinewy and spine-chilling. He plays dual roles here with the right amount of distinguishing traits – rigid upper body, posture, speech patterns, menace-laced dialogue – with finesse and aplomb.Ridley Scott has come out tops through an ocean of guts and gore, and he has reminded me how much I love the first two Alien entries. I like Covenant, but don't love it, and this one easily slips into third place. Scott has successfully answered the questions proffered in Prometheus and got my senses up to ultra-wary levels for the next one."}, {"score": "5/10", "review": "Alien Covenant marks the third Alien movie directed by Ridley Scott and the second prequel to the franchise after Prometheus. They also seem to be getting worse with age.Prometheus was really a lot of questions searching for answers, ambitious in asking not only about the creation of alien life, but human life as well. However the plan to stretch out these topics into 3 or 4 movies should be met with some skepticism. Especially considering the basis for this was started by Damon Lindeloff, the creator of Lost and the man most of us are still waiting for answers for most of the things that happened on Lost. He of course has abandoned this second movie, leaving it in the hands of the far more capable John Logan, but even he struggles to find meaning here, or escape the clichés that have started to grow like a Xenomorph in John Hurt's stomach. We're dealing with a whole new crew this time; the Covenant. They are headed on a colonial mission to another planet before an electric shock takes out the ship, the Captain, and 47 other members. Reluctant to get back into their pods for a 7 year journey, the on board crew responsible for the ship's upkeep decide instead to answer a distress transmission coming from another planet. That's where they find what continues to be the best character in these prequels; Michael Fassbender's David the Android. His motivations and whether he considers himself human or God is constantly in question and Fassbender's soft-spoken performance continues to haunt. I also really do consider Prometheus to be one of the most gorgeous-looking special films of the last decade and this continues that- from the Covenant ship to the grain fields and other vegetation eerily covering the mostly desolate other terrain of the planet.We also get the first look at the Neo-morph, who is born the same way, seems a bit faster than the Xeno-morph but the main differences are it doesn't have the Venus fly trap tongue and it can stand like a human. Pretty cool. Just it's at this point I should probably say that after Aliens there started to be less reason to want these. Alien 3 was fine, Prometheus I thought could really go either way depending on the sequels, and Alien 4 of course was garbage. The biggest problem here is that it feels so redundant. We get a distress call, the crew investigates, some background characters do stupid things leading to impregnation, someone says \"we never should have come\", final alien chase. The aliens, when you can see them, are cool, but there is a lot of downtime between them, and a few quality kills does not a 200 million dollar mega blockbuster make. It's also really odd that Prometheus does this whole thing of setting up the engineers as the creators of human beings but here they only get one scene and let's just say those looking for more info about them will get angry. The promise of some larger conversation is in here somewhere but these movies feel so stretched out at this point that when this does get to the few moments of actually having something to say, it's hard to get re-engaged. The characters don't help either as most just come off like archetypes. Katherine Waterston is the Captain's widow and really the bargain basement Ellen Ripley here. Billy Crudup plays the faith-based character, and like the last movie, this movie seems to be including that without ever really giving it value in the meaning of life conversation. But at least those two have some background. I'm so tired of most of these others. The ones who just go tramping through the woods of an unknown planet or show the decision making skills of the Trump administration. You're not supposed to make us root for the alien, guys. Finally i'm no closer to understanding why these movies are necessary. It's easy to tell what this movie wants to do and it's even easier to see the twist coming a half hour before it even comes. There are a few nice kills here, I will give the movie that. If you can remember to wake yourself every time Fassbender and Fassbender (he also plays an android named Walter) have a philosophy conversation, you might find some interesting stuff there too. But overall not enough action or thought to make this overly drawn out series seem necessary.So I go 5 out of 10 guys. For more reviews like this, check me out on Youtube"}, {"score": "1/10", "review": "I waited for this movie whole year, cause trailers looked aliensesque and really cool. I really hoped that Ridley Scott is going to wipe out Prometheus as much as possible and start a great Alien movie. How fool I was. First 30 minutes were actually really great, but then the stupidity started. Crew went to totally unknown planet without wearing any protective gear. I understand that it was needed for plot, but it's so plain stupidity that I wanted to moan. But it did not stop there - then they met with David and from that point the movie reminded some shitty Riddick Chronicles movie. It was lame, it was boring, it was so predictable. There was many scenes in trailer which you can't see in movie. And fight in spaceship lasts only about 10 minutes, but is actually quite cool. And then there is ending which was also really predictable and so f****** stupid. F***, Mr. Scott, stop it, you are ruining Alien's legacy. Pleast stop."}, {"score": "6/10", "review": "At the point when the title Alien: Covenant shows up on the screen in Ridley Scott's third passage into the six-film Fox establishment, it gradually develops in profound space scored by Jerry Goldsmith's delightful frequenting topic.After the distinctive, divisive Prometheus, it appears like a reaffirmation of center values: this time, in space, nobody will hear you shout. On the off chance that that is the expectation, then Scott prevails in fits and begins: it feels like a sidekick piece with Prometheus, still chatty and awkward, yet edges nearer to the first as far as gut, symbolism and fervor.Agreement opens on a major close-up of Michael Fassbender's eye which, given the executive, sets up the desire of a Voight-Kampff test. Occurring in that science fiction staple, the Sterile White Room With A Huge Window, a youthful Peter Weyland (Guy Pearce) addresses skin work David (Fassbender) about the riddles of creation and – to underline the point – inspires him to play Wagner's Entry Of The Gods Into Valhalla on a terrific piano. Plainly occurring before the occasions of Prometheus, we then sliced to ten years after Noomi Rapace's Elizabeth Shaw put David's head in a duffel sack and launched to the Engineers' planet.It's presently 2109 and the group of the Covenant are transporting 2,000 homesteaders to heaven planet Origae-6 with a specific end goal to begin another life. An arbitrary transmission — that is deciphered as John Denver's Country Roads — alarms them to the nearness of a closer planet that has better conditions to bolster life. Having endured a current disaster that left fatalities, the group take the simple alternative and set down in the untested condition. There is breathable air. There is wheat. Just terraforming officer Daniels (Waterston) sees there are no fowl or creature clamors. Swallow.A Joyfully, contrasted with Prometheus, Covenant improves adaptations of all your most loved Alien tropes: group bantz (\"Sweet tits\", \"Sugar dick\"), a dangerous drop to a planet, the arrival of ship's PC MOTHER, a contention over isolate, running full-pelt down halls, cheeky bits with trickling water, eggs, Facehuggers, Chestbursters and Xenomorphs. Be that as it may, there are turns to the recipe, as well. There is an infant outsider that falls off like a vindictive Baby Groot. What's more, we likewise get clever Neomorphs, substantially more spry than their 1979 or 1986 partners, jumping about like Velociraptors when cornered by the group.When it is extraordinary, Covenant is truly serious. The primary experience with the incipient domeheads is an all out surge, from awkward scenes of wild shaking to snapshots of dim craziness (slipping on blood at a key minute) to the beasties uncovering an up to this point obscure ability at head-butting. However once the chase is on, Scott can't summon the managed strain of Alien (or the determined ride of Aliens). There are some frightening slaughters however none that recover the creative energy and outline of the first's passings. He likewise can't assemble energy similarly, the feeling of account desperation unfortunately absent.It's only a disgrace that one of film's most prominent picture producers couldn't convey his thoughts outwardly.The Covenant team are an especially dull, between variable cluster (there are 15; Alien had seven or more feline). Some show guarantee. Waterston's Daniels is injured with pain. Recently advanced chief Oram (Crudup) is managing questions that his religious confidence will undermine his power. In any case, just Danny McBride's Tennessee truly enlists, and that is mostly on the grounds that he wears a cattle rustler cap. Indeed, the most fascinating character connections interfered with the two synthetics: amateur Walter and Prometheus extra David (named after arrangement makers Walter Hill and David Giler). Both skilfully separated by Michael Fassbender, the combine meet as David is the main occupant of the recently discovered planet. There are unusual, intriguing scenes as David instructs Walter to play woodwind, out-score each other on Romantic verse and in, what feels like an odd bit of Fassbender cut fiction, kiss.However it is likewise the indicate where Scott gets enjoy his Blade Runner-Prometheus distraction with playing God in on-the-nose dialogs. Getting it done, otherwise known as The First Two, the Alien arrangement fills in as filthy B motion pictures (a slasher blood and gore movie, a war film), installing all the (psycho- sexual) which means in the symbolism. Here it is done in discourse about the dissatisfaction of not being permitted to make and the depression of dreams. It's only a disgrace that one of film's most noteworthy picture creators couldn't convey his thoughts outwardly. Still, as The Martian demonstrated, Scott is still great at this science fiction malarkey, be it the huge stuff (the Covenant growing sails to outfit control) or the telling subtle elements (outsider iotas get highlighted in smoke rings). John Logan and Dante Harper's screenplay, after the giggle free Prometheus, likewise includes a joke or two. At a certain point, there is a Phantom Of The Opera choke. Maybe this is Covenant's greatest frighten: about a long time from now, Andrew Lloyd Webber is as yet a thing."}, {"score": "1/10", "review": "Amazingly enough, the director who's created some of the everlasting iconic cinema features (Alien, Blade Runner), which have set the standards of dozens of sci-fi movies to come, keeps destroying his franchise by spitting out one bad copy of the original after the other. If Prometheus was a flat, predictable sequel of the infinite Alien saga, Alien:Covenant is an irritating piece of works, managing to deliver a worse performance than its immediate predecessor. The usual stunning special effects from CGI don't compensate for the cockamamie plot, the less than impressive acting from a less than impressive cast (with the only exception of Fassbender). All the magic, all the mystery of the original franchise is lost in the midst of splashes of bloods (litres of it....), Jurassic Park monsters jumping all over the place, star-ships driven like fighter jets and so on. Is all this a concession to our times, the ti es of The Guardian Of The Galaxy, Avangers, etc? Maybe, probably...and they do have a public, so long live the box office and RIP good old Alien."}, {"score": "5/10", "review": "I went to see this movie hoping it would be better than Prometheus, which was a mediocre film at best. I was very disappointed in Covenant also. It follows the story of Prometheus to a certain regard, but makes no attempt to be a better film. I found it to be dull and way too predictable for my taste. I loved the first two movies (Alien and Aliens), mainly because they were purely entertaining and looked great, not because of some Oscar-worthy screenplay. Alien Covenant is not an entertaining film and the writers try too hard to bring some philosophical aspects into the story, which greatly diminish the movie's quality. In my opinion, the Alien series should be all about atmosphere, action and bloody scenes. Leave those \"parts that make you think\" for other movies with other subjects. Alien is about unlucky people getting chased and whacked by a scary creature. Sounds like a ten year old description but that should really be it."}, {"score": "8/10", "review": "Alien: Covenant is the sixth installment in the Alien franchise and the sequel to the 2012 film Prometheus. Once again directed by Ridley Scott, this film marks the series' successful return to its horror/sci-fi roots that has been absent for some time.In the year 2104, the crew of the colony spaceship Covenant receive a radio transmission from a nearby uncharted planet and decide to travel there to investigate. Upon arriving there, they discover that the planet appears to be perfectly habitable and an ideal place for possible human colonisation. However, after closer inspection, the crew make a terrifying discovery that this seemingly perfect utopia is not what it seems on the surface.Expanding upon some of the philosophical themes first brought up in Prometheus and even answering a couple of confusing questions that film previously raised, Alien: Covenant is a worthy entry in the franchise and a huge improvement over what the series was turning into. Director Ridley Scott makes full use of the scenic planetary landscape to make this environment believable and realistic for human habitation. The threat of the Aliens feels real and the tense atmosphere makes the danger feel like a real possibility. This film also has a great deal more blood and gore effects than its predecessors, but most of it seems like tacky CGI rather than practical effects, I still miss the old practical look and feel of the original films. Like with Prometheus, most of the human characters are flat and uninteresting. It just seems as though most of the development went into the android characters of David and Walter (both Michael Fassbender) rather than the human crew.I rate it 8/10"}, {"score": "9/10", "review": "I only recently got around to seeing 'Prometheus' and quite enjoyed it, without really loving it. Though for me to get any enjoyment out of a sci-fi film (my least favourite genre) is rare. So the fact that I had an enormously good time with 'Alien: Covenant' says a lot. This film was a lot of fun from start to finish.Firstly, the action really steps it up this time around. It is plentiful and brilliantly directed by Ridley Scott. The film moves at a break-neck speed and you've barely settled down from one action sequence before the next one is commencing. Also the aliens look absolutely terrific in this film, as does every CGI feature for that matter.Secondly, the characters are once again masterfully written. Michael Fassbender as 'David/Walter' is nothing short of captivating. The performances he gives as these characters deserve more recognition than I believe they will get. He's undoubtedly the stand-out, but there is not a weak link in the chain in this film.Finally, the overall plot line is quite brilliant. Less convoluted and confusing than 'Prometheus' (I didn't find it overly confusing, but I'm told some did), yet equally (if not more so) smart and intriguing. I love that this film has enough layers to it where not everything is always as it seems. In an action/horror movie those kind of elements can sometimes be put on the back burner, but not here.I would have to say I enjoyed this movie more than I expected to. It took me quite off guard with just how affecting it was able to be. The two hour run time absolutely flies by and the credits are rolling before you know it. Whether you're a fan of the series or not, make sure you get out and see this film. You won't be disappointed."}, {"score": "5/10", "review": "I fell asleep..... I got back home, watched the original Alien and The Thing, and then hated this piece of !@#$ more than I did when I forced myself to sit and watch it without walking out.These guys are meant to be the creme d e l e creme of humanity. Some of the stupid !@#$ they do will have you convinced that this was in fact a convict ship full of D heads. I swear"}, {"score": "5/10", "review": "I was really looking forward to seeing this movie. It had promise. What I got was a very predictable, boring script that just copies every other movie before it. If you know anything about the \"Alien\" films you knew what was behind every corner. Somehow this movie managed to be even worse than Prometheus. I'd recommend skipping this movie, spend the money on something worthwhile."}, {"score": "5/10", "review": "Covenant is the 6th movie in the franchise with director Ridley Scott returning. So what did they get right? Well as expected the visuals are always stunning. Scenery of the planets, art design and cinematography are aspects of Alien with Scott's direction I can always count on. In terms of acting, Michael Fassbender gives a chilling performance. He manages to portray creepiness, desire and obsession so well it got under my skin. He was given the most to do with his existential themes and creator complexity so that was expected. Unfortunately I still left the theatre underwhelmed. Scott clearly wanted to return to the roots of the 1979 classic so much, that it essentially BECOMES that. The film becomes the conventional horror flick it so started in '79 riddled with tropes (if they're alone; THEY DIE, if they're having sex; THEY DIE). It offers nothing new in the franchise as we've grown to see the scene where a dude looks into an facehugging egg, or a revelation that androids can't be trusted. It certainly tries sets up new directions they could've taken but never quite gets out of its comfort zone and in the end we get a plain \"monster-picks-off-people-one-by-one\" story. Also the CGI Xenomorph PALES in comparison to the mechanic puppet used in previous films. This lack of practical effects was also a bummer. In the end though it acts fine as a sci-fi horror if you're not too attached to how revolutionary Alien and Aliens are. Part of me wanted something a little more unfortunately."}, {"score": "6/10", "review": "Im probably one of the few people that actually enjoyed Prometheus so here goesThe Pros: This movie is visually stunning much like Prometheus the setting, tone and production value is really top notch. The gore is satisfying. The scenes with David and Walter were amazing.The Cons: The characters are MOSTLY underdeveloped save it for Christopher Oram, the others are just (actually decent) actors having somewhat at least 5 lines and then die in the next scene. Katherine Waterston's Daniels felt useless she is nothing like Elizabeth Shaw she's not the most resourceful, has less screen time and feels like a token undeserving Final Girl. The film felt draggy. The finale was a lackluster."}, {"score": "6/10", "review": "Is Ridley trying to out Lucas himself in killing off his own franchise?A great looking film ruined once again by a sub-par plot, characters and story. There were audible groans and unintentional laughter from the audience throughout the film.It was just a disappointing movie experience, especially as you could see potentially interesting plots and sub-plots, only for the film to descend into predictable farce.I question my own motives as to why I keep on repeating this exercise and going to films of this nature."}, {"score": "1/10", "review": "The Alien franchise is now a caricature of its former self. Forumulaic and predictable, in the Alien: Covenant, the accountants have taken control of the story. So many scenes were unnecessary with a disconnected mixture of styles, it seems as if the story was pieced together by a committee with each member allocated their portion. Just like in the movie 'Life', expect the crew on spacecraft to be totally, unapologetically, inept in every sci -fi movie these days. I don't understand how this is meant to be entertaining. But more disappointing is the predictable ending, and the lame 'reveal'. Ripley's intuition was on the mark, but in a universe of possibilities, is this best that writers can imagine? There is a great deal of pretentiousness here, allusions to cultural supremacy, and we have seen this all before. This isn't sci-fi. This is a Marvel comic."}, {"score": "7/10", "review": "So alien covenant is the 2nd prequel to the original alien from 1979, and a sequel to 2012's Prometheus. First off, this film is visually stunning with the mind blowing cinematography and the combination of color makes the film an aesthetically pleasing experience. As a fan of the original film, I was extremely pleased and walked out of the Cinema with a smile on my face. Not much development on the characters but the film digs deeper into back story and explains far more resulting in a back to basics horror that was what Prometheus tried to be. This film in particular, and the prequel, explore the evolution of the alien, ultimately becoming the creature that gave us nightmares. Overall the film was extremely enjoyable and not too far fetched, although the ending felt very sudden and anti climactic. I feel the film would of benefited more if there was an extra 15-20 minutes added on to give the fans a satisfying ending. I would definitely recommend to all fans of the series. I'd give it a 9 out of 10 and I'll definitely see myself revisiting this installment in the alien. Saga multiple times."}, {"score": "8/10", "review": "Not a big horror movie fan, if it's simply not challenging the way you perceive reality and or comprehend philosophy it's not a film that's worth-while watching. Even though I had my doubts after Prometheus, (In terms of the fact that way too many ideas were explored in the previous installment), this movie truly was the best patch to bring the franchise up to speed and commercialize it just enough so it's entertaining and intriguing, as well as appealing to a general public. No need for extra comments about small bits here and there, I'm not a \"professional movie critic\" but I rather very much enjoyed this installment. I just hope they can top it off next time, cause after this one there's a lot of expectation for the next installment. :)"}, {"score": "8/10", "review": "Alien: Covenant has a familiar narrative: a crew on a mission in space encounter an alien lifeform, become \"infected\" and have to fight for their survival. Yet this doesn't feel like a remake of the original Alien movie, or a sub-par spin-off. This feels fresh and exciting; breathing life into the saga once more.The movie didn't feel slow at any point in time - despite the fact that it does spend a fair amount of time building up - and didn't feel too long. The writing, directing, and pacing are all excellent: Ridley Scott's signature recipe.Without giving anything away, we see the return of a (very) familiar face, although major developments have been made since our last encounter, which are - thankfully - well explained. We are given answers (although not all) to questions raised previously, and given the information needed to chronologically connect Alien: Covenant to the rest of the saga. This movie goes to great lengths to redeem and justify the preceding Prometheus movie.All in all, Alien: Covenant is a fantastic addition to the Alien franchise. If you are a fan of the Alien movies and were left feeling at all disheartened after Prometheus, I can recommend this movie to you without reservation. Not only does it make up for Prometheus' shortfalls, it infinitely adds to the saga, before carefully setting up for further instalments. The combination of revelations from and developments since Prometheus, engaging cast members, plot twists, commitment to staying true to its roots and simultaneous innovations, make for a stellar watch."}, {"score": "10/10", "review": "In this climate of reboots, I'm genuinely surprised Covenant has scored such lukewarm scores. This is exactly what the fans has been waiting for. Everything blends smoothly and seamlessly, the fear, gore, horror and philosophy. Watch this, support the director, and vote with your wallet. This is what the fans want."}]