[{"score": "10/10", "review": "John Wick 2 is a great sequel that wasn't underwhelming it produced great action scenes great performances and there wasn't a dull moment in sight, its more fast paced than the first but all in good favor, Keanu Reeves gives it his all and adds a lot to these movies I'm hopeful that this continues on to be a great franchise, we got are first peek into the mob underworld in the first movie and in this movie its more fleshed and we get to know more about wick as the story progresses as I said it adds more to the story in every aspect which is to be praised. I also believe that the action set pieces in this movie topped its predecessor with stunts where you tilt your head in amazement. Only negatives sometimes the movie doesn't take time to stop and let you have a breather but otherwise its a very impressive movie with great acting, story and action sequences. JOHN WICK YOUR NOT VERY GOOD AT RETIRING!!"}, {"score": "10/10", "review": "To put it simply, the movie is fascinating, exciting and fantastic. The dialog, the fight choreography, the way the story moves, the characters charisma, all and much more are combined together to deliver this masterpiece. Such an amazing flow, providing a fusion between the 90s and the new century, it's like the assassins are living in another world, with another mindset, without people understanding it. Just one advice for you though: Don't build an expectation of what you want to watch in this movie, if you do, then you will ruin it. This movie has it's own flow and movement, so watch it with a clear mind, and have fun."}, {"score": "9/10", "review": "If there's an equivalent of classical orchestra for untamed unapologetically brutal carnage, there's no doubt it'd be John Wick. Dancing through hail of bullets, horde of assassins straight from video game, oozing noir style from each drop of blood, John Wick: Chapter 2 is nothing short of an artistic spectacle.John Wick (Keanu Reeves) returns to the killing business begrudgingly as one of his old acquaintances asks for a morbid favor. The cloak-and-dagger scheme soon flies into multiple directions, partially towards the back of few characters and the rest goes straight to the chest. There's an air of familiarity as the movie visits previous characters while introducing an array of new ludicrous ones.It keeps the formula nearly identical, adding more to its melee and shootout fun. There's everything one loved from the first, now pouring abundantly. Combat is arguably the best action choreography one could possibly ask for. Punches, kicks, submission holds, and even dirty pokes are delivered with sheer primal vexation and the finesse of ballet performance.Both the anti-hero and his rivals press forward in locomotive of mayhem, any fans of action movies and combat sports will be gleefully entertained. In fact, such simple concept of \"one versus many\" is ageless and universal, it worked since Bruce Lee's time and now told by razor-sharp spectacular visual, John Wick is the finest action of modern time."}, {"score": "9/10", "review": "Wow, this is one of the best action movies that I have seen in quite some time. It is really what I was hoping for in a good old fashion action movie that was done entirely on hand to hand combat and gun shootings. This is a wonderful kick-ass movie where the killings were done so brutally with lots of bloody scenes. It also kind of remind me of the various one man army movies in the 80s played by Sylvester Stallone or Arnold Schwarzenegger. If you have seen John Wick the original (which I hope you have seen it before you see this one), then you will be amazed with this sequel. It was bloodier, more fighting, more assassins trying to kill John and longer running time. What I can say is this is an even better version than the original movie. Although in term of story, there is a bit of a more complexity in the sequel as opposed to the simplicity of the original movie.All the fighting scenes were choreographed wonderfully according to my opinion. The guns shooting scenes were entirely cool. I loved all of them and there were no fighting scenes that took too long to finish. Keanu Reeves' portrayal of a retired hit-man who had no choice but to come back was really spot on. There were also some minor characters from the original movie who appeared in this sequel and also new character played by Laurence Fishburne whom I believed would play a large part in chapter 3. Yes, there would definitely be another sequel based on the ending of this movie, which really made me so excited and cannot wait for it to be released.Aside from the very cool amazing action sequence, the sound effects of this movie was very good such as the sound of cars screeching, guns blazing and the voices of John and Cassian's heavy fight which I thought sounded very original. My recommendation if you want to watch this movie, it should be watched in a theater with good sound system. Since there were many bloody brutal killing scenes (including 1 suicide scene), the Indonesian censorship body had given 21 years above rating. So yeah, this movie is definitely not for kids. For those of you who want to enjoy a pure action movie with Keanu Reeves as the main star, this one should not be missed. Don't forget to watch the original movie first so you would understand the story line. But for those who do not really enjoy this kind of movie (or cannot stand the bloody fight scenes), then this might not be suitable for you. This is one heck of a movie and I for one truly enjoyed it and would recommend this movie to any fans of action movie.for my complete review, pls see michaelnontonmulu.blogspot.co.id"}, {"score": "10/10", "review": "Let me be honest,this is my first ever review. Just felt compelled to do so since this film is what we can call a sequel. If it's not better,then it certainly filled the shoes of its predecessor.The action sequences are better, choreographed so well that it felt authentic. The killings are logical, even though at some points the bad guys became generic henchmen who can't shoot straight. But the world created for this sequel is fascinating in every way, making it impossible not to like the things that happened throughout the movie.Tldr, if you like the first one, then it's a no brainer for this next chapter. And sharpen your pencil, you'll need it."}, {"score": "1/10", "review": "This movie has a lot of problems, it was really the same story as to their last movie its just john wick shooting and fighting people all movie, nothing special about this movie, i would not watch it again. In the first john wick movie they kill his wife and dog than take his car and leave him for dead. He came out of retirement and started training to get payback on his enemy. John wick is just a man who carries a gun on him no matter where he is. I really did not enjoy this movie, i was hoping there would be something new and better about this one considering they promoted this movie so much. at the end of the day its just a dumb story about a man with a gun its not good."}, {"score": "6/10", "review": "John Wick Chapter 2 pits Keanu Reeves' titular character against the mean and nefarious of the criminal underworld. Once again, Reeves proves that he is a force to be reckoned with in this ridiculous, over-the-top sequel that is every bit as fun as the original. These types of films are rarely known for their artistic value but John Wick: Chapter 2 sets the bar pretty high, not only in its action, but in it's set design and camera work. This is pure escapist entertainment and couldn't have come at a better time. Those wanting to take a break from watching the Oscar nominees, this film is exactly what you're looking for.The look and feel of the film is very much in line with the first. It is nice, vibrant colors that compliment the violence and chaos. The sound is absolutely amazing with each gun sounding the way they should instead of using the stock machine gun or pistol sound which is something the original was guilty of at times. The performances are awesome, even if Common is rehashing his Run All Night character even down to his wardrobe. And the direction of the action sequences is beyond impressive. This is a bigger John Wick and one that does a nice job at expanding on this guy's world. It really becomes a pulpy and interesting world that I'm sure we'll all enjoy a third time around. The only issue that the film may have depends on your taste in action films. This is considerably longer than the original (almost by 20 minutes) but it moves so fluidly and so frenetic that it barely feels like it. Overall, John Wick: Chapter 2 is one hell of a sequel. It has everything a sequel should have and definitely doesn't disappoint. If you loved the first one then you're probably going to love this one. It is a straight up, balls to the wall thrill ride that is more than worth the price of admission."}, {"score": "10/10", "review": "I am retired at 41 years old and watch movies all day and night. I take my action films very serious.. From Die Hard to District 13, from First Blood to Taken... John Wick 2 is one of the best action movies I've seen. Simply put.. on a scale of the good old 80's red blooded American action films, John Wick 1 will draw you in and make you a fan, John Wick 2 will satisfy your soul with the 2017 evolution of 80's action with a feeling of have hit the gritty lotto. This is a man's man film that should be enjoyed after a hearty steak dinner (as I did tonight). I may have to go see this again."}, {"score": "8/10", "review": "This movie takes a little while to really get started - by this I mean the first half of the movie is going through the motions as far as story goes, with the set-up being that Wick owes one of those 'blood oaths' to a criminal scumbag and, after the guy sets his house on fire (as if he expects a smile to come from Wick with this task), he has him go kill his sister in Italy, who sits on some worldwide-criminal-council thing - but once it does, and it really does about 35/40 minutes in (and even more-so once Wick comes back from Rome to NYC), it's a violent pot of fun.There's not much to intellectualize with this kind of filmmaking - like in the first movie, you get what it advertises, as Reeves kills a lot of people. I think what carries it over from being potentially boring or dreadful is that the execution is excellent. Chad Stahelski, who co-directed the first bone-crunching/guns-firing-knives-stabbing extravaganza, returns as solo director working from what must have been a thin script from Derek Kolstad. By this I mean not just in dialog, though Wick is a decidedly 'talk-less-action-and-looking-listening-more' kind of action anti-hero, but also that the director, who was a stunt-man for years, set out to craft this film completely during the shooting, with some minimal editing. What sets it apart from other action drek is Reeves as a formidable presence (the less he does, too, the better for us all), and how the director and his DP choose to shoot it, favoring comparatively to today long(er) takes and a flow to the action that is kinetic without being overly so.In other words, if you somehow dragged yourself out to Jason Bourne last summer and left with a migraine headache, then this is the opposite of that. Once the action gets to New York, and the villain character fully puts his set-up of Wick into motion (how Wick didn't see it coming is a flaw, but I'll let that go for now on this viewing), everyone is out to get Wick and the intensity comes from all of the staging. I can't stress enough that if you love action direction that has clarity and UMPH to it, this is your kind of movie. Not to mention there's the added bonus of having Laurence Fishburne as some pigeon-cooper type who also has his own underground homeless(!) criminal element going on. I wished there was more of him, as he plays this character with a perverse joy to everything (even how he wears a robe), but hopefully there's more to see in part 3 - and yes, there will be a part 3, I can assure you.The highlight I must mention before I wrap this up: a sequence involving mirrors at a museum. Oh goodness is this spectacular work! Again, there's not exactly \"story\" here, but there is a progression of events and how the characters move in this environment feels less like a rip-off of a, I dunno, Enter the Dragon style climax than a part homage and then partly doing something else (at times the way the director uses color is absorbing too, like out of the best parts of Skyfall). I could watch this sequence over and over for how assured the staging is, how we always know where the characters are or, if we don't, it's not for too long, and how visceral the action is maintained in this setting. I could recommend the movie on this scene alone - that there are other set pieces that come close to its virtuosity makes it almost a must see.To close, I don't want to rate this TOO highly; at the end of the day, John Wick Chapter Two is action junk, a comic book with little on its mind but to get its guns-and-punches audience frothing at the mouth. But it keeps being an intriguing comic-book for adults, and it builds just enough from the first movie's quasi-mythology (once again Ian McShane is the \"manager\" of this hotel that is exclusively for hit men and criminals it would seem). This is a world that is not entirely meant to be in a reality, but creating its own, and that kept me interested despite the familiar beats."}, {"score": "8/10", "review": "I was planned to watch the FDFS from the day they announced the sequel coz i was totally addicted to the Introduction movie of John Wick. I went to the movie with sky high expectations. This time the story revolves around John Wick, who wanted to clear his debt from the past ending that to become a fugitive in the underworld. He had to survive at any cost where the whole assassins are looking for him to claim the bounty.The movie is bloody, gore, violent and absolute treat for the action loving cinema-goers. The story was pretty good, filled with adrenaline pumped action sequences but most of the moves are repeating and was tiring for me. But couple of action scenes were top notch and you can see the brilliance of action choreo turned director Chad Stahelski. The background score added the toppings. The dialogues were good. The camera-work was exceptional and convincing. The VFX did a good part in the action scenes especially with the car chase and action in the beginning. But movie has got the lag in between which will ruin your appetite. Some of the action scenes were illogical, making the hero as immortal and fatigue free.. Keanu Reeves was totally amazing in the movie with his ice cold mannerisms, dialogue delivery and of course, action. Lawrence Fishburne did a cameo and am expecting him in a full role for the next installment. Rest of the crew including the cast from the First installment were there and did a good job.From my point of view, this didn't meet my expectations and falls just behind the first installment. For Me, JW 1 is better than this.I would go out with 7.2 on 10"}, {"score": "8/10", "review": "I won't say this film is better than the first, however it is rather remarkable. The only problem I really had with it was the fact that the deeper the film went, the more detached from reality it became. Seriously, could one guy, even after being cut and shot and stabbed, take down hundreds of goons? The body can only take so much damage, you know. I guess that's why John Wick's name is known by all and feared by most of them. Other than that, I loved the film and can't wait to see what they do with Chapter 3. I hope it comes out soon, but at the same time I hope they get it right and top these two."}, {"score": "9/10", "review": "I'm not going to spoil the plot or any of the most memorable action scenes from the movie, I'll just write this: John Wick: Chapter 2 is a worthy successor of the first movie, it expands the universe, giving you insight into the interior of the world of assassins and maintains the insanity of action sequences from the first movie. Memorable scenes, unexpected humorous tone of some dialogues and shootouts, really interesting world and Keanu Reeves who, as usual, commits 100% to the action sequences (just watch his training videos on youtube, mad respect for this guy!) I believe that true efforts to entertain you should be rewarded. In a world of shitty, worthless, cashgrab sequels (like, say, Fifty Shades Darker, released the same day as John Wick 2), sequels like JW:C2 deserve to be praised. Amazing movie! 9/10"}, {"score": "7/10", "review": "This movie got more money than the first one and it didn't got wasted. The movie looked gorgeously. John Wick was a badass again and he kicked some ass. I liked that John Wick had new cool memorable phrases and his stunts were incredible. I heard that he done about 90 % of them by himself and that really proves that he puts a lot of work in his job Keanu was really good in this movie. The movie shows more about assassins life and about their rules and that was awesome to see I am glad that director listened to the fans. Because of this deeper insight in assassins, better visual looking, awesome action sequences its safe to say that this was better than the first one of course the first one was good also I gave it 7 and this one gets 8.After all I really recommend you to watch this is one of the better movies this year so far."}, {"score": "9/10", "review": "No electric boogaloo here, This is one of the best Sequels ever made!Keanu Reeves gets that Mojo working again with the next chapter of the life of John Wick, known as the Boogieman to those in organize crime, he gave up his life as a hit-man (THE hit-man) for the woman he loves just to loose her to cancer. He was going to stay out until they killed...His dog! Granted, it was the dog his dead wife gave him postmortem but man, he went berserk on the idiots that did it.Unfortunately, his actions put him on the radar of a man who wished to cash in a marker John gave him as a way to leave the game forcing the Boogeyman to get back to work.It's a bigger action flick than the last John Wick. More fighting, more gunplay and more violence. A very unique action film in the fighting style they chose to do. Not as fancy as you'd expect it's a little more real and rugged.And very violent. You get to see the things that they only talked about in John Wick. It's kinda like they wanted to show you what John Wick could do in the first movie but did not have the money so they just told you, and now that they have the money they'll show you, and they do a beautiful job of it. The cinematography and the art direction perfectly contradict the graphic details of the killing business Wick is so good at.And Keanu man! What is this like his forth comeback? John Wick is literally catered to this man's style of acting. Not much in the words, says a lot with very little and says even more with his action. It's like a John Wayne Clint Eastwood deal with John Wick being this seasoned outlaw who wants to be left alone but comes from a world where that's impossible because he's so great in this element.Herd somewhere that the production team for John Wick is made out of the Stunt team for the Matrix, and they most likely have been talking about producing this on camera stunt extravaganza for years, and they made it perfect. It's fun and exciting and filled with those moments that make you scream out \"oh snap!\" every few minutesIt's rare when a sequel is able to take the exact magic that made the first movie worth seeing and create something much bigger and turn it into something better. John Wick, Chapter two does this.You gotta see it!http://cinemagardens.com"}, {"score": "3/10", "review": "When it isn't using dialogue and concepts from comic books, Chapter 2 turns into a video game with people being dispatched by bomb, pencil, knife, handgun, machine gun, auto, etc. But there are some lessons to be learned -Apparently you can be struck by a car going 30-40 miles and hour and merely bounce off.Apparently the entire City of New York is inhabited by assassins and spies, who pretend to be homeless, street performers, maintenance men, garage workers, etc.It's not completely terrible. Always good to see Ian McShane, Laurence Fishburne, John Leguizamo, Lance Reddick, and Franco Nero.The first John Wick was much better."}, {"score": "10/10", "review": "Absolutely AWESOME. NEED MORE JOHN WICK NOW!!! COME ONE JOHN WICK CHAPTER 3 I was worried it wouldn't be as good as the first...BOY WAS I WRONG... I CAN FEEL THE BONES BEING BROKEN I don't know where to begin... CAN WE GET MORE JOHN WICK NOW! More to the story CHECK More Action CHECK More bad guys CHECK Humor CHECK Violence CHECK etc... etc.. etc. I Cringed at The Nuts Being Smashed Go See This Movie! I AM Going Back Next Weekend. I need MORE! NEVER THOUGHT Brains being splattered would get the audience to giggle like I was doing! More assassins!! Wick is a Man of Focus! I WANT JOHN WICK CHAPTER 3 NOW!!! NOW!! NOW!"}, {"score": "1/10", "review": "I never had written any movie comment before but this time, the experience was just too bad.Our kids' daycare had a parents-night-out time today, so we tried to grab this chance to watch a movie. We missed the La La Land's starting time so I had to choose this one because of its so high score.But the experience was really disappointing. After one hour, we already kept thinking what could be left in another one hour. The plot is really plain, I just don't know what this movie is trying to say except continuous gun fight, which is nothing fancy at all. A total waste of once a year opportunity. If possible, I really wish I could request for a refund."}, {"score": "9/10", "review": "With the plethora of terrible and unnecessary sequels these days, recently \"Inferno\", \"Jack Reacher: Never Go Back\", and \"Independence Day: Resurgence\", \"John Wick 2\" is a welcome and refreshing surprise.Right off the bat, the film starts with a chase, and it rarely lets up. After this opening chase, which concludes with John getting his car back, he is confronted by Santino, a man that he made a sacred oath with in order to escape the underworld of hit men was involved in. Since he came back to that world in the first film (and the beginning of this one), he has broken this oath. He is now brought back in to (supposedly) do one last favor for the man that he owes.The character of John Wick himself is actually quite a troubled one. As you know if you've seen the first one (which you should watch if you plan to watch this one), John Wick had a wife that died, and now all he has left from that time in his life is his dog and his car. He is first forcefully brought back into the hit-man lifestyle, but it is possible that he enjoys his rampages and fits of vengeance, because without a wife or a home, it is all he has. At the same time, he clearly feels guilt and regret for much of what he's done, and what he's lost because of his actions. John is lonely, and his loneliness twists him throughout the story.While John Wick may be surprisingly layered for an action hero, the film is also incredibly efficient in the information we are given and how it is given to us. John Wick is the strong, silent type, and most of what we know about him is shown through the editing and the acting, which bluntly conveys exactly what it should, with a very physical performance from Keanu Reeves. The many other performances in the film are fantastic as well, especially Ian Mcshane and the short cameo by Laurence Fishburn. The world building is also impressively done, with most of it just being shown to us, and only what needs to be explained being explained to us, such as the two rules of this business. Sometimes, character and world building is woven into the action. Oh, and what incredible action. This has - hands down - some of the best action scenes in this decade, and probably even in subsequent decades before it. Chases, hand to hand combat, shootouts, you name it; it's all here, and it is all fantastically shot and edited, perfectly choreographed, and consistently creative and intense. The frame is wide and the shots each last long enough to have a clear view of the brutal and precisely choreographed action, unlike many action scenes in modern Hollywood. There were several moments where my jaw was literally dropping at how intense and consistently original all of the action was. Even though John takes out hundreds of people, there is always a genuine sense of struggle in each fight, and each encounter is unpredictable, with a constant sense that a fight could break out at almost any moment.The constantly vibrant color palette, the stylized subtitles, and the sense of humor throughout the film also all show that the film isn't taking itself too seriously. It knows that it is over the top, and it realizes the absurdity of the situations, and often makes comedy out of it. It is self aware about the crazy 80's-style action shclockiness; it knows exactly what it is, which is a non-stop, full force, fun action film, with just enough time in between to give context, characters, and motivations that you understand. It is the rare sequel that surpasses its predecessor, and one of the best action films I've seen in ages."}, {"score": "7/10", "review": "Positives: This movie had awesome action scenes. A bit over the top in some parts, but this is John Wick so that was expected. The location and scenery was absolutely spectacular. It also had some humor in it, more so than the first.Negatives: Lacked the emotion from the first film (won't go into detail because of spoilers). The plot line also got confusing at times. It wasn't as straight forward as the first film.Overall: Don't go in expecting a drama/action movie like the first one had. Go in expecting awesome fight scenes with a little comedy here and there."}, {"score": "10/10", "review": "John Wick: Chapter 2The first one grabbed the audiences by throat. It was in your face on how to innovate and capture the dance of Gun-fu. But what made the first one captivating was its presentation of the crime and assassins' world, their code of conduct, their hangouts, the hotels they stay- in, etc. It seems that Chad Stahelski knew what made the first one so fascinating and did a commendable effort in creating a further depth in this world. John Wick seems like a book cover only versus the Chapter 2, which comes across like a whole dossier on this underworld's crime kingpins and how the hired killers operate across the globe. I am still wondering who is the managing the accounts opening department. Guess this is another point very successfully developed in the movie and by the end of it, you want to know more about the operations of this underworld. And this need for knowing further left you wanting more Chapters.Chapter 2 start with a usual chase scene. Its robust, skillful, too long but ends unexpectedly. It reminded me of another movie, Blade II. which was 2nd in series, had exactly same way starting with a chase in continuation from the first movie. But as the movie progressed, you realized that how amazing the story line and much bigger and bolder are the action scenes. Chapter 2 is audacious and has enough action to fulfill Adrenalin and video game junkies. It doesn't have any character that are there just there for the need of the scene. I will look forward to return of that henchman in Chapter 3 that was left on the train with a blade in his heart.Having discussed the greatness of this movie, I still find bit difficult to believe that smart man as John Wick agrees to do one last job to free himself from the oath. The kind of a job which is self- explanatory that there will be consequences after this hit. So why even accept it and not kill the one who burned your house. However, by the end, the movie is bit heavy handed in dealing with the psychological pressure that John Wick faces as he sits with his nameless dog in his burned house and mourns the loss of his life, his beloved wife and the emptiness of his heart. Its takes a rare risk to show how this undefeatable anti-hero will face the same fate as anyone who breaks the rules of the house. I love when movie makers are willing to take chances to show that even the mighty ones have a limit and powerless of their fate. Above all like us they are extremely flawed driven by their primitive need to fulfill their immediate hunger.John Wick Chapter 2, like its predecessor is one the best action movies in its specific category. It works like a video game during the shootout scenes but from time to time it slows down for hand to hand combat and giving you a glimpse of grit and resolve the characters have. It always a pleasure to see that besides the main protagonist, other players are also as skill full, intelligent and as fierce as John Wick.This time also, the wick goes off and creates an explosive experience. In the memory of my favorite movie citric Roger Ebert, I would like to say that this movie is two thumbs up and way up. 4 out of 4 stars."}, {"score": "7/10", "review": "I reckon you saw the first john wick, so you know what to expect this time. I didn't, so I didn't. apparently mr. wick has retired, but unfortunately for him and his dog with no name, he has an iou outstanding, which must be paid back. mr. wick refuses to honor his commitment, and as is usual with these things, there are consequences. and so, mr. wick takes on his assignment. with gusto. I lost count of how many heads were blown off, but it was a lot. the audience applauded at the end. so there. in all honesty, the action sequences are spectacular, the scenery is beautiful and the whole thing looks expensive. Laurence fishburne has a nice cameo as a pigeon fancier. john leguizamo fans will be disappointed. I must give mr. reeves a lot of credit for getting from beginning to end."}, {"score": "10/10", "review": "John Wick Chapter 2 was everything I had hoped for, and more! I had high expectations for this movie because I LOVED the first John Wick. I almost overdosed on violence with this movie and I loved it! We got to learn more about The Assassin World and The Continental. We got to learn more about John Wick and how strategic and deadly he truly is. There are a couple of scenes that slightly reminded me of The Matrix trilogy, which internally kind of made me laugh.There is some slight humor to this movie but it has perfect time and is very well done. It's not cheesy or corny at all. It fits the movie style.I seriously hope they make a 3rd John Wick.I am definitely going to watch this movie again, next weekend."}, {"score": "8/10", "review": "Keanu Reeves returns in this anticipated sequel. Does it deliver everything that audiences loved about the original but bigger and better? I'd say that's a definite yes. If you're looking for story and depth then this isn't your movie. If you're looking for non stop action and where the body count is too high to keep count, then this is your movie. It was a lot of fun. The movie is gritty but it also knows how to keep things light. Reeves shows no signs of slowing down as he unleashes his arsenal of weaponry and hand to hand combat on anyone who gets in his way. It was also cool to see him and Fishburne share the screen together again. I'd definitely recommend this to fans of the genre.https://www.youtube.com/watch?v=rmsS_UV3TIE"}, {"score": "10/10", "review": "When I heard that a sequel was being filmed i didn't believe it at first but then a few pictures where released and it got me super pumped for this movie. With the experience I've had with other action movie sequels, i believed that this would not be nearly as good as the first john wick movie but it surprisingly was! in fact, this is the first action movie sequel I've seen which is better than the original movie! now that's a big deal to be honest. I love how they didn't reveal the plot of the movie whatsoever and actually experiencing the plot unveil little by little was pretty mesmerizing. another thing that they achieved in the movie which was awesome was the world building. Oh and the action sequences were just exquisite! you could look at keanu reeves in the eye and tell that he's doing 90% of the action and stunts. The camera was still and you could see who's getting hit and who's getting killed unlike other action movies (cough taken cough) where the cameras are all shaky and they try to hide the stunt doubles in between the shots. personally, i wanted to know more about the secret assassins world they have and learn more about it and that was EXACTLY what they did in this movie. In short : john wick chapter 2 is a great movie and i recommended it to everyone. If you liked the first one, you'll love this one. 10/10"}, {"score": "8/10", "review": "The Boogeyman has had a lot of different forms over the years from grotesque features, grossly deformed into the vision of nightmares to a man with slicked back hair and a\u0085 depressed look on his face? No, I'm not delirious my friends, but the reference I made is to the codename of John Wick, the legendary assassin of 2014. After a thrilling, and complete conclusion, one may have thought Wick's journey ended there. Obviously, Hollywood did not think so and thus comes Chapter 2 of the action adventure and whatever, random target that is assigned. Robbie K here, and today we take a look at John Wick: Chapter 2. Let's get started!Likes: \u0095 Dry sense of humor \u0095 Visuals and special effects \u0095 Stable camera work \u0095 Lots of action and excitementSummary: There isn't much in regards to John Wick, so finding a like outside of action, but one component is the dry sense of humor this film has. Wick (Keanu Reeves) is a man of few words, but the few he speaks are worth a good laugh. The writers win points for a dialogue that is both pun filled and classy, timing them at key points to maximize laughs while sticking to the stoic nature of our players. Yet the humor is just an added bonus to what is John Wick's strongest feature, the action. All the reviews are in agreement that Wick is back with more action than ever imagined, as this one-man army unleashes a storm of well-placed bullets, knife slashing (and sometimes pencil) stand offs, and Marshal Arts punches. Wick's skills with a pistol (among other weaponry) are intense displays of choreography, proving that you can coordinate extras dying to imaginary wounds in an exciting way. The hand-to-hand combat also gets points, not quite as developed as the 70s and 80s movies, but still an enjoyable element to mix things up. Helping support all the action is impressive special effects, which adds the extra flare and touch that gets our hearts pumping (e.g. explosions, crashes, and comic book bashing sounds). You can guess there is plenty of blood to go around too (for you gore seeking fans), which adds more to the chaos and violence at hand that somehow\u0085 adds a bit of satisfaction to the mix. But even better, is the entire film has stable camera work that keeps you scoped on the action without making you vomit due to vertigo. Overall, this exciting package gets two thumbs up in its etiquette, design, and impressive work on the action. Dislikes: \u0095 Keanu's acting (at times) \u0095 Simplistic story \u0095 Overstepping boundaries at times \u0095 Some fights a bit blocky \u0095 Unorthodox presentation \u0095 Slower parts a bit\u0085too slowSummary: While we never expected an academy for this performance, there are times where Keanu's acting is a bit too lax. His lines are meant to be serious, but come out awkward, effortless, and sometimes bored at the unoriginal dialogue. While this certainly isn't a big weakness, there are moments where this acting took away Wick's awesome factor, or made me chuckle unintentionally. Acting aside, the story is another limiting factor that Wick really needs some fine tuning on. Yes, I know story isn't the main theme of this series (hence why I make a genre rating people), but movie overall this film's plot is a little less put together than its predecessor. A random guy shows up, tells a vague back story to establish a weak connection, and then becomes another revengeful chase across two cities. All the convoluted (shallowly explained) relationships and teases did nothing but make more targets for Wick and did nothing to add to the story for me. Finally, while the action is indeed awesome and well done, there are still a few limitations that hit this quality. First, those who aren't fans of repetitive gun play and headshots, need to skip this film\u0085because that is a majority of the action. But outside of repetition, the action sometimes oversteps the boundaries of realism. A car mercilessly being smashed (and smashing) yet still running, a number of injuries that magically heal, and the inaccuracy of other assassins are just some of the eye-rolling moments of this film. In addition, some of the fist fights get very blocky, have awkward pauses, or lack the edge (music and sound effects) that make the fighting less exciting and more we just extending screen time. Another component I didn't like was how they reduced Wick's fighting of other assassins to a messy set of montages that seemed out of place and were lackluster compared to Wick fighting off nameless extras. Such missed potential for memorable rivalries, and more diverse fights. And even more missed potential, was the slower parts not taking time to advance a story, or establish better character dynamics, which made for some dragged out moments.The Verdict:Wick's journey of revenge and killing is certainly more exciting than his last ordeal. The emphasis is on the action, with a majority of the film geared towards the stunts, effects, and violence, so adrenaline junkies strap up and hit the theater. However, if you are looking for the complete package of story, dynamics, and balance, then this film isn't the right one for you. Wick still lacks a lot of other qualities in the movie overall category. Worth a trip to theater? Yes, as the special effects and excitement are made for the theater. But if you can't handle extreme violence then skip!My scores: Action/Crime/Thriller: 8 (for the action) Movie Overall: 5"}, {"score": "10/10", "review": "The first John Wick film was a great surprise. The story was simple and pure, the action and choreography were top notch and the hint at world building was very intriguing. When I heard that a second movie was in the works, I was worried that it would fail to live up to the original (as most movie lovers are). All I can say is that John Wick Chapter 2 is sensational. I watched the first film 3 days before watching the second, and my god was the action in Chapter 2 better than the first. Seeing the actual actor do most of these scenes really makes you believe that this character is real and that he's a force to be reckoned with. I loved the shootout scenes but my favorite are the hand to hand combat he does with higher level assassins like himself. The story isn't as simple as the first, but it really fleshes out the underground world of assassins in this universe. It introduces us to new characters, places and systems to really give us the sense that these are things that go on in secret all over the world. I like to give movies ratings based off what they're trying to achieve. This is an action movie, and as action movies go, John Wick Chapter 2 is one of the best action movies I've ever experienced and a truly worthy sequel to the first."}, {"score": "1/10", "review": "I have never seen anything so dumb in my life.. It starts with a preposterous disjointed chase scene in which the motorcycle being chased (far faster than the car in the first place) somehow runs into the car chasing him.. and then the title of the film and then it gets worse.. Even Keanu Reeves, the ultimate bad guy, is not bulked up.. just a scrawny beard and a scowl.. If you want to see a film where everyone Keanu meets, he kills, this is for you.. The reverberation in the theater that makes the gun shots sound real is about all that is good.. but with people mowing each other down in real life, I can't for the life of me imagine why someone would make this type of film or glorify killing. That people liked this film is even worse.. Stupid dumb movie.. And for those who think I should have seen the whole film before commenting.. yea right.. The movie never even remotely got better.. and the acting and directing and editing.. Everyone must have been on something.. I saw it the Fri night it came out because of the 9.0 rating! Stupid dumb movie And I see a remark about \"superlative stunt work\".. If you can imagine someone repeatedly getting up after repeatedly getting run over, etc.. and call that great stunt work.. I've .. well never mind"}, {"score": "3/10", "review": "Apparently I saw a different movie than the other people that have reviewed this movie, I can't see how anyone could have given this a good review.In the movie I saw, the camera work was often so close, that all you could see was blurs or confusion. You just saw mashing of clothing, the camera was sometimes so close you couldn't make out who you were seeing. At times, you couldn't even make out what was happening, and sometimes just had to wait for aftermath to try to figure out what had happened in the prior scene. Panning out the camera would have improved the movie greatly. Closeups do not always improve the action, and this movie proves it.In the movie I saw they would have you believe that almost every person in New York was secretly a hit-man, including an entire band of homeless people living on the street who were both homeless and hit men. To me, this was so goofy that it really ruined the story line, and I started laughing at how stupid this was. Of course, every single hit-man in New York, including all of the homeless hit men, all knew John Wick on a first name basis.In the movie I saw, they would have you believe that there are networks of secret hotels, and secret armories and secret suppliers all over the world that hit men use. Well, I guess if every person in New York is a hit-man, then this is necessary. But it just comes off as stupid.The plot, is that John MUST perform a task, which everyone knows will make him the most wanted man in the world, and if he doesn't perform this task, then he will be the most wanted man in the world. Kind of a really stupid plot.In the movie I saw, John Wick killed nearly ever person with a a single shot or single hit, EXCEPT, Cassain. John couldn't kill Cassain no matter what he did, and these two just kept shooting each other. But don't worry, John had a bullet proof suit that he bought at one of these hit-man stores. But, he is the only one that can afford these suits. Even though this store appears to do enough business that they have a full time staff making bullet proof suits, no one else has them. Nearly every other person dies with a single shot, so they clearly are not wearing these suits. Then there was the large Asian man comic relief, who takes a shot directly into the brain, and that doesn't kill him, he keeps on coming. Hmmm.To me, they took the best of John Wick 1, the best of Bourne, combined it with Doom, supersized it, and ruined it. Less is more guys.I went to this movie with high hopes and was extremely disappointed, mostly at how goofy they made the story line."}, {"score": "8/10", "review": "In Hawaiian, the native language of Keanu Reeves' biological father, his first name means \"cool breeze over the mountains\". Sounds peaceful, right? Well, early in his career, Reeves played pretty peaceful characters in 1988's \"Dangerous Liaisons\", 1989's \"Bill and Ted's Excellent Adventure\" and, in 1991, \"Bill and Ted's Bogus Journey\", \"Parenthood\" and as an FBI agent pretending to be a surfer in \"Point Break\". That last role also marked the beginning of Reeves' transition to more intense and even tormented characters, like in \"Bram Stoker's Dracula\" (1992), \"Speed\" (1994) and \"The Devil's Advocate\" (1997). Although the man with the peaceful-sounding first name still sprinkled in some sweet and peaceful roles (e.g., \"Sweet November\", \"A Walk in the Clouds\", \"The Lake House\" and a voice-over as a kitten named after him in 2016's \"Keanu\"), most of the parts Reeves played in the late 1990s and early 2000s have been decidedly un-peaceful – in movies like \"Johnny Mnemonic\", \"The Matrix\" (and its two sequels), \"Constantine\", \"Street Kings\", \"Man of Tai Chi\" (which he also directed), \"47 Ronin\" – plus \"John Wick\" and its sequel \"John Wick: Chapter 2\" (R, 2:02). Peaceful? Not hardly! Entertaining? You betcha! \"Chapter 2\" is a very appropriate phrase to include in this movie's title, for a couple of reasons. The action picks up right after the events of 2014's \"John Wick\". Having come out of hit-man retirement to avenge the murder of his puppy and defend his own life by dispatching scores of bad guys, he now comes for his stolen car, knocking off a few more thugs in the process, and then calls it even with the boss (Peter Stormare) of what's left of the crime family which John has decimated. He calls a mechanic friend (John Leguizamo) to repair what's left of his souped-up Mustang, reburies his weaponry in the floor of his house (under concrete which he lays down himself), looks wistfully at a picture of his late wife, Helen (Bridget Moynahan), takes care of his new dog (which he has not yet named) and, to quote the 1980's singer known as Rockwell, John might say, \"All I want is to be left alone in my average home, but\u0085 I always feel like someone's watching me.\" He has good reasons for thinking and feeling all of that.Since Wick (aka \"The Boogeyman\") came out of retirement (albeit for very good and personal reasons), the international organization of assassins of which he was a part now considers him un-retired. (After all, John himself said in the previous film, \"People keep asking if I'm back. Yeah, I'm thinking I'm back.\") Italian assassin Santino D'Antonio (Riccardo Scamarcio), a member of one of the families represented at \"The High Table\" of assassins shows up to hand his old friend an amulet with John's bloody thumb print inside, a token of what Santino says is a blood oath which was reinstated when John came out of retirement. John is now obligated to fulfill a \"request\" by Santino or he himself will be killed.Winston (Ian McShane), the manager of New York's Continental Hotel (a kind of safe house and DMZ for international assassins), reaffirms to John that those are the rules and there is no other way, so John heads to Rome to do his job. John proceeds with his trademark classiness as he plans to\u0085 execute his responsibility. Of course, nothing will be easy, even for John Wick, and he'll eventually have to defend himself against a number of deadly agents, including one played by Common, and another by Ruby Rose, but he also gets help from \"The Sommelier\" (Peter Sarafinowicz), who deals in a lot more than wine, Charon (Lance Reddick), the classy and extraordinarily helpful concierge at The Continental Hotel – and a blast from Keanu Reeves' own cinematic past (a cool cameo which I don't want to spoil).\"John Wick: Chapter 2\" is an enjoyable, stylish and action-packed thrill ride. As good as the original film was, this one keeps what worked so well the first time, takes the plot deeper into the main character's world and adds several interesting new characters. It's an intense action shoot-'em-up, but it's not just the guys who get to have all the fun. (Beware of mute female henchmen, lady violinists on the subway and women who would rather slit their own wrists than become a hit-man's victim.) Besides its many colorful characters, this sequel keeps audiences engaged with its general air of sophistication, its stylized action sequences and visually sumptuous set pieces that are\u0085 to die for. If you don't mind a high body count and a few vagaries in its plot points, this is everything an action sequel should be – including setting the stage very well for \"Chapter 3\". For now, I'll close this \"John Wick\" chapter with\u0085 an \"A-\"."}, {"score": "1/10", "review": "I am writing this as I walk out of the theater I was just sat in watching this movie. I am completely confused by the fan base of this movie. This movie was garbage. The script was written by a 5 year old and the amount of pointless death is uncanny. I don't understand these 10/10 reviews. I'm not sure if it's the reviews or the movie I should be more worried about. Don't waste your money and time. I'm not even a wealthy guy but walking out on this was the best decision I've made of 2017 so far. Had I two broken legs I would have still walked out on this movie. I hope that John Wick 3 a documentary about Keanu Reeves taking acting lessons for the past two movies he did for this series so I can try and fathom what made him want to do these cringe worthy movies."}]