[{"score": "7/10", "review": "I just saw a sneak preview of Kong: Skull Island. I don't think this will be a long remembered monster movie. It's a fun movie, but ultimately forgettable. The CGI Kong, Samuel L Jackson, and John Goodman all took a backseat to John C. Rielly, who did a superb job playing a WWII pilot who was shot down and landed on Skull Island. Seriously, his role is the greatest thing in this movie.The movie is set in 1973, and the premise is that LandSat (land mapping satellite) has taken pictures of an elusive island (Skull Island) that has been rumored to exist, but not proved. John Goodman convinces the government to launch an expedition to explore the island. They take some soldiers who were pulling out of Vietnam, and are headed by Samuel L Jackson. They also pick up a British ex-special forces \"tracker\" (Tom Hiddleston) and an \"anti-war\" photographer played by Brie Larson.They start the mission by dropping bombs on the island to map the bedrock, ostensibly to look for mineral deposits. That's when Kong shows up to smack the helicopters out of the air, and generally wreak mayhem on the team. The scattered survivors then have to survive on an island filled with monsters and get to the extraction zone. One group finds John C. Reilly's character, who has been stranded on the island for 29+ years.That's about all I'll say about the story, so as to avoid serious spoilers. The story line is fairly conventional with very little arc to the characters. In many regards it actually sets up more like a horror movie than action/adventure movie. In fact, there are numerous jump-scares and other horror movie devices throughout the movie.In many ways, it felt like the movie couldn't quite decide what it wanted to be. Is it a monster movie? A horror movie? An action movie (anti-war)? There are also numerous characters who seem like they were intended to play more significant roles. For instance they bring along a biologist, played by Tian Jing, who does no biology and seems to mainly appear to allow another character to give exposition. Similarly most of the LandSat team, who seem to be around for comic relief (horror movie style comic relief). Even some of the major characters do little aside from provide a single plot piece.Then there is Kong. I think they could have spent a bit more time developing Kong, partly as a character and partly as an animation. The CGI was pretty good, but his proportions looked wrong and his motions were wooden.Anyway, I think there was just too much going on, and not enough time for this movie to be really good. I think it could have been an excellent mini-series, or TV season. As it is, it's an okay movie, that is fun if you go in with a low-bar. 6/10, so I enjoyed it, but not enough."}, {"score": "7/10", "review": "Some people go to the movies to be wowed by the superb acting, heart wrenching and well written story, and overall solid production... THIS has good effects? The acting in this film isn't bad, but it definitely won't win any awards for it. The story has characters Bill Randa (John Goodman) and Houston Brooks (Corey Hawkins) piggybacking on an expedition to an uncharted island to test their \"hollow earth\" theory. Tom Hiddleston plays a tracker, Brie Larson plays a photographer, and John C. Reilly plays a surprisingly funny WW2 vet marooned on Skull Island.The film takes place in 1973 and loves to remind you with CCR and old technology as if it was a hundred years ago. Kong: Skull Island pays homage to Apocalypse Now quite frequently even though it seems a bit excessive at times.Kong looked good, almost all the creatures looked cool and all the fights between them looked really good, especially in IMAX 3D. Some of the green screen effects, like backgrounds behind characters, were distractingly bad. Ultimately, you get some great stuff out of all the effects if you're not looking too closely.The characters are more hollow than the earth (according to the film's characters themselves), the story is mediocre, but the effects reign king in this film adaptation. My suggestion: See it! it's a blockbuster meant to fill seats, not win awards. Take it for what it is.Seen at an advanced IMAX 3D screening in Minneapolis."}, {"score": "10/10", "review": "No Spoilers here.Kong: Skull Island is the perfect monster movie. It's an epic display of what a popcorn movie should be. Great visuals, soundtrack, and a pleasant plot that is not bogged down by the melodrama that killed the Godzilla flick from 2014. It's a giant monster movie. Have fun."}, {"score": "9/10", "review": "I had a free AMC preview of the movie on March 1st, 2017. My husband is not a fan of some of the actors in this film BUT he loves KONG! So, during the movie I felt he was enjoying it. I'm not going to give away anything because I hate when people do that; all I will say is the skull crawlers gave me a nightmare and the entire movie from start to finish was really really good. The plot was good, the acting was outstanding. I really felt I was in the 70's. The music in the movie was dead on perfect. Hope you go out and support this movie because I am sick of remakes and this is NOT one of them, This movie stands alone by itself! A MUST SEE...Stay to the very end..."}, {"score": "7/10", "review": "No sequel, spin off or remake has come close to matching up to the mythology of the 1933 classic, and just to be sure, neither does this latest iteration of pop culture's mightiest simian. Instead, this origin story largely set in the 1970s when America was pulling itself out from the quagmire of the Vietnam War inspires to be no more and no less than a monster-mash adventure of epic-sized proportions, pitting not just Man-against-Kong but Man-against- nature-itself, the latter represented by supersized species the likes of towering spiders, blue-blooded pterodactyls and giant saw- toothed lizards referred to as Skullcrawlers that are all too eager to get a literal taste of human flesh. Oh yes, this is a CGI showstopper in many, many more ways than one, with state-of-the-art Industrial Light and Magic technology complemented with inventive creature design by Carlos Huante to create a fitting modern-day throwback to the B-movie action-driven creature features of the past.Dispensing with any hint of nuance, the straightforward and utterly functional plot has John Goodman's scientist cum bureaucrat Bill Randa assemble a team under his top-secret government-funded Monarch project to explore the hitherto uncharted Skull Island, a long- hidden landmass in the South Pacific hidden by constant electrical storms and magnetic interference which has been only recently uncovered by the first Earth-mapping satellites sent up into space by the US. Among those whom end up one way or another on the mission: Tom Hiddleston's former SAS officer turned tracker-for-hire James Conrad, Brie Larson's anti-war photojournalist Mason Weaver, and last but not least Samuel L. Jackson's embittered Lieutenant Colonel Preston Packard and his helicopter squadron (some of the more recognizable faces include Shea Whigham and Toby Kebbell). There are about a half dozen other characters too difficult to keep track once the film gets underway, such as Jing Tian and Corey Hawkins' pair of token-minority scientists who get a couple of pointless lines and no real purpose.Withholding knowledge of the real intent of the expedition to \"document the existence of massive unidentified terrestrial organisms', Randa instructs Colonel Packard's men to start dropping bombs from their helicopters under the guise of mapping the island seismographically, which naturally irritates the hell out of its eponymous chief resident. Kong's grand dramatic entrance consists of hurling a napalm tree towards one of the choppers, before tearing through each and every one of them by either ripping them apart or tossing them against each other. Oh yes, you'll be glad to know that (unlike Randa) Kong doesn't hold anything back right from the get- go, meaning that you will get to see him in all his massive vicious glory in every single scene that he is in. That awesome introduction not only cuts the ensemble down to those in the opening credits and divides them into two groups, but also sets up the enmity between Kong and Packard.Given the simplicity of the storyline, it is no surprise that the characters are but stock types – in fact, the most fully developed character only joins midway through the film, a WWII vet named Hank Marlowe (John C. Reilly) who survived the Japanese pilot after him when both their fighter planes crash-land back in 1944 and has since learned to live peacefully among the natives there. Reilly steals every scene he is in – more than just as supporting comic presence, he is a real live wire injecting warmth, humour and dryness as an eccentric lost-in-time pilot. Jackson comes a close second with his brash gusto, but the rest of the actors are not much better than as body count.But really, who are we kidding – you're probably not here for the story or the characters but the damn ape himself, and boy, does he look magnificent. With tactile fur and soulful eyes, Kong comes to life in breathtaking realism, aided with motion capture by 'Dawn of the Planet of the Apes' actor Terry Notary. This Kong is majestic on his own (one such moment has him taking a break in a lake while Kebbell's terrified major watches from behind a rock a few feet away), and jaw- droppingly powerful during any one of the startlingly photoreal sequences of bestial combat. It bears noting that the monsters which emerge to challenge Kong or which simply make an appearance as part of the fauna of the titular island are also just as stunning, especially a confrontation in a foggy graveyard between the remaining survivors and a Skullcrawler and the climactic Kong- versus-giant-Skullcrawler smackdown that is impressive even by modern-day CGI standards.Despite being a visual effects novice, indie director Jordan Vogt- Roberts proves right at home in a big-budget motion picture. He creates an immersive pre-historic paradise to complement the exciting monster scenes, and mixes 70s war imageries from 'Apocalypse Now' and 'Platoon' into the 'Jurassic Park' setting to keep his audience hooked. Because of his firm grasp on pace and rhythm, what is two hours feels much less so – and if there is one unintended outcome of that, it is the fact that we end up wanting to see more of Kong. As much as it is Kong's movie, there are also stretches in between where he is nowhere to be seen, and the other nasty dino-like creatures on Skull Island take center stage to exert terror on the human intruders. Ultimately, this is a movie fashioned on pure action spectacle, using state-of-the-art CGI to breathe new life into the old-school monster movie mash genre (you would do well to note that this is meant to be an origin story in Legendary/ Warner's MonsterVerse franchise, setting up the beast for a planned showdown against Godzilla in 2020). It may all seem familiar, but that doesn't mean it isn't fun or thrilling, so really just grab your popcorn, sit back and enjoy the ride."}, {"score": "2/10", "review": "Attending the premiere of Kong many of one's anticipated problems and prejudices come true. I will keep this short because it is not meant as a polemic against anything, but rather a warning bell against the cliché-ridden den that is Hollywood, soon to be Chollywood.Did you watch X-Men: Days Of Future Past? How about Independence Day Resurgence (which they did not want to call Resurrection because there were so many of those!)?The well-known Hollywood problem of greed and avarice reappears when they have, absolutely cliché-ridden have, to insert a token Chinese character... not because he or she is integral or needed, but because they want to sell the film to China and show it in China. Plain and simple. Said actors should be ashamed of themselves as being there for no good story, acting or plot reason and Hollywood should be ashamed of itself. But then again, they have never atoned for their sin of 'product placement' why stop now?Did you think the last King Kong was too stylish? Then brace for Kong! Forced plot meandering, token Chinese chick prancing there for no good reason while doing exactly nothing other than sell to China (like Chinese audiences are so desperate and needy) and to satisfy new Chinese owners and investors, etc. Again Skull Island is not Crouching Tiger or Hero that tells a story with Oriental characters (and I love those), but it is a forced injection of token East Asian as Legendary Pictures promises to do going forward in every Batman movie now that Chinese conglomerate has purchased that studio. So, what do we get a useless Chinese woman not knowing why she is there in yet another sequel/remake/reboot/whatever/who cares anymore? Which takes me to another problem. Hollywood, get an original idea once.in.a.while. What another reboot? Yes, Jurassic park made tons of dough so the fault is ours. But, what is the price of loss of dignity? Look at JJ Abrams. No credibility, no future. He made a ton of money with his unadulterated accountant-driven so-called Star Wars, but he is now washed up and over exposed as a no-talent. The same is happening with these Chinese investors taking over films and force feeding audiences something that is obviously, er, force fed. As for this film, well it is a stylized Kong battling not against humans at first, but against local predators. And there is a token Chinese who is a female scientist. Whoopedeeda! Can you say Rebooted Star Wars syndrome? One last thing, there is a Vietnam connection and so the marketing collateral oh so cleverly hints at Apocalypse Now.Price of admission? Free at local premiere Value of story? None Predictor of the future? Sadly, high. Hollywood has a rope and it will hang itself with it."}, {"score": "7/10", "review": "The legendary King Kong returns in an all new adventure that gives the classic tale a much needed update and new setting. Unlike Perter Jackson's retelling of the original Black and White film, \"Kong: Skull Island\" eschews the old for the new and in doing so breathes a much needed new life and vitality into the franchise.The film is set in 1973 when William Randa (John Goodman), informs the government that they have detected a previously unknown island and need to investigate it before the Soviets learn of it and beat them to whatever the island my hold.William recruits a team which includes a former British officer named James Conrad (Tom Hiddleston), and Photographer Mason Weaver (Brie Larson), to assist his team lead by Houston Brooks (Corey Hawkins), in mapping the island.William also asks for a military escort and the government enlists Lt. Colonel Preston Packard (Samuel L. Jackson), and his team to accompany the mission. Packard is trying to find his place in the world as he and his helicopter combat team are dealing with the recent end of the Vietnam War. His men are looking forward to going home and resuming their lives, but a dour Packard jumps at the chance for another mission over the uncertainty of the future.Upon arriving on the mysterious island and starting their survey mission by using seismic charges, the team attract the attention of Kong who is not at all pleased with the intrusion on his island. Kong makes short work of the copters and the team finds themselves scattered about the dangerous island. They soon learn that Kong is not the only danger on the island and must find a way to rejoin each other and make it to their extraction point alive.Naturally some of the characters have a hidden agenda and there are dangerous and action around every corner. Further complicating matters is the appearance of Marlow (John C. Reilly), a downed WWII pilot who has been stranded on the island for 23 years and warns of dangers far greater than Kong that are ahead of the team.The film combines a solid cast with state of the art special effects to take a new twist on the standard adventure fare. While many parts of the film remain silly Popcorn entertainment, the quality of the assembled cast allows the film to move beyond being just an assembly of potential victims for a menagerie of CGI creatures to dispatch. While the story is more in lines with the linear and thin plots of adventure films of old, the sum of the parts does add up to an enjoyable film experience for those who like the giant creature films. You will want to make sure to stay after the credits as there is a very good scene that shows a setup for a future film that had those in attendance at our press screening cheering.The film may be a bit intense for younger viewers but if you are looking for a touch of nostalgia and action, you may find the film just what you need.3.5 stars out of 5."}, {"score": "3/10", "review": "If you want a bang-slam action movie, there are lots of them. If you want this one, be prepared to suspend a LOT of belief in the power of modern ordinance. Believe me, Ol' Kong wouldn't survive the first encounter with any relative use of modern weaponry. But don't let that stop you. Or maybe you should, and ask Hollywood for more new, original characters, protagonists and, well, realism at least on some level. Bulletproof apes aren't at that level."}, {"score": "9/10", "review": "Finally! A worthy reboot (remake) of the very famous monster! I was very very entertained with this movie. It was full of surprising scenes and many crazy fight scenes between Kong and the soldiers, plus Kong and other monsters. The special effects of this movie were absolutely wonderful. Kong was created using motion capture techniques and the rest of the monsters were very lifelike (and scary). The sound effects were very good. There were so many moments where we would be surprised by the sudden movement (with those shocking sounds) during the movie. What I loved about the movie was also the essence of King Kong story line like in previous movies were also captured, such as Kong's fight with major monsters, the intention of people to conquer him and even his fascination to the female character. And the time of the story which was in the 1970s also added a nice oldies feel to the movie. My wife also highlighted that she felt the movie was having a real 1970s sense which I think was due to the good make up (1970s hair style, suits) and equipments like the old choppers or Walkie Talkie you would usually see in movies with Vietnam wars.Another thing that I loved about this movie was that the introductions of the characters did not take too long and it was moving in quite fast pace to the main story in the island. The film was almost perfect in providing nonstop entertainment and my wife and I also really enjoyed the full movie. At the top I have mentioned that the movie is a worthy reboot since I believe this movie excel in comparison to the 2005 version. Despite that movie's quite loyal to the earlier 1930s and 1970s versions, I felt that the 2005 movie was not giving the wow factor and scary feeling of what King Kong was supposed to make to audience. Anyway, in conclusion to this movie, I definitely say it is one of the coolest action monster movie. There was not a lot of drama in it, just pure adrenaline pumping action film. The movie also had some brief funny moments and touching moment before the end. Oh before I forgot, this movie has got a post credit scene. So better watch out for it coz the scene would provide you some very interesting insight and exciting future films. So for those of you who had not seen the movie yet, please make sure you watch it as I am sure you would be very entertained with this film. Those who prefer to watch drama or romance or Oscar winning movie, then I would recommend to see it without over thinking and just enjoy the movie.For my complete review: Pls see michaelnontonmulu.blogspot.co.id"}, {"score": "7/10", "review": "Kong: Skull Island is a monster film starring Tom Hiddleston, Samuel L. Jackson, John Goodman, John C. Reilly, and Brie Larson. Packed with all the giant monster movie clichés and fun action scenes one would hope to see, it serves as a sufficient reboot of the King Kong franchise.In 1973, a group of explorers led by a band of soldiers journey to a mysterious uncharted island in the Pacific Ocean. Upon arrival, the group realise the island is swarming with giant monstrous animals and insect-like creatures who have called this place their home for millions of years. After becoming separated amidst the chaos, the groups eventually meet with the local natives who worship a skyscraper-sized ape named Kong who protects them from the giant monsters. While the film doesn't offer much in terms of actual plot, the action and fight scenes more than make up for it. The special effects were great and the CGI for Kong and the other giant monsters were all very convincing. The characters were all essentially stock action roles but thanks to the believable performances from the lead actors, they're still fun to watch. I also enjoyed the fact that Kong has more screen time and a greater relevance on the film's story, unlike with how Godzilla was barely in the 2014 film. I look forward to seeing these two monsters duke it out in a future film.I rate it 7/10"}, {"score": "10/10", "review": "Kong: Skull Island is an action pack filmed, the cinematography is awesome! It is la combination of Zack Snyder's cinematography in a colored view and Guy Ritchie's PoV.Don't believe on other reviews giving a low score,they just hate Warner brothers because WB own DC and people always bash DC anyways this movie is perfect! Better than Doctor Strange and Avengers, hell better than Avengers Infinity War."}, {"score": "4/10", "review": "If you want a popcorn flick, then yeah, this is alright. Have fun. I wanted a King Kong movie however and this is where it failed. The King Kong films are what make up a big part of my childhood. I watched the hell out of them and loved them - being the 1933, 1976 and 2005 versions. When I heard they were making this, I asked \"why so soon?\" and \"what will they ruin?\".Firstly, here's how I see the other major Kong films. I love the original, it's one of my favorite films. I have a soft spot for the '76 one even though it wasn't as good and I love Peter Jackson's '05 version, which was almost as good as the original and also one of my favorite films. Each film served a masterclass in the visual effects for its time period, being (in order), stop motion, animatronics and CGI.Now we get to Kong: Skull Island, a movie that really doesn't offer anything new or anything great. It kinda happens and then has a fart of an ending.Acting - Everyone was good in their roles. Nobody stood out. John C. Reilly was good. S.L.Jackson was good. Tom Hiddleston was good. Brie Larson was good. John Goodman showed up. Nothing fantastic or deserving of applause. They were just people on a screen.Story - It's a reboot of the franchise, set in the 70s. It's still pretty much the same story of survival and stuff, but nothing to do with romance or capturing Kong. It was bland and is really just there so the popcorn action can happen.Writing - Nothing special. There were some good lines for S.L.Jackson and John C. Reilly. Everybody else had maybe one okay line but the rest was exposition or nothing interesting. The pace felt off. There were slow moments where nothing was happening (including a lot of missed opportunities to develop some of the other characters) and then it kicked straight into action and then action again and then slow and then 5 seconds of action and then slow. It wasn't a quick 2 hour film. It just felt like it's exact 2 hour run-time. And the ending just happened. I was honestly shocked at how quickly they ended the movie. It was garbage because they couldn't end it well like the other Kong films because they have to leave it open for what will be the abominations known as the Kong vs Godzilla film.Action/Effects - Yeah, it was pretty good, nothing we haven't seen before in the other recent garbage/average monster movies like Godzilla and Pacific Rim respectively. But just like the story, the action kinda just happens. Most of the characters are barely developed so there's really no tension when people are about to die, especially when you can pin-point who'll make it through to the final action sequences based on screen-time. There's some cool moments where Kong gets to be awesome and become a force of reckoning. The bad monsters are kinda lackluster though except for the final one that actually puts up a fight. There's no choppy editing (and there shouldn't be anyway if nearly everything is CGI) so everything is easy to watch and the action sequences don't get entirely frustrating to follow.Cinematography - There's a lot of cool shots that really show how massive and intimidating Kong is, especially when shown full size next to humans. There's some good shots utilizing silhouettes. Whenever you see the sun though, it's color and position is that of the sun setting but always seems to return to the middle of the day when it cuts back to the characters which I found distracting/weird.Music/Sound - It's the early 70's, so when they play songs from the 60's and 70's, it's awesome although they are often drowned out way too quickly to be appreciated. As for the original soundtrack, it's whatever. Barely noticeable. Doesn't even have to be there. Action sequences sound punchy however, which is good, and it all blends together to become this chaotic cacophony of violent sounds.Kong: Skull Island was disappointing for me as a massive King Kong fan. It's an average movie at best and not much better as just a blockbuster action film. Out of this and Godzilla (2014), I'd easily say this was better than that pile of turd because even though it's characters/story weren't great, they had a lot of scenes of Kong kicking ass and that was pretty cool. Jokes, like in a Marvel film, were plentiful, and just like in a Marvel film, some were a hit, most were a miss.Overall, if you're going to watch this film, might as well be on the big screen where it belongs. Otherwise, it'll be pretty crappy on a small screen. I won't be going to watch this again at the cinemas and I won't be going out to buy the DVD to add it to my other Kong films. The movie is okay. It could have been better. But as for now 6/10. Go watch the other 3, infinitely better versions. Peter Jackson had respect for the original when he made his 2005 version. This was just a cash grab. If they were trying to be respectful of the property in this movie, I didn't see it.Next stop, putting Kong into a film with a boring Godzilla. Man, I'm sure that's gonna be a blast and totally not bastardize the King Kong name. I couldn't care less about Godzilla, but I really hate that they're dragging Kong into this poop storm again."}, {"score": "8/10", "review": "Movie: Kong: Skull Island the fourth remake of the magnificent story about a couple of geologists and a military group go off to discover an unknown island in the South Pacific, not knowing what they were in for, as they are entering the land of King Kong. Now this movie is titled after King Kong, but its not just the king himself, in the 2005 version the king destroys dinosaurs and other creatures while Kong: skull island has a whole range of creatures, call it Kong and friends: skull island. In the 2005 version of King Kong which went for 3 hours and 10 minutes it took half the movie to reveal King Kong, in this one you see an early view of Kong straight away. Kong: skull island goes for 2 hours, which I thought was good because it didn't drag the movie on for to long, it went straight the point. The movies cast was spectacular. J.K. Simmons and Michael Keaton were originally supposed to be cast ed in this film but both had to drop out due to scheduling conflicts, which I thought worked out well because the bad ass Samuel L. Jackson took Simmons place and John C. Reilly took over Keaton's role.Actors: as I said, I loved the cast for this movie, Tom Hiddleston as James Conrad, a hired soldier for the team, Samuel L. Jackson as Preston Packard was the chief, John Goodman as Bill Randa who was one of the geologists, and more. Jason Mitchell and Corey Hawkins both played in Straight Outta Compton with Corey Hawkins as Dr. Dre and Jason Mitchell as Eazy E and returned again to play in Kong: skull island which was great. You can also tell John Goodman has aged in This movie. Director: Jordan Vogt-Roberts created the look of the new King Kong to look similar to the first King Kong in 1933. Editing: the editing in the movie was great, there was great shots and clips of the movie that blow you away. Kong himself looked good and horrific and so did all the other creatures. Feedback: Now, no matter who you are, go see this movie. In my opinion everyone would love this movie. The whole movie is so entertaining, there's not much scenes which bore you with scientific information in this movie, it is action packed, like a huge gorilla the size of a building destroying and killing everything in its path, its just spectacular. To me there was no faults in this movie except for a off leading ending that wasn't fully satisfying. There is a after credits scene with Godzilla, which I missed and found out later. I was also surprised to find out that a majority of the film was filmed in Gold Coast, Australia. If your want to see a movie with friends or just want to Catch a flick, go see Kong: skull Island in theaters Now! I rate Kong: Skull Island a 8.2/10Check out my YouTube channel, to find more reviews including this one at : Real Kritics"}, {"score": "7/10", "review": "Following the route of the 2014 reboot of Godzilla, Warner Bros and Legendary Pictures re-team to continue to expand the 'MonsterVerse' with a retelling of the iconic classic King Kong. Packed with epic action, monsters and adventure, this movie doesn't fail for the fans for Kong and Godzilla.The plot is basically straight forward and requires no brains for thinking and realism to be taken seriously; a group of Vietnam soldiers and explorers head out to the South Pacific to explore an island that may have signs of life and discovery. They find more than what they have been told with a massive and destructive gorilla that is hailed as a king, due to his presence in protecting the natives from the creatures that hunt and feed on the humans. The battle of man vs nature commences but it's not long till they discover that maybe the king is the one in need of protection.With an awesome eye on action, monsters and scale, first time director Jordan Vogt-Roberts delivers a fun ride. First fault though was the plot, there's not much originality on screen but it does carry the tones to Godzilla. Writers Dan Gilroy and Max Borenstein make the best attempt to make the story work, based on the story by John Gatins and Dan Gilroy who based it on the original film's writers from 1933.The acting from the cast, raging from Tom Hiddleston, Brie Larson, Samuel L Jackson, John Goodman and such is all great for this type of film. The humorous moments are from John C Reily, who gives a fun role in the adventure. Another problem though was the lack of character development, they don't seem to expand themselves fully but then again it's primary focus is on the monsters and the mythology they come from.The soundtrack, both the music score by the great Henry Jackman and the 70's themed songs from the era are all amazing. Unlike Suicide Squad, the music is used when it's needed and its not heavily frequent.Kong: Skull Island has all the right tones to make it fun, action packed and feel like a summer blockbuster type (much like Pacific Rim). Despite the lack of character development and a plot that isn't original, it makes up for it greatly with the amount of monster action and scale of the adventure on offer. Hail, King Kong! 4/5 - Nick A team of explorers and soldiers travel to an uncharted island in the Pacific, unaware that they are crossing into the domain of monsters, including the mythic Kong.\" The movie starts off rather quickly and you really do believe you are in the 70's. The movie captures the whole \"good old days\" feel. It never takes too long for each scene to get to the point.Within the first 20 mins you see Kong. So the good news is that this isn't another Godzilla remake where you see Godzilla for the finale 15 mins. This is Kong's Movie and you see him in action plenty throughout. Smashing helicopters, fighting with the creatures of the island etc, he's totally badass. The CGI of Kong and the creatures are quite good as well. There were times where you knew the actors were in front of a green screen, and it's so obvious in parts.The biggest problem with this film is that there is absolutely no character development or explanation what so ever. The acting was actually the weakest part of the whole film. The only 2 good actors were Samuel L. Jackson and John C. Reilly. Reilly probably had more character development than anyone else in the entire film, and Reilly really plays his part so well. He made a stupid character so memorable and great. Jackson did well with his part as well, playing the badass soldier and stops at nothing until the job is done.All in all it's a 50/50 type film. It has good elements and bad elements. If it weren't for Kong himself the film would have flopped big time. P.S. Watch until after the credits. You'll see! 3/5 - JayCheck out Jay and Nick (The Autistic Reviewers) on facebook!"}, {"score": "7/10", "review": "The construction of cinematic universes seems to be the new fad of commercial Hollywood, ever since the Marvel train came along with the original Iron Man and proceeded to churn out hit after universe-expanding hit. Now, we have a \"Monsters\" universe, with Kong back just a decade after Peter Jacksons (superior) rendition of the character to tie into the universe of the lacklustre Godzilla film of 2014. Fortunately Kong: Skull Island manages to feel like its own movie. What separates this new addition to the Kong mythos from all other films of its ilk is its distinctive visual aesthetic, an aesthetic I can only assume is a gargantuan love letter to Apocalypse Now. Vittorio Storaro's iconic cinematography from Coppola's classic has been reinvented in spades with state of the art CGI effects. Every two minutes or so we are treated to a breathtaking shot - mist and fog are thrillingly utilised, as well as a night scene eerily similar to the Do Long Bridge sequence of Apocalypse Now. While this is perhaps relying too much on a far, FAR, better film, it was refreshing to know that at least from a visual standpoint there were genuine artistic influences that could be discerned, the sense that the filmmaker wanted to put a new spin on the monster formula. The important thing to note is Kong and his wide array of monster peers deliver the goods. All of the action sequences are fluidly filmed, thrillingly executed, with breathtaking CGI and the help of such atmospheric cinematography as I detailed above. The monsters have real menace and bite, and they're imposing in all the right ways. Through what seems to be on location shooting, you also get a nice sense of Skull Island as a landscape, its harsh and alien nature. When the monsters attack it's always a blast. Unfortunately when they don't attack, we have to rely on the characters, and there isn't much to rely on. Lazy characterisation and archetypal \"there purely to be killed\" characters are abound, and several great actors - Tom Hiddleston, Brie Larson, Shea Whigham, John Goodman, Jason Mitchell, Toby Kebbell - are really shortchanged for genuine arcs and motivations. Luckily the sheer talent and likability of these actors makes up for a great deal, and when copious eye candy and monster throwdowns occur, it didn't bother me too much. Only John C Reilly and Samuel L Jackson truly stand out, and it's because their characters have genuine development and intrigue. The soundtrack felt a tad on the nose, with popular 70s tunes, including CCR and Bowie, popping in and out for little reason other than to hamfistedly evoke an era in the broadest possible way. What cannot be faulted however is the film's pacing - there is never a dull moment, with the action and tension kept admirably flowing for a tight sub 2 hour run time ( a far cry from Peter Jackson's 3 hour epic ) In all I had a fun time with Kong. It's likely to leave my memory pretty soon, but that being said it delivers in spades on what anyone would savour in a crazy big budget monster movie spectacle as this, and even with poor characterisation, its visual appeal and effects make it worthy of recommendation."}, {"score": "8/10", "review": "First off, I'm a total Kong fanatic, have been ever since I can remember, so needless to say, I was beyond excited when it was announced they were bringing the big guy back for a new generation! But as time passed, and with each new trailer they rolled out, I became more and more apprehensive. I was worried they were going to butcher the mythos into some third-rate Marvel wannabe or something. Thankfully, I was wrong; Kong: Skull Island is a great time at the movies!It's kind of what I remember blockbusters were, when I was a kid. Adventure, fantasy, monsters, without trying to be overly pretentious... and lots and lots of popcorn- munching action. Man, this movie has a lot of it, so buckle up! If you were disappointed with the lack of monster-stomping madness in 2014's Godzilla, Kong: Skull Island has you covered.The characters, the dialogue, etc. it's all (mostly) good, and the movie didn't let me down on that front, as I'd feared. But let's not kid ourselves, this is a monster movie, and that means it really all hinges on one thing...I'm pleased to say that this is probably my favourite iteration of Kong since the 1933 original. As you probably know, he's an absolute behemoth. Way bigger than we've known him in the past. But, thankfully, Kong is far and away the most well developed character. He's a protector, a peaceseeker, and the keeper of balance in Skull Island's chaotic ecosystem. But when forced to protect his island, he's absolutely brutal. He's a total barroom brawler. We've never seen a Kong like this before, and I loved every second of it! I'll tell you, Godzilla definitely has his work cut out for him in 2020!So, go see Kong: Skull Island, order a jumbo popcorn, don't overthink it, just get lost in the world and you'll have a hell of a time!"}, {"score": "8/10", "review": "A very entertaining modern adventure flick with great references to Vietnam war dramas like \"Apocalypse Now\". The effects were great, nothing too new but effective and convincing. The only problem I had with the film were the rather flat characters. The screenplay itself was good enough for a monster flick like this but the character really needed some work. The only character that was fleshed out was the one by John C. Reilly and he also gave the finest performance in the film. Tom Hiddelstone was rather underused and a bit pale. I really looked forward because I thought he fit great into that adventurous environment. Samuel L. Jackson was in typical Samuel L Jackson mode. Brie Larson was sexy but didn't provide much to her character either. Even John Goodman was almost invisible. The direction was original, tho I could have done without the slow motion bits. The score was effective. The entertainment value very high and thus the film mostly succeeded in its task. I also loved the imaginary mostly due to the cinematography. Definitely way better than \"Godzilla\" and in the end a very good old fashioned monster adventure flick."}, {"score": "7/10", "review": "Watching the new version of Kong yesterday felt like riding a crazy over-the-top roller coaster without fastening seat belts, and it took me some time to recover from the dizziness.The movie is soaked in style, and it's humongously entertaining, It's not what you're expecting from a prototypical blockbuster creature feature, but instead, it's a mishmash of extravagant themes, flashy tone, and some top notch set pieces.What cheered me the most was how they handled the coloration and cinematography. All those irrational close-ups of Richard Nixon's crazily-moving head doll, the reflection of some massive explosion on a pair of shiny sunglasses resting on a soldier's smiling face, the brief shot of the clapping monkey, the rough cuts, the surprises, and the overall surreal tone. Some may see this as an absurdity, but not me. Tastes vary.This movie intended to be a pure action spectacle, take it for what it is."}, {"score": "8/10", "review": "After the crushing disappointment that was Godzilla, I have to say that Kong: Skull Island is a tremendous surprise. Not only a hugely entertaining monster movie, but a well-directed, well-written and well-acted film full of ideas from start to finish. Its action set- pieces are utterly spectacular, the CGI is fantastic, and there's even a story that's genuinely interesting throughout, something that I definitely didn't expect going in.But by far the greatest achievement of this film is the presence of Kong himself. As plain as most of the film was, the biggest issue with Godzilla was that there just wasn't enough Godzilla. Fortunately, Skull Island rectifies that exact problem, and makes Kong as big a character in the film as any of the humans, appearing on screen at regular intervals, and actually playing a genuine role in the story.And that story is probably the thing that surprised me most of all. Again, Godzilla was a slow, empty and formulaic monster movie that really bored me. Kong: Skull Island, on the other hand, is a fast- paced and absolutely jam-packed action movie that actually gets better and better as it moves along.Of course, there's a part of me that's a little sad that we're not getting the classic story of King Kong that made both the 1933 and 2005 films so beautiful. However, Skull Island does do a fantastic job at bringing the character to a different time period and making a new, riveting story.Above all, the film's ingenious parallels with the Vietnam War make for fascinating viewing. Bringing a different dynamic to the relationship between the humans and Kong, the way that Skull Island looks at the story through the lens of the anti-Vietnam War sentiment of the 1970s adds an impressive layer of depth to the story, keeping Kong an interesting and emotionally resonant character despite removing his love with Ann Darrow.What's more is that some of the film's characters have some very layered and interesting backstories. In particular, Samuel L. Jackson's character, a stubborn, war-mongering colonel taken from the Vietnam War he loved fighting in, is hugely interesting to watch. At times mimicking the role of film director Carl Denham from the original, at others adding a far darker and more serious edge to the story of the invasion of Skull Island, he's absolutely fascinating to follow from start to finish.There are a whole host of other characters that bring some impressive depth to the story, depth that I certainly didn't expect after the two-dimensional heroes of Godzilla, and make the film's large ensemble cast work amazingly well.One more positive from the film is undoubtedly the action. As I said, this is a very exciting monster movie that's full of action throughout. Above all, the opening and closing action sequences really stand out. Both because of the amazing visual parallels drawn with Vietnam War films like Apocalypse Now, Platoon and Full Metal Jacket, but also thanks to the stunning CGI that allows Kong to tower over the screen in comparison to the humans, but also puts a formidable and genuinely terrifying enemy on a very level playing field.As far as blockbusters go, Skull Island is top-quality, but it still isn't entirely perfect. For one, whilst it's brimmed with ideas and interesting characters throughout, that does lead the film to becoming a little crowded at times. The lack of a main character amidst the huge ensemble cast means it's definitely not as streamlined as I would have liked.Also, the parallels with Vietnam, whilst unique and great to see in a movie like this, are a little overbearing at times. Particularly in the first act, there comes a point where the film really hits you over the head with how similar it is to Apocalypse Now, and although that does die down to a better level later on, it's a little frustrating at times.Simply put, Skull Island is an impressively brainy and innovative blockbuster, but it goes a little too far with everything it does. That's far better than a completely empty film like Godzilla, but with an enormous main cast and a story that's so jam-packed, I felt like things could have been carried out a little smoother than the finished product.Still, I had a really good time with Kong: Skull Island. It's a massively entertaining monster movie that places its title character right in the thick of the action, surrounded by more interesting human characters, excellent visuals, stunning action sequences, and a genuinely engrossing and intelligent original story."}, {"score": "7/10", "review": "Just to say, Godzilla (2014) is my favorite film in the world to be honest, I loved the characterization and the build up to one of the most epic third acts in movie history, people may say it had little Godzilla and too much character. So the creators of Kong: Skull Island listened.Kong Skull Island is pack with great sequences... when Kong is in the picture, its so much fun seeing him kick more monster butt on the big screen again, and the characters John C Reilly and Samuel Jackson are both great and shine in this film, and personally I thought Tom Hiddleston was a cool bad-ass who had little characterization, but lived up with his tricks.The problems are, them three I mentioned were the only ones with characterization, maybe Toby Kebball but I didn't care. The Characters are lame and bore me, I just wanted Kong, I wanted to love these characters like in Godzilla, that's why it never bored me. Another problem is, as I loved how Godzilla (2014) teased you from the beginning of a big fight but never showed adding anticipation, which is why the final battle is so AMAZING, due to its build up, if we already earlier on saw Godzilla fight, we would think \"well... I've already seen this\" But in this it shows too much Kong kicking ass that it ruined the final battle, don't worry I loved the scenes, its just that I didn't recognize that near the end, that this was a final battle as it was just the same as the earlier scenes, so it didn't wow me.But that end credits scene.... IS WORTH SPENDING ALL YOUR MONEY TO SEE Overall, it was okay and fun at points, just with big mistakes I hope they learn from it, as they seemed to listen to the Godzilla feedback. I rate this a 7/10"}, {"score": "6/10", "review": "As far as big blockbusters go, Kong: Skull Island is not half bad. The first 30 minutes or so pass by and plays out in typical fashion, the soldier stereotype as seen in countless films meat headed with a gung ho mentality. Which in essence is a moral of the film \"don't go into someone's house and start dropping bombs unless you're picking a fight\". The first 30 mins despite the roaring action is pretty dull, the CG graphics are pretty spellbinding the detail on Kong specifically.Not until John c Reilly turns up was I fully invested and in all honesty he steals the show. He provides a couple of dazzling lines and weirdly enough injects some much needed heart into a so far emotionless ride.The music was good except it suffered from the \"suicide squad\" syndrome it was over used almost to breaking point. An excellent use of Jefferson airplanes white rabbit can always be forgiven though. Kong references a whole bunch of other films some obvious choices, others not so obvious. Ranging from music cues (the shining, fear and loathing in Las Vegas) then to some more on the nose Vietnam flicks ( apocalypse now, platoon, full metal jacket)Never tries to be smart and plays Upto the ridiculousness of the story to good effect. In all honesty I've never seen a Vietnam pastiche quite like it. For the most part it's extremely enjoyable and there is tons of fun to be had."}, {"score": "8/10", "review": "Giant monster movies are always toss up when it comes to quality. They either really impress us, or turn us into monsters as we tear the movie apart. Tonight, the \"King\" of monster returns to the silver screen, in what looks to be a high-definition adventure made for the theater technology. With an all-star cast including Tom Hiddleston, Samuel L. Jackson, Brie Larson, John C. Reilly, and John Goodman this could be the giant monster flick we have been hoping. Robbie K is back with another review, hoping to shed some light on Kong: Skull Island. LIKES: \u0095 Human perspective \u0095 Awesome Visuals \u0095 Awesome Soundtrack \u0095 Action \u0095 John C. ReillySUMMARY: Most monster movies are often focused on the monster (or man in a rubber costume) wreaking havoc on the environment, only occasionally panning on a human actor. This rendition of Kong shifted that balance back to the humans, putting the tale more from there trek across the killer island. Don't get heated though, because Skull Island has plenty of moments centered on the big ape and all his\u0085naked glory. Kong isn't the only visual the movie has to offer though, as the team is able to create the nightmare that is skull island in fantastic displays of CGI and real life setting. The environment has a culmination of setting that capture both the beauty and horror that an isolated, prehistoric ecosystem has to offer. The flora, and inanimate stone structures, aren't the only impressive visual though. Skull Island's fauna are also stunning to watch, imaginative creatures that fit well into habitats they call home. Both my friend and I agreed the team did an awesome job crafting monsters that dwell in your darkest dreams, giving them bark, bit, and in some cases slime to truly be deadly. Visuals aside, the soundtrack also has some diversity to it. Our humans theme song seems to be songs from the 70s that will have you classic rock groupies smiling with glee. While those who like powerful symphony work, will enjoy the edge the orchestra brings to the more exciting parts. Speaking of excitement, Kong: Skull Island brings the action to the full front. Unlike Godzilla (2014), Kong doesn't skimp on the monsters actually doing something other than walk around. Much of the movie involves the humans lighting the creatures up with their guns as they dodge lethal appendages. Yet Kong himself has his moments to shine, in heart pounding, special effects laden sequences that will have you screaming in delight. I myself was impressed with Kong's sweet wrestling moves, including the epic finishes our WWE guys only dream of copying. Sound like too much action? Not to worry, John C Reilly has got you covered with well- timed, well-delivered comedy to lighten the mood. DISLIKES: \u0095 Story is okay \u0095 Uneven characters \u0095 Rushed Scenes \u0095 Cheesy MomentsSUMMARY: The story of King Kong has been told in so many iterations, but most of these renditions give the beast a lot of character outside of wrestling champion. In this telling, the story takes a major dip in favor of the action. As laid out in the trailers, Skull Island's main premise is survival, with a majority of the plot focusing on our human casts journey to get off the land. Oh sure, they try to inject a few other morals into the mix (including vengeance and love) and they do try to give Kong some other qualities in an attempt to develop him. However, many of these extra points shallowly developed, lost to the special effects and battles waiting in the jungle. I missed the deeper nature to Kong's character, but I give props for venturing off the traditional path. In addition to the simplistic story, Kong's Skull Island also has some editing/developmental issues for me. First off, the uneven characters. Our band of humans is a little skewed, with some getting decent development to others being just another pretty face (that may or may not get devoured). It's the problem when hiring big casts, but this reviewer would have liked a little more backstory to add some emotional turmoil to the mix. The shallow character development paints predictable targets on most of their backs, leading to rushed moments where a character is abruptly, and in some cases pointlessly, eliminated. Sure, it keeps in theme with the island is always hungry, but Skull Island's team needed to go in a clean-up these hasty moments. Ironically, the one thing (outside of the action) they focused on was the anger/hate between Kong and Jackson. Yours truly found the intense stare off and peeing contest between the two to be a touch overdramatic and drawn out. Suspense building? Maybe. Ridiculous? You bet it is. The VERDICT:Both my friend and I agree that Skull Island is one of the better portrayals of the King of the Jungle. With impressive visuals, dangerous environment, and fantastic battles, this is the monster movie we have been waiting for. While there are some story elements that need tweaking and some balance restored, the film gives me faith for future giants vs. human films and the inevitable sequels to come. With all the special effects and action, yours truly recommends this one for the theater, and could see it having some extra oomph in 3-D. And despite what you may expect, one should stick around when the lights go down. You might just find yourself stoked for what is to come. My Scores: Action/Adventure/Fantasy: 8.0 Movie Overall: 7.0"}, {"score": "7/10", "review": "This will probably become my biggest guilty pleasure of 2017. Although I do believe Peter Jackson's King Kong is one of the few great remakes that have been made, a part of me always wished they would just skip the first hour on the boat and spend the rest of the movie exploring Kong's world called Skull Island. Rising director Jordan Vogt-Roberts definitely delivers on that. He presents an ecosystem of giant creatures that stands apart visually from other monster movies like Jurassic Park. And it shows Kong less as a misunderstood monster but more as protective figure in this new mythology.When the director described this new King Kong as a god he really wasn't under-selling it. Kong has never been more intimidated and powerful then ever. He is re-imagined to be more then just an animal and monster but as this powerful force of nature that is both ferocious and benevolent. He felt like a combination of the Marvel's Hulk and Planet of the Apes's Caesar. By removing the beauty and the beast story, Kong is explored more as a character with almost sentient qualities and we see what his existence is like on the island. His best moments range from him taking out helicopters with his fists during his big reveal to when he is just sitting around and killing time with stunning visual effects that rival what was done in the 2005 remake. And the island itself is presented as a character with always having unique ways to reveal the other creatures that hide within Kong's kingdom in suspenseful and surprising ways. The creatures are both beautiful and scary as they feel like they're one with the landscapes. I could watch a whole nature documentary on this fictional world. The most terrifying out of all of them are the Skullcrawlers. If Kong is a god then the Skullcrawlers are the island's demons. They felt like a combination of the creatures from Jurassic Park, Aliens and Bong Joon Ho's The Host. They really made up this great threat to both the humans and the island in new and surprising ways.Jordan Vogt-Roberts uses a fresh way to show the action and visuals in this big-budget movie. While Gareth Edwards's visual style in Godzilla felt similar to Steven Spielberg and Christopher Nolan, Vogt-Roberts is closer to that of Zack Snyder, Edgar Wright and Guillermo Del Torro. The action and editing is very energetic and quick with warm vibrant, colour tones. When he shoots action you feel like you are suddenly thrown into the middle of it with amazing slow-motion shots to help you process the destruction and detail you are seeing. This movie has some of the most gorgeous cinematography I have seen in a monster film thanks to DP Larry Fong. The beautiful and exotic real-like locations give Skull Island an extra sense of depth and believability. The Vietnam locations like a Ninh Binh and Hao Long Bay make me believe they could actually hide 100-foot creatures. The monster fights are very brutal and feel very much like a Ray Harryhausen movie where there are long shots that stay on the titanic creatures brawling with each other. The final battle is unique enough to stand apart from the dinosaur fight in 2005 as it shows Kong's intelligence being used in battle in order to challenge the Skullcrawler's agile and nimble movements. The end of that fight makes breaking a T.Rex's jaw look tame by comparison.What unfortunately holds this movie back from being great is the human narrative. I wouldn't say it's terrible but there is nothing special either. The list of big-name actors injects some personality into it but what you get with most of the characters is just what's on the surface and nothing more. Tom Hiddleston is similar to Aaron-Taylor Johnson in Godzilla where he was just there as a plot device to get from point A to B. Sam Jackson's military leader is uniquely written and has justifiable reasons for wanting to kill Kong but still feels like other roles he has played before. Corey Hawkins and Jing Tian only really exist to setup universe building. Out of all the human characters John C. Reily was the only one I was truly invested in and felt like he matched the movie's stylized surreal tone. Got a kooky Tom Hanks Cast Away vibe from him. His crazy personality and backstory is what kept me going through the scenes without any monsters. His scenes of exposition could have been handled poorly but work when he is delivering them with some well-time jokes. Brie Larson's role in this is not going to measure up to her Oscar-winning Room performance but at least she isn't portrayed as a useless damsel like in most monster movies. I did also enjoy the dynamic between Jason Mitchell and Shea Whigham surprisingly. In Godzilla, the movie felt subtle about giant monsters rising from the earth being served as a metaphor for our over-reliance on nuclear power and lack of control on nature. Skull Island's thematic messaging about military power invading native lands like Vietnam felt more forced and didn't leave as much of an impact on.Overall, I would say that Peter Jackson's remake has a stronger emotional story with more depth but Vogt-Roberts delivers a King Kong movie that is simple, and more unique. Similar to Pacific Rim, the humans serve more as a way for us to explore this world of giant monsters then be emotional centre piece. The movie knows when to inject fun, humour and energy when it needs to and doesn't become too reliant on these characters that can't carry the movie without having a giant monster on screen. I definitely look forward to seeing this new Kong take on Godzilla in 2019. Also I got child-like excitement when I saw the after-credits scene for Godzilla: King of the Monsters."}, {"score": "8/10", "review": "It's a different movie from the original; there is no romance with the blond girl (Brie Larson), everything happens in the island.The movie is in the 70s & every little detail is excellent (the music); the landscape is a homage to Apocalypse Now, some parts look like Predator or Alien.The characters aren't well developed since there are a lot of them; Kong (Twice as tall as the original) is the main protagonist & his fights with giant monsters/creatures.Samuel L. Jackson is a insane colonel who wants to hunt his Moby Dick (Kong) but James Conrad (Tom Hiddleston) has to track him.Warner Bros wants to build this new cinematic universal.There is a post-credits scene."}, {"score": "6/10", "review": "This review of Kong: Skull Island is spoiler free *** (3/5) LIKE HIS Japanese counterpart, King Kong has entered the world of cinema, left it and been resurrected an uncanny amount of times, however only a few of them explored the inner reaches of his uncharted home the mythical Skull Island. But it's been over a decade since he was last brought to life, and although 2005s King Kong did go to the island it didn't explore it the way we would have liked, it had the plot to find Kong and capture him to show him to the world and then he raided New York, you know it. In Kong: Skull Island we explore the inner reaches of the island, and are constantly threatened by the giant beast, for which Samuel L. Jackson's war-hammered soldier here asks \"How big is it? How fast is it? And what it do?\" Of course how big he is and how he is, is obvious to those who are familiar with the monster, his speeds vary through different films. Yet with the advantages of CGI only coming in before 2005s version he went as fast as the computer would take him, although in that version he was played by Andy Serkis in motion capture. Here he's only seen in CGI visuals roaring from sound effects, and looking more dazzlingly like an ape than ever. His facial features looking more real, and his height even more terrifying here he's about the size of other monsters beside him.This is the second film in Legendary Entertainment's MonsterVerse series; the first was 2014s Godzilla directed by Gareth Edwards, who thanks to his special effects team made the beast look more real than it ever did, but also gave him extra height, it's too hard to imagine how big they'll in their next fight. Although now Kong is noticeably smaller (at around 104 meters) but he's still growing as the film tells us but he can still pack one hell of a punch when he needs to. Were as Godzilla is full sized, he probably has the advantage over the giant ape but we won't know until the next film Godzilla: The King of Monsters comes out. But for now Kong: Skull Island makes its debut reigning supreme on his home turf, where it's dangerous by day but even more dangerous by night, as a lot of the island's inhabitants are there to kill its human invaders. Some more terrifying than others.Next to Kong, on the island there are some horrific looking beasts with nasty teeth, really quite dinosaur looking, some can fly, some have horns and giant some are creepy crawlers, as the humans soon find out. However they don't help Kong, he isn't the most dangerous, and he's the protector of the island's native human inhabitants. There is something trying to kill him, in addition there is emotional heft to this story, too when it explains that Kong is the last of his kind proving to Jackson's hardened soldier that animals, even giant ones have feelings too, and he has the feeling of anger when the unwanted guests try to destroy his home, there is a gorgeous shot of the primate's fist colliding with the helicopters that he's scared of. Of course he has to be scared of something.On land, the human invaders recover from the attack here Jackson angrier than ever, decides that Kong is the threat and wants to fight against him, but others try to get him change his mind about the war. The group of men and women include: Tom Huddleston's hardened tracker James Conrad, who hired by Bill Randa (Goodman) explores the island in search for evidence as to why evolution comes to an end, he lists the ways they are going to die on an uncharted island leaving one specific note (the giant monsters). Brie Larson's anti-war photographer Mason Weaver she takes an immediate liking to Kong and wonders why the other creatures want to kill him, and end the human territories on the island. Later, they meet with Hank Marlow (Reilly), a World War II soldier who's been stranded on the island since 1944 he steals the show from the rest of the players. Unfortunately he's the only one with character in the film, the rest of the characters are bland, even a talented actor like Hiddleston is wasted here. Sure he makes a decent impact with his bad-ass moments in a bar fight and sword swinging through dinosaur birds but it's not much.This is perhaps the main flaw of the film, granted it looks gorgeous but the characters are dreary with a non-characterizing screenplay, yes there are flaws but there goodness here, too, the action is stunning it's the monsters that have the bigger impact, or in Kong's case has the bigger punch. When goes to punch helicopter of the sky it looks gorgeous as he's surrounded by smoke and fire. In the third act the action hits its peak, when he has to fight a giant creature that matches him to save the humans. Despite the horrendous flaws, like the bland screenplay Kong: Skull Island is a jaunty film with goodness and although it's not the best monster film it's still enjoyable, let's see how far he'll go in the future.VERDICT: King Kong is alive again! Only just, in this derivative, dumb but consistently fun latest addition to the MonsterVerse series. It's just about over the line of Godzilla's strength, but not by much."}, {"score": "8/10", "review": "I came to watch another movie and ended up in the Kong theater. The previews I had seen before looked promising; however, I have never liked Kong movies before. This one was very different. I liked the changes and all the surprises in this version, taking place in 1973 after the Vietnam War. Some parts of the film were very intense and violent and parts were sprinkled with welcome humor, mostly because of the character of Hank Marlow, played by John C Reilly. I recommend this movie for adult viewing. The acting, writing, directing, filming, sets and cgi/special effects were all top notch. If you haven't seen the movie yet I have 2 recommendations for you. Watch all the way past the credits for the surprise ending AND keep your eye on the actor Toby Kebbell, who until now I thought just played the part of the soldier, Jack Chapman. I can't say any more without ruining this review with spoilers. Go see the movie."}, {"score": "7/10", "review": "Man, the tone in this film is all over the place\u0085 and I mean that in the best way possible. It never stops feeling strange, but it also never feels wrong, either. We'll be enjoying a light-hearted scene set to the tune of a '70s rock song. Suddenly, gruesomely, fatally, we have a terrifying encounter with an enormous monster. Then we're back with another '70s hit over a montage as our protagonists journey to their next obstacle. It's bizarre, and it works.If you're expecting to see that same Kong story with which you are familiar, alter those expectations radically. Kong never leaves Skull Island, never kidnaps a blonde, and is around five times larger than you've ever seen him before (unless you saw Japan's 1962 film King Kong vs. Godzilla). Unlike the original film, Skull Island is set in 1973, immediately after Nixon pulls out of Vietnam, and, oh, boy, do the filmmakers have fun with this. As well as the aforementioned soundtrack, the score, cinematography, even the film's posters all channel the era, with nods to Apocalypse Now sometimes taking up entire scenes.This isn't to take away too much from the creativity of the film. The excellent cinematography is the work of Larry Fong, who's done a bunch of Zack Snyder films, and the CGI is phenomenal, with a couple of very small exceptions with regard to the small(er) animals that drifted just a little too far into the uncanny.Our characters (a helicopter squadron and a group of scientists, neatly separated by colour, as well as a tracker, a photographer, and three members of the mysterious organisation \"Monarch\", which you may remember from 2014's Godzilla\u0085) head to the strange island after picking it up for the first time via satellite (what if something good's there and the Russians get it!?). After Kong, they also meet the other denizens of the island – enormous buffaloes and spiders, new, fictional monstrosities, and good old human natives. At this point the objectives of the characters divide; some want to flee the island, some want to hide and wait for rescue, others still enter Ahab territory and are resolved to take down the big gorilla himself.The screenplay has obviously gone over a couple of drastic revisions. Characters say things like \"this happened in '72\", which is a little weird, because the film is set in '73. Why not just say \"last year\"? I can only guess that the year in which the film is set changed during pre/production.Tom Hiddleston and John Goodman are solid. Brie Larson and Samuel L. Jackson somehow manage to deliver excellent performances in a very silly (but fun!) movie. John C. Reilly is great, blending that great sense of humour and timing with just the right dosage of sobering heartbreak that comes with being stranded on an island for thirty years; he crashed during World War II.Many cute references are sprinkled throughout the film, and done so in a charmingly subtle way; \"Hold onto your butts\" says Jackson's character. I breathed a sigh of relief when they elected not to actually play Ride of the Valkyries during an already extremely Apocalypse-Nowy sequence. It's actually a pretty clever movie, and I was very pleasantly surprised."}, {"score": "8/10", "review": "I went to watch the movie with average expectations and I found out that most of them were fulfilled. I would agree with most of the fellow reviewers that movie is purely colored action entertainment and expecting else might be not cool.I watched the Hindi dubbed version and found the following things. I liked Tom hiddleston in positive role. Brie Larson was definitely not a good pick (beauty) for our beast if that was our case. I most liked John C. Reilly with his broken language.There is some part of movie still coming out, after the end credits and in my opinion that should have been included before end credits. That ending however raises only below average expectations for the sequels.Direction, Screenplay, Cinematography: The storm, flora and fauna, the green atmosphere, the petroleum absorbed surfaces, aurora borealis, the native people and their appearance, all were fantastic. The negative entities were all carved in ugly appearance, giving one the horror feel required.Tone: Tone was the action between the positives and the negatives and it was carved well. A spoiler - Kong was on human side.Music: Music was below average.Acting: Other actors acted as average."}, {"score": "7/10", "review": "Over the years there had been many attempts to bring the story of King Kong to the theaters and each time had been an epic failure, so after the trailers of Kong: Skull Island (2017); we had to go see it. The trailer for Kong had already shown a huge progress between this movie and every other King Kong related film and the cast for Kong: Skull Island (2017) was certainly an eye catcher.Last night on the first viewing we were in our seats ready to enjoy the movie, it wasn't a big crowd. In reality probably 20 people in the theater. The lights went out and the film began and right off the start we were saying \"this looks to be really good\". The graphics, for the most part, are extremely good, there were only two or three spots that you could really see the film set and green screen hiccups. The script was well put together for the most part until about ⅔ of the way through as the film starts to lose steam. By mid-way through it many items were starting to stand out for example: If someone had just come out of the water completely soaked and two seconds later in the film, their hair and makeup had been redone and they're dry. Items like that sort of started to show themselves more and more towards the ending as if the film was completely rushed to finish up.Now, in short, this film is very entertaining and it is marketed towards the right audience and age group, I'm certain that area will miss a lot of the items I pointed out. We did have a wonderful time watching the film, and it is the best King Kong made film to date. The graphics are as good, if not better than Michaels Bay's \"Ninja Turtles\". Would we see it again? Yes."}, {"score": "8/10", "review": "**Do not leave until all credits roll....there is more footage after the credits!**I have to say, I was mostly pleased with this movie. Soundtrack was spot on for the era.....the soldiers seemed authentic.....and Kong was awesome.One minor complaint.....there was not enough time to build the character connection of Kong to the audience or the cast. felt But....the special effects were awesome, this could be my favorite Kong to date. It still felt short however. I hope there will be a longer version available on Bluray in the future.I like how this movie took place in the past, basically setting this up for modern day installments, and collaborations.The acting was great. Funny moments were funny. Touching moments were touching.The film delivered.I am going to keep this short and sweet, and let all the pros write you a book.Go see this film if you either like King Kong, or Kaiju movie in general.Hard core fan will be catching all kind of easter eggs and references.....all the way until the end credit scene plays."}]