[{"score": "8/10", "review": "Spider-Man Home Coming Fresh from the advanced screening of Spider- Man Home coming, and I am still pretty hyped over how awesome this movie was. Let's just say Disney has done some justice to this character. Even though I have enjoyed all the other Spider-Man films (Including Spider-man 3 and Ultimate Spider-Man 2). The tone of the MCU is a perfect match for our young web swinger. If I were to compare this movie with any other Spider-Man film, I would say it's up there with Spider-Man 2 for sure. Tom Holland is a great fit and every character had a shining moment or two in the film. Michael Keaton, Michael Keaton, Michael Keaton! This man has single handedly saved the MCU from the dreaded villain curse. You want to talk about character development. Wow he gave a strong and intimidating performance as The Vulture. Peters best friend Ned, Aunt May, Tony Stark and even Happy the Butler all kept me glued to the Screen throughout the film. Now let's talk about the action. Very well paced action and pretty intense scenes, I mean you can tell that Peter was out of his league. Even the Shocker was pretty damn powerful and gave Spider- Man a run for his money. With MCU and the signature comedy lines it was well placed to make a pretty great summer blockbuster. The MCU does a great job with taking a genre and adding super heroes to it. For example Cap 2 was a espionage film and Ant Man was a heist film. Spider-Man Home coming is definitely a high school teen movie with a super hero twist. I give this movie 4/5 Mr. Wayne stamps for sure and highly encourage everyone to check it on the big screen. Spider-Man Home Coming out on July 7th."}, {"score": "10/10", "review": "Wow this movie lives up to the hype, it is easily the best Spider-Man movie to date and maybe the best marvel movie. This movie gives you a fresh take on Spider-Man it does not even feel like a reboot. Tom Holland is the man he is the best Spider-Man by far, Tom Holland always brings a exciting fresh energetic take every time he plays this role, he gives you the best portrayal of the character that we all know and love. Michael Keaton who played the vulture, amazing very scary and intense he's the best marvel villain since Loki. Thank you marvel for such a great fun Spider-Man movie, you do not want to miss this one it's great."}, {"score": "8/10", "review": "So here's my review of Iron Spider Homecoming.. ehm.. I meant to say #SpiderManHomecoming. It's an incredibly fun teen movie but it's not perfect. I think Tom Holland is a great Peter Parker, he's got the character down spot on. No offense to Tobey Maguire and Andrew Garfield but Tom Holland's version is like straight out of the pages. But with this reboot, they basically plaster Iron Man's previous drama on to Spider-Man in addition to the new tech-based suit, so I'm not sure if that's going to sit well with all the fans.The events take place right after the colossal airport fight in \"Captain America: Civil War,\" young Peter Parker/Spider-Man (Tom Holland) is stoked about helping Iron Man and looking forward to the next mission. But he seems to have been sidelined by his new mentor, Tony Stark (Robert Downey Jr.) Peter goes about his high school life with his best friend and decathlon classmates, when Vulture (Michael Keaton) emerges as the new villain.There's a bit of John Hughes influence in \"Spider-Man: Homecoming\" and that's a good thing considering Hughes was a legend when it comes to chronicling high school dramas, so it's natural for any filmmaker that's handling the same subject to be taking inspiration from his movies. I think Holland's fellow young co-stars are just as perfect in their roles. And Michael Keaton is superb. The movie doesn't have to keep hammering the whole working class man getting screwed over by the rich and powerful because Keaton himself already does a good job of conveying that. I enjoy the vibrancy of the chases because the movie keeps reminding us that Spider-Man can't go immediately from one location to another so Spider-Man has to hitch a ride or trespass a backyard or crashes a sleepover tent.But because the humor really works, the drama has to come from somewhere else. They remove the origin story involving Uncle Ben and they also remove the \"With great power comes great responsibility\" essence, and they replace those with the dilemmas that Tony Stark had to experience in his previous film which asked the question of can a superhero be a superhero without his suit. To some, this might make sense so as to give us Spidey stripped down to his element. While others might see it as an effort to include Spidey in the MCU that comes with the risk of turning our friendly neighborhood hero into something else. The tech-based suit does provide some of the film's hilarious moments, but at times it makes Peter Parker/Spidey even more bumbling than he should be. So I'm not suggesting that iron-manizing Spider- Man is a terrible idea but clearly there are just too many MCU fingerprints all over what's supposed to be a Spider-Man new solo movie. The classic song might as well go like this \"Spider-Man, Spider-Man, does whatever Iron Man can.\"-- Rama's Screen --"}, {"score": "9/10", "review": "This movie is awesome, really funny,amazing cast, tom Holland is the Spiderman we waiting for. the action scenes was amazing, good effects. the vulture is the best villain in the marvel cinematic universe, he is really scary and incredible. Good movie. PROBABLY THE BEST MOVIE OF SPIDEY AND THE BEST MOVIE OF MCU.IF YOU DON'T HAVE SEE IT, THEN GO AND SEE IT BECAUSE THIS MOVIE IS: AWESOME,FUNNY, EMOTIONAL, BEST Villain, GOOD CAST, AMAZING SPIDEY. Thanks for read it. bye!"}, {"score": "10/10", "review": "You will enjoy every single minute of this movie, Tom Holland is definitely the best peter Parker and Spider-Man we have ever seen. Marvel studios really did deliver with this one great action, humor, comedy, and much more. The villain in this movie who is the vulture is probably the best marvel movie villain ever, Michael Keaton gives his best portrayal of the role. This is not a iron man movie this is a straight Spider-Man movie that tells us his life before and after civil war and it all sums up very good."}, {"score": "10/10", "review": "There, I said it.Played by British actor Tom Holland (The Impossible), Spidey gets a fun and completely fresh reinvention from new director Jon Watts and studio boss Kevin Feige – with a little help from Robert Downey Jr.'s Tony Stark/ Iron Man, Jon Favreau's Happy Hogan and newcomer Jacob Batalon as Ned.Like Daniel Craig's revision of James Bond, Holland's interpretation of Spider-Man has set the hero down an invigorating new path.After a failed reboot with actor Andrew Garfield and director Marc Webb – 2012's The Amazing Spider-Man and 2014's The Amazing Spider- Man 2 – Sony, the studio that owns the rights to the Marvel character, wisely decided to let Marvel Studios take creative control of the wall- crawler and add him to the MCU.Now, he gets to interact with Iron Man and the rest of the Avengers.Following the character's introduction in an epic airport battle sequence in last year's Captain America: Civil War, Homecoming picks up with a teen aged Peter Parker back in his Queens, N.Y., neighborhood living with Aunt May (played by Marisa Tomei) left to fight street-level crime with a cool new suit (courtesy of Tony, naturally). \"We'll call you,\" Tony tells Peter as he's dropping him back home.Eager to prove his mettle as a full-time member of the Avengers, Peter thirsts for action, taking down bike thieves, helping the elderly with directions and tackling hoodlums like Aaron (Donald Glover). Still, he wants more.But then he crosses paths with Michael Keaton's Adrian Toomes (a.k.a. the Vulture) and his merry band of baddies, and decides to do something about it. It's not that Tony doesn't care; it's that Tony is too busy. And Peter sees it as an express pass to becoming an Avenger.Oh yeah, and he's still in high school dealing with crushes, girls, science class, gym and detention (the film completely skips his origin story including the spider bite and Uncle Ben).It's not only the best Spider-Man movie – it's one of the best films in Marvel's cinematic universe."}, {"score": "8/10", "review": "Spider-Man: Homecoming pits Peter Parker against The Vulture in Marvel's latest adaptation of its oldest and most recognizable hero. Directed by Jon Watts and starring Tom Holland, Michael Keaton, Robert Downey, Jr and Zendaya, the film relies on both CGI and heartfelt performances to make it work and it most certainly works way more than it doesn't. Despite some irritating comedy and an odd performance from Zendaya, Spider- Man: Homecoming is one of the better MCU films that will surely enjoy some love from fan's and audiences alike.First off, the film is a very easy and definitely the most accessible Spider-Man film. There really isn't anything new to see here regarding story. Like DC's Batman, Spider-Man's backstory is common knowledge at this point and the film doesn't waste too much time on telling it. I'm shocked that a third rendition of Spider-Man was able to be thrilling again let alone interesting. So much so that the fact that it managed to hold my attention even through the same story is a helluva feat that Watts captured beautifully. While I really liked the way this film told it's story, I wasn't so much a fan of the humor of the film.The humor used began as light but was then relied on a little too much. While we all have grown accustomed to Robert Downey Jr as Tony Stark and his incredibly snarky wit, the humor was less welcomed with the supporting cast especially with Zendaya as Michelle. Michelle is a really awkward character that could have benefited from either better dialog or a better actress to land those comedic moments better. Either way, the character and performance didn't bode well with me but the audience seemed to enjoy her quite a bit. Personally, as far as humor was concerned, Jon Favreau as Happy was the source of my entertainment as he is in it a surprising amount of time and doesn't disappoint. As for the rest of the cast, all were pretty standard for a comic book film outside of Tom Holland.Tom Holland is superb as Peter Parker. He brings a light to the character that has been missing from all the previous cinematic renditions. It's pretty simple...Holland plays Parker as he is written: a teenage kid. He really does embody what it means to be Peter Parker and relishes in the performance. It's not over the top, it's played just right. And with a great hero, there's a great villain. Michael Keaton is tremendously menacing as Adrian Toomes aka Vulture. He really lays on the sinister nature of the character and the scenes that he shares with Holland are very good.Overall, Spider-Man: Homecoming is probably the best rendition of the titular character that audiences have seen. Tom Holland and Michael Keaton are tremendous in the film along with much of the supporting cast. Jon Watts delivers to audiences what any up and coming director could ever hope for: a really enthralling and invigorating summer blockbuster. Homecoming is bound to go down as one of the finer installments of the MCU and one of the best blockbusters of 2017."}, {"score": "10/10", "review": "This incarnation of Spider-Man is in my opinion is the best everything about this incarnation is on point and everything school related was also interesting but what surprised me was michale Keaton as vulture a villain I didn't think would be cool in the movie. The scenes with Spider-Man were very entertaining to watch."}, {"score": "10/10", "review": "Spider-Man Homecoming is the greatest reboot that ever happened in the Marvel Cinematic Universe. This is a clever and incredibly funny film. It takes place two months after Captain America: Civil War. Spider-Man wants to become part of the Avengers, however Tony Stark thinks he isn't ready because he is a child and still needs to learn from his mistakes. Peter Parker tries to juggles being a high school kid with being a hero. Also in this film, Peter tries to stop a group of men from selling dangerous weapons to people.I love this film for the characters and their banter. Tom Holland makes Spider-Man, the teenager, very lovable and relatable. I like how they show Spider-Man as a bit immature and relaxed, unlike other films where Peter is too serious and the films feel pretty dark and grim. My favorite character is Ned (Jacob Batalon) because he asks Peter so many questions about Spider- Man and that makes it really funny to watch. Robert Downey Jr.'s portrayal of Iron Man mentoring Peter is quite wonderful. Iron Man helps him but he doesn't take the focus away from Spider-Man. Spider-Man's constant banter in this film is also quite amusing. This film makes certain that Spider-Man can stand on his own in another sequel.There is one thing I did not like about this film and that is the storyline about his crush. It really doesn't develop and it seems that it is only there as filler. Besides that the film is great.I give this film 5 out of 5 stars and recommend it to ages 8 to 18. I think adults might like this as well. This film does contain intense scenes and some inappropriate language, making it unsuitable for younger viewers. This is a \"know your kid\" movie. I recommend it to people who like action, adventure, comedy, films based on books and family movies. This is a movie worth seeing and I guarantee you will not only like this film, you will love it.Reviewed by Ryan R., KIDS FIRST! Film Critic."}, {"score": "8/10", "review": "Yes. This may be a great coming of age movie, and a great superhero movie but not the greatest spider-man movie. I'm not being stubborn here about the classic. I've seen reviews saying it is the best Spider- man movie ever. I can't agree with that because the villain and some supporting characters are so underdeveloped. Tom Holland tries a ultimate spider-man style but in the end all we get is the Kung-fu Panda version of spider-man. It was fun in civil war because it was short but here he keeps whining about it almost every minute when he was Peter Parker. In overall, this is just another MCU popcorn movie. It's entertaining as hell, good to re-watch on Blu-ray and keep it in your MCU collection. BTW, Tony stark was awesome once again."}, {"score": "7/10", "review": "I remember when I first saw Tom Holland in Captain America: Civil War, I knew he had a lot of charisma for the Spiderman role. The only skepticism I had for the reboot was, can the story or feeling I once had for Spiderman come back? Spider-Man(2002) and Spider-Man 2(2004) are one of the greatest superhero movies up to date. It was an awesome introduction to the superhero universe, and it utterly made me fall in love with the characters. Just for reference, Spiderman is still my favourite superhero.After watching the early screening for Spider-Man: Homecoming, I will still say that the Spiderman movies we knew 13 years ago are still unbeatable out of the 6 movies we have gotten. Don't get me wrong. I still had fun with this movie, but it didn't feel like a Spiderman movie. It felt like a side story of an Avengers movie. And that disappointed me. We are constantly reminded that Spiderman is a second class to the Avengers team or this is an introduction to the upcoming Avengers movie. I would have much preferred to see Spiderman as the standalone Spiderman. That was my main gripe.Moving along, Tom Holland is not only the youngest, but also the most charismatic, and comedic character or actor from the three Spiderman we have seen on-screen. He plays a believable high school student who is struggling to find his identity. He balances well between learning the ropes of being Spiderman, while at the same time trying to be a normal high school kid. However, there is something missing in his character. His struggles are resolved too easily and quickly. Everything comes off as comedic or gets resolved by the help of a third party. There were no consequences for his actions. Moreover, the other supporting characters lack depth. We don't get a backstory on them. Michelle played by Zendaya and Liz played by Laura Harrier could have been played by anyone. The character Flash seemed like a miscast for me. He was out of place and his physique let alone his character did not match. On the other hand, Ned was an awesome character. He really worked well with Peter Parker. Furthermore, the main antagonist played by Michael Keaton is nowhere near as in-depth as Green Goblin or Doctor Oc. I will say that he is one of the better villains we have had in superhero movies these days though. There is more to his character that might surprise you, and that was what took this movie to a higher level for me. Also, Michael Keaton does a great job because sometimes he does truly scare you with just his eyes! The story is simple, but it works well in this case. There are a lot of banters and one-liners. Some were funny, and others felt repetitive. In fact, it had all the comedy, lightheartedness, and humour that a Spiderman movie should have. Nonetheless, it lacks depth and emotions. Even though we get to experience the struggles of Peter Parker's teenage-hood as mentioned, nothing is ultimately at stake here. For all the chaos that was happening, the body count was very small.The soundtrack is nowhere near as memorable as the Danny Elfman soundtracks. I still believe that the Danny Elfman Spiderman theme song is one of the best superhero theme songs out there next to Dark Knight and Wonder Woman. Every time the theme song is playing, you know it's Spiderman! That's how memorable it is. I wish they could reuse that.The action scenes were kinda shaky. I did not see everything very well. They were not as visceral as the Sam Raimi movies. In fact, I re-watched some of the action sequences from Spider-Man 2, and they are still better choreographed than this one. However, keep in mind, that this is not an action packed movie. It is mostly about Spiderman figuring out his abilities. The movie is not an introduction to Peter Parker taking the mantle as Spiderman, but how Peter Parker transitions from not being \"Spiderboy\" anymore (slowly).I still prefer Sam Raimi's classic take on the Spiderman costume. In here it looks a bit CGI, and too much like \"Iron Man\". Another reason why it reminds me of Avengers all over again.I sound like I really hated this movie, but I don't. I enjoyed it for what it was. I was just expecting more from a Spiderman movie, so I am more critical.7.5"}, {"score": "10/10", "review": "Its not the best Spider-Man movie(Spider-Man 2 duh) but Tom Holland did a great job and founded balance between perfect Spider-Man and perfect Peter Parker.For me,this movie is must-watch because i am a huge Marvel and SM fanboy.I recommend this movie for anyone who is like me,i am not disappointed."}, {"score": "8/10", "review": "In \"Spider-Man: Homecoming,\" Peter Parker is a superhero-in-training whose alter ego is just being discovered on YouTube clips, and it's fun to see him try to gain control over his capabilities. In place of the usual Tarzan swings through the gargantuan urban canyons, he operates in more compact spaces, shooting out his web in small targeted bursts. His suit, designed by Tony Stark, is equipped with gimmicks he's just learning about. Yet the way the movie deals with all this stuff is more rote than ingenious. It's hard to even tell where the suit's powers leave off and Peter's begin — or, judging strictly from \"Homecoming,\" if he even has powers of his own. We all know the spider-bite basics of Spidey's origin story, but too much rebooting has now resulted in a certain vagueness, as if the film couldn't be bothered to fill in the logistics. That said, the flying action has a casual flip buoyancy, and the movie does get you rooting for Peter. The appeal of this particular Spider-Boy is all too basic: In his lunge for valor, he keeps falling, and he keeps getting up. The rest of the movie isn't bad, but it's very much down to earth. There's an aspect of comic-book superhero films that's more or less encoded in the names of the heroes. Superman. Batman. Iron Man. Wonder Woman. They fly, they scowl, they see through walls, they repel bullets, but they are all grownups. Peter Parker is different — and he's especially different in \"Spider-Man: Homecoming,\" where Tom Holland plays him with a gawky, anxious deer-in-headlights teen innocence that's so fumblingly aw shucks and ordinary that it seems almost incongruous when he's referred to as \"the Spider-Man.\" What he looks (and acts) like is Spider-Boy. Tobey Maguire, who certainly seemed boyish at the time, was 26 years old when he first played Peter, but Holland was just 20 when he shot this film, and it makes a difference. \"Spider-Man: Homecoming\" is the story of a savior who's still mucking around in the business of being a kid. It's almost as if he's his own fanboy."}, {"score": "7/10", "review": "IT MAY seem ridiculous, rebooting Spider-Man for the third time in 15 years but after seeing Spider-Man: Homecoming, you'll be glad they did. The Tobey Maguire Spider-Man of 2002 was fine; the Andrew Garfield Amazing Spider-Man of 2012 was also fine. The Tom Holland Spider-Man of 2017 is the best Spider-Man movie ever to grace the screen. Spider- Man: Homecoming is the perfect blend of high school dramedy and superhero antics. This is Marvel's homage to John Hughes, complete with Ferris Bueller reference. By taking it back to the school setting and ageing Spidey down to 15 years old, it recaptures some of the innocent magic gleaned in the comic pages. It also, for a movie with a flying villain and an altitude-defying superhero, grounds the story. One of the main criticisms of superhero blockbusters is that they're overblown with ever-increasing, imminent apocalypses and cities toppling over, usually in a stupidly bombastic third act. Here, the stakes are much smaller, as is the body count with Peter turning off his suit's \"kill mode\" as quickly as he realised it existed. For this Spider-Man, asking a girl to the homecoming dance is as fraught as stopping the bad guy. Our reintroduction to this iteration of Spider-Man starts with a home video Peter shot on his phone of all the behind-the-scenes action of his adventure with the Avengers. It's cheeky, fun and a clever reminder of what a big hit the character was in Captain America: Civil War and how Holland managed to steal every scene he was in from much, much bigger stars. It sets the tone for the whole movie as we join Peter at his science high school where he and his Star Wars-loving friend Ned (Jacob Batalon) aren't the most popular kids in school. Here, Peter has to worry about Spanish quizzes, winning the academic decathlon and keeping his secret identity under wraps from the classmates he saves. In many ways, it has more than a touch of Buffy the Vampire Slayer.Thanks , Rijil www.ekavala.in"}, {"score": "8/10", "review": "My take on Spider-Man Homecoming. To me it seems like Sony and Marvel were in a battle. Sony execs were trying to make a terribly written movie to match Spider-Man 3 and Amaz Spidey 2, but Marvel tried to blunt their blows with making Tom Holland an awesome Spider-Man. For me, starting around the ferry scene (which just turned ridiculously stupid) the \"small world\" plot devices and ridiculous name dropping was stupid and insulting. The over the top forced diversity is annoying. Why was Liz black? OMG, a beautiful actress and good job...but why not just create a character for her to be?! Flash was so off point it made my skin crawl. \"Michelle\"...I want to kick Sony in the teeth. Holland saves the movie...but, even though this will be a blockbuster...the seeds of Sony's inept handling of the franchise are already planted. It's so easy to predict that Sony will ruin this franchise in 1 or 2 more movies, completely. I give it a B...because Tom Holland was great. Ned was good...but was he a new character or a bastardized Ned Leeds? So sick of Sony and Fox."}, {"score": "10/10", "review": "I gave 10 out of 10 because I saw the rating was 'only' 7.9, and I think Spiderman:Homecoming deserves more.I am not trying to compare this version to its predecessors. It's simple: If you want to know how a teenage Peter Parker feels the first time he thinks he could actually be a 'real' superhero figure, you must watch this movie.Being an Avenger is definitely every good-hearted-teen-with-superpowers wants to be!And Peter is indeed a teenager the first time he gets his superpowers: dealing with school, crush, friends, parents, ego, beliefs..So this movie's just a proper portrayal of what he should be doing. P.S.: This movie's so fun!"}, {"score": "8/10", "review": "First of I am not sure why there is another Spider-Man but who care's it was great. I went to see Spider-Man: Homecomming this morning and I thought it was great. I like the story about how Peter Parker is involved with Tony Stark and it was cool that they showed what happened with spider-men during the avengers movie. Is there some amazing plot? No, but I guess not every movie has to have one (especialy a super hero movie). It was very enjoyable to watch, some funny jokes, good acting and cool spider-men expected fighting scenes. Just to be noted, Tobey is still the better Spider-Men in my opinion but would still Recommend watching Spider-Man: Homecomming ^^"}, {"score": "7/10", "review": "We're all very used to there being many Marvel movies coming out every year, and this feels like another one right from the same gears as \"Iron Man\" or \"The Avengers\", but more scaled down. It doesn't get bloated or overcrowded with invincible heroes. Which I appreciated. There's arguably less superhero action scenes then you would think and more focus on our main character's struggles in life. Is the Marvel formula getting tiresome? That's what I feared, but \"Homecoming\" manages to bring back that relate-able, friendly feeling that you had watching the Sam Raimi films. I'm happy to say this because I was not looking forward to there being a second reboot of Spider-Man.If you've seen a \"Spider-Man\" movie before then you know what you are gonna get. It's a huge improvement compared to the Andrew Garfield ones. And I'm not being biased to Tom Holland or Tobey Maguire because I think all the actors who have portrayed Peter Parker have been great. It's just that all the movies haven't been the best. So, I went in with no real expectations which I think made the experience better. There's a lot of comedy here and the jokes really landed. I found myself laughing often. Especially with all the high school stuff and Happy Hogan's role in the story. I did honestly enjoy the comedy more than the action. Because all of the exciting scenes weren't so amazing, but they were alright at best. Michael Keaton plays one of the better villains in the Marvel Universe. He's not a mustache twirling bad guy, but a man with motivations you can understand. Most importantly; He was an actual person, not just a cartoon with a costume. The rest of the players are fantastic as usual. Robert Downey, Jr. brings his A game even if it's just for a supporting mentor role. The first act of the movie was the strongest with many hilarious moments. It somehow slows down in the second act and never gets as good as the beginning. The finale was not great either. Kind of lackluster which is a shame. Like I said, I enjoyed the more downplayed or funny parts more where there was no big action moment.It's a crowd-pleasing one. The thing about these Marvel movies is that they are enjoyable. They know when to have fun and when to be more serious. This one brings the fun back to Spider-Man. He is not unbeatable and good at everything. He has his powers, but he hasn't learned how to use them all yet. We get to be part of that journey and at the same time see the juggling of his school life. It's a pretty innocent movie that would surely make Sam Raimi proud. Not the most original one I've seen, but a good time nonetheless."}, {"score": "4/10", "review": "Spiderman Homecoming More like coming soon as teen kids TV series on Nickelodeon channel.Having watched all Marvel movies, i would say rebooting spider-man 2nd time was a big mess. Instead of neighborhood friendly crime fighting Spiderman was turned into another alien fighting comic hero. With almost Iron man suite capabilities, instead of Jarvis and laser powers,another talking robot as Karen and spider webs.Ruined the original Toby Maguire spider-man movies, where it was shown more genetic mutation powers, and here it was all high tech. Marvel was trying hard to somehow stitch the avenger scenes into spiderman, as if it was all planned from 2nd Avenger movie, not unlikely though. And Iron man character looked like they were forcefully trying to make him into the cameo appearance."}, {"score": "10/10", "review": "Perhaps the best spider-man movie yet. No doubt, Holland did a great job portraying the character. We get to see the life of Peter Parker as an actual high school kid and how he deals with all the responsibilities and be spider-man at the same time. It is a must watch movie, whether you are a comic book reader, spider-man fan or simply a good movie lover. We get to see Vulture for the first time on screen and he really challenges Peter to sacrifice for the greater good. Hands down, one of the best movie ever made."}, {"score": "8/10", "review": "It may seem greedy and a bit stupid doing another Spider-Man reboot so short after the last one, but Homecoming brings something fresh.Talented Tom Holland is an amazing asset to the movie. His charisma and comic timing balances this new Spider-Man flick in way that both makes you care more about what happens in the movie and, more importantly, brings a well-needed break from the somewhat mechanic action of the Avengers and Captain America movies. It's a bold move letting young and rather inexperienced feature film director Jon Watts (\"Clown\", \"Cop Car\") direct a blockbuster of these proportions. Usually, this is done in order to make it easier for the producers and the studio to control the production, but here, clearly, we're given the vision of a director and not the formulaic mess the studios sometimes forces through. Last but not least, kudos to composer maestro Michael Giacchino, who's created what is probably the strongest Marvel score this far."}, {"score": "10/10", "review": "I am a 35 year old guy from Scotland with a degree in digital film making. But I do not fancy myself as a critic. I know how hard it is to start with a white page and create a moving experience. The right ingredients can still create an awful mess.That is why they call it cinema magic. Many times Hollywood has ensembled the perfect cast, story, director etc. but has totally missed the mark. Batman V Superman could be put on that list. The ingredients were fine, but the magic wasn't there. I really wanted to love that film. I have dreamed about it as long as I can remember. But in that context it was a total failure. Scene after scene I felt let down, betrayed. How could these people just not get it? The lack of understanding in the source material was shocking.That brings me to Spider-Man Homecoming. My expectations were reserved for this film. I have been let down so often recently. Even from Marvel and Marvel Studios. The Civil War was a bit of a damp squib. Avengers 2 was basically Avenengers in eastern Europe (With robots). The rest of the line-up recently is kind of dull. Don't get me wrong. They are not bad films, they are good films, but they are not great.Spider-Man Homecoming is; in my opinion, great. From the beginning to the end I was delighted, amused or moved.Big-budget action scenes are standard fare nowadays, but to give those scenes real purpose and finesse is unique. The limitations of physics; or the local geography, really ground the film in a reality DC films have struggled with. Spider-Man is put in environments where Holland's youthful spirit is forced to mature in front of our eyes.The characters are fully formed human beings, with passions and flaws which make the whole story more believable. Michael Keaton and Tom Holland are wonderful at giving the protagonist and antagonist purpose. We understand why each is following the path they are on, without the need of explanation.The story is kept provincial; compared to the usual super-hero smash-a-thon. With Peter (Tom Holland) dealing with neighborhood problems. But we still get the implication that the effects could spread to the wider world, giving a real sense of peril.Spider-Man Homecoming is a fitting title for this film. That is what it feels like. With all the warmth and memories of an almost forgotten childhood. It feels like coming home"}, {"score": "10/10", "review": "This movie was totally off the hook. The storyline was amazing. It was completely hilarious and full of action at the same time. The graphics and choreography were both awesome. I enjoyed every moment of it. Love the new Spider-man suit. Robert Downey Jr/Iron Man was spectacular of course. Love his mentorship towards Spidey. Michael Keaton made a fantastic villain. I would recommend lots of people to view and savour this classical blockbuster masterpiece. This movie deserves 5/5 stars. Kudos!!!"}, {"score": "8/10", "review": "Well, this was a movie that I was actually feeling a bit weird to see at first. Reason being it was the 6th Spider-Man movie done in the past 15 years and Tom Holland was the 3rd person portraying the superhero. I was earlier hoping for a 3rd Spider-Man movie with Andrew Garfield since the 2nd one left with a rather disturbing cliffhanger. But with the recast and the inclusion of Spider-Man into Marvel Cinematic Universe, that hope vaporized already. So even though a Marvel movie was generally highly anticipated, my excitement towards the movie was a bit mixed in the beginning. However, after finished seeing the movie, I felt that Sony pictures was correct in their decision to join up with Marvel Studios as this movie was fantastic.The earlier part of the movie was a bit too light for me as I felt it was a really teenage movie with high school problems. But as it continued on, the movie became heavier and more complex, especially with the challenges that Peter faced with his wish to be taken seriously by Tony Stark, and also his dilemma between high school education and the life of a superhero. Being a kid of 15 year old with only his aunt certainly did not help (Yes, this Spider-Man is really just a kid!).Now aside from the story which I think was excellent from the middle onwards, I felt that there was too little screen time of Aunt May (seemed like she was not a supporting role but just a minor role and was unclear of her role in Peter's life other than just being there few times). This movie was not like any other origin story of Spider-Man with the showing of how he was bitten or how Peter became a Spider-Man and there was not even a flash back to show that. I guess the writers thought it was enough shown anyway in other adaptations.This movie was very good in term of its special effects and action sequence. I felt it was done fantastically during at least 3 different major fighting scenes involving Spider-Man. Its sound effects were also nice (though it was strangely not made in Dolby Atmos or Auro 11.1 system). The major surprise in the last third of the movie was good and also a bit of nice surprise before the end. As usual Marvel movies, this one had got post credit scene. One in the middle and another funny one at the very end that you should not miss out.For a movie with just a little over 2 hours, surprisingly it had quite significant story line and quite a lot were told, though as I said the beginning was very light. One major thing that I felt was good was the amount of screen time for Iron Man was not too much. Otherwise it would not be a Spider-Man movie but a Spider-Man & Iron Man movie. He was shown only occasionally which was just enough since Robert Downey Jr. had such a major on screen appearance and would take the spotlight off Tom Holland who I think was pretty good in portraying a very young Spider-Man.So if you are a fan of Marvel movies, this one would not disappoint you. If you are one of those audience who felt there was too many superheroes movies in the past few years, you should still try and see this one as I believe it would be worth the while. For family and young children, this movie would be quite entertaining and as what I saw in the internet, the ratings for the movie was very high and it would most likely go on as a major hit again for Disney/Marvel studios. For my complete review, pls have a look at michaelnontonmulu.blogspot.co.id"}, {"score": "1/10", "review": "Whether Spiderman really exists or the world is going through an extended period of artistic involution, what do you think? Let me tell you what happened after I've seen the movie. I went straight to the loo to make number two. A spider appeared in the toilet. He was still on the wall when I got up. After that he fell in, I do not know if accidentally or he committed suicide. What do you think of that? I think nothing happens accidentally... OK, Michael Keaton and Robert Downey Jr. are two excellent actors. One more talented than the other. Robert Downey Jr. is perhaps the most versatile actor, he can play anything. Michael Keaton is also anointed with all the ointments. But money is the devil's eye, and without money you can not live. That's why you become Iron Man or Vulture... Marisa Tomei has made some decent roles too, in her youth. I do not say they play badly, all three are very good, the movie is bad, very bad!"}, {"score": "7/10", "review": "Dear readers, yesterday was the first day of screening of Spiderman: Homecoming in my home country, Indonesia. For Indonesian people, the figure of Spiderman has been becoming a symbol of young, brave, and honest superhero, other than Batman with its political conflicts or Superman with its science fiction method. For us, Spiderman is like the representation of a real hero in the society. Spiderman is not rich like Batman, nor having inter-galaxies power like Superman. Spiderman is a college student, being bitten by miraculous spider, and then becoming a hero during nights. Now in 2017, Spiderman movie is back and we are so excited to watch it. Firstly because of the title with the word \"Homecoming\". This makes people curious. \"What happens to Spiderman?\", \"Why he needs Homecoming?\" or \"What is Homecoming itself?\". So here it is my review!! Spiderman: Homecoming is the story about the Spiderman at the age of college student, young, beauty, clumsy, confused, narcissist, and other characters linked to a college student. Those characters make this movie really fresh and give some fun to the watchers. The next critical point is some physical appearances of Tony Stark (Iron Man) and Avengers team. For those who are not following the Avengers so intensely, maybe would be confused what is the link between Spiderman and Iron Man. The other thing that maybe the Director want to show us, is the plots concerning to illegal business or black markets within superhero equipment. That movie's plot is quite new and intriguing fact that a hero always needs a modern and updated thing also in the modern globalization time, including online videos. Too many good points to be judged for this movie, but for me, the minus point is only the action of Spiderman. He is everywhere in the movie, of course, but his actions are not so cool like Toby Maguire ever did. Well, but yes, I still recommend this movie since you will know the young face of Mary Jane :) Happy watching, Spiderman fans!!"}, {"score": "9/10", "review": "Spider-Man has been one of my favourite superheroes of all time. While many grew up on the old Batman or Superman films, Rami's Spider-Man trilogy was my superhero films. And while now I see flaws in the third installment, the first and second still stand as not only two of my favourite superhero movies of all time, but my favourite movies of all time. Spider-Man Homecoming does something different to the other Spider-Man films and they absolutely nailed it. Previous films have had most of the focus around Peter being Spider-Man while also being a student. Homecoming flips this. We see Peter as a student who just happens to be Spider-Man. By far this was my favourite aspect of the film. Marvel have continued the trend of diving into new sub-genres. Because of the high school aspect, this movie is very much a coming of age story where previous ones have been mainly an origin story. Due to this coming of age angle, I feel that we know Peter more as a character than we ever have before and less of just the guy who is behind the mask.Despite a lot of focus going on Peter himself, I still think they did a great job of fleshing him out as Spider-Man. As we know from the trailers, we see Peter learning to use his new suit and I feel like they played those scenes really well being not only does it show Peter at times feeling out of his comfort zone with the suit, but you see him as a character feeling out of his comfort zone being a superhero.Humour is something we have come to expect from Marvel movies and this movie was no different, however I thought they really changed it up. While there were still the quips and one liners, being a movie that is centred around high school life, they had high school humour. The jokes the students were telling were different to the types of jokes a teach would tell. In many ways, it felt a though a high schooler had written the jokes for this movie. There was puns and play on words and a touch of that immature humour that we wouldn't get in any other movie where an adult is the main focus.Moving onto the cast, I thought they were all fantastic. Tom Holland is officially now my favourite Spider-Man. While much of the reason why is because of the writing and the story around it, I felt that he really nailed the Peter aspect of the character as well as being suited to being the fast talking, quipy Spider-Man. The return of Jon Favreau as Happy was very well suited to bounce of Holland's Parker. Jacob Batalon, Laura Harrier, Tony Revolori and Zendaya all nailed their specific roles as high schoolers in Peter's life.I really need to take the time to talk about the two big names of this film, Michael Keaton and Robert Downey Jr. Firstly, I thought Michael Keaton was amazing. It's not often that we come out of a Marvel movie and the villain is one of the stand outs but in this case he was. While much of the credit goes towards the writing and backstory of this villain, Keaton was able to portray the emotion and presence needed to sell us on the Vulture. Secondly, any fears people had about RDJ being a massive part of this film will be brushed away. I wasn't specifically keeping count of how many times he appeared, but his total number of scenes but it would have been no more than maybe 5 or 6. What really worked with those scenes were that story wise, it made sense that Tony was there. Tony is very much the father figure of Peter and I think RDJ really nailed that role, considering that this is a side of Tony we haven't seen a lot of.Like most Marvel movies, they are filled with easter eggs. I in no way consider myself close to a Marvel expect, but there was quite a few that I picked up on which makes me feel like there are going to be so many more that I missed. Most of the eggs are off handed references amongst dialog or in the background that don't take away from what is happening in the scene.There are two reveals/twists that his movie has which I thought were both great. One of them many people already assume is going to be revealed in some way, however there is another that completely caught me by surprise. What is most important about that reveal is it up the stakes level for the third act. It got you more invested because you knew that what was going on means so much more than it did before.While I do have a few problems with the film, I think most of them is just personal expectations I had going into it, rather than straight forward film problems. Personally I would of liked to have seen a bit more of Donald Glover, Marisa Tomei and Hannibal Buress, but I understand why they were pushed aside for the most part in this story. On the flip side of that though, I think both Glover and Tomei are going to play a role in the future of Spider-Man in the MCU so that gets me excited for the future.Overall, it's hard to say where this ranks among the other Spider-Man films for me. I know it rates above many of them, but only time will tell if it will overtake the first 2 Rami films. However, this is still an amazing movie that I know I am going to revisit time and time again.9/10"}, {"score": "5/10", "review": "So here we are again, ANOTHER Spiderman reboot that nobody really wanted. Who'd of thought, Spidey was Tony Starks bitch all along. I have seen ALL of the other recent Spidey movies and this did not add anything new, i'm just glad I didn't have to sit through the whole \"bitten by a radioactive spider\" story again. Although I thought Tom Holland was a good Spidey he's actually 21 NOT 15, why not get an actual teenager to play PP instead of adult actors having to play kids!! The story and writing were very weak and in general I found the whole film to be rather boring, predictable, irritatingly noisy with the usual set-ups and a less than threatening villain, also PP lives in the most ethnically diverse world ever!! this felt rather forced and fake to me. My problem with these heavily CG films is that you are not actually watching REAL people so therefore there isn't any feel of dread for the characters on screen, who cares if a CG teenager dressed as a spider is being chased by a CG old man dressed as a vulture!! I realise I am not the target audience for this type of film but at the end of the day \"a good film is a good film\" regardless of the age group it's aimed at. I'm sure early teen boys will find it \"awesome\" but it left me rather cold and underwhelmed. Definitely not worthy of all the hype."}, {"score": "8/10", "review": "This review of Spider-man: Homecoming is spoiler free**** (4/5)SPIDER-MAN MUCH like his other superhero friends in the Marvel Universe has been through many changes over the years, he's been Spectacular in a comic book series that cleverly titled The Spectacular Spider-man, in film starting in 2002 starring Tobey McGuire he was the ordinary web head with a fun origin story. He was called amazing in 2011 when Andrew Garfield played him in the first rebooted series, and finally even his second rebooted appearance in last year's Captain America: Civil War though short was in a word; incredible. Yes the ultra famous crime fighting spider has been through a lot.In the latest reboot solo film he's back again with new blood Tom Holland, set several months after he fought alongside Iron Man in that infamous airport battle. Disappointed that a new reboot has appeared so soon? Well, don't be, this is the best Spider-man entry since 2004's Spider-man 2. Plus unlike the previous reboot, this isn't an origin story of Peter being bitten by a spider then gaining the powers. This is an origin story of him turning from Spider Boy to him becoming the Spider Man. It turns out that life for him isn't easy as fifteen-year-old Peter Parker is currently trying to balance his normal life as a high schooler, meanwhile fighting crime as his superhero alter ego Spider-man as a new threat...The Vulture (Keaton) emerges. This terrifying villainous bastard is complete with a furry coat, night vision gear and metallic eagle-like wings attached to a jet engine - he's terrifying. Keaton is fantastic as this evil big beard, who terrorises New York with his clan of criminals carrying alien-like weapons. It's up to Spider-man to swing in and stop him; however he soon finds that this battle is no match for him. Keaton somehow gets a kick out of playing scary birds, as either Batman or Birdman. Here his eyes twinkle every time he appears on screen; he shows that he's a man enjoying his late career.Holland's performance is fantastic, he shows to be the best choice here he's energetic, he's heroic and he's; well, hilarious, as Spider-man. As Peter it's a pretty stable match, the film uses him to his full potential as he tries to balance his, from his eccentric best friend (Jacob Batalon), his love life (Laura Harrier).His new mentor Tony Stark (Downey Jr.) is the solemn adviser, and he teaches Peter that being a hero isn't as spectacular as he thinks. New director Jon Watts who also showed strength with his pretty good cop thriller Cop Car. He makes this the most promising web head film in years, his direction of the youngsters involved is brilliant, and his handling of the veterans such as Robert Downey Jr. and Michael Keaton is wonderfully adept. The family values here are somewhat left in the background, in the previous entries more notably the original trilogy his trusted Aunt May was used as his go to person for advice. Here she's barely used for this, though she teaches a couple of things, its Tony who gets the most interest. Which is essentially the film's main flaw. Still, the web head swings with clarity, his new suit is spectacular and his hero abilities could not be better done, this is the best he has ever looked. Spider-man: Homecoming is sweet, witty and fast moving fun. VERDICT: He's back and he's better than ever. Swinging with joy in this spectacular most polished reboot, which is filled with fantastic and witty, web swinging fun."}, {"score": "10/10", "review": "Amazing reboot, different theme from your typical superhero as per all Marvel Studio films so far. The theme for this one is grounded, street-level and teen oriented; and wonderfully executed.The acting is superb from the cast, but Michael Keaton is the gift that keeps on giving. His presence and facial expressions stole the scenes as per his acting signature. Marissa Tomei was a delight and so were the young high school cast. Robert Downey Jr was as per his usual self, he didn't hog the scenes but he complimented Tom Holland very nicely in their scenes.In regards to the link to the other MCU films, well it was there but it wasn't over bearing, this film felt very separate and individual but with the rest of the other films lingering in the background with their impact to the universe.I would say this film is EQUAL to Wonder Woman as far as superhero films this year goes. Both are amazing and well executed.Who said Super hero films are getting stale?"}]