[{"score": "10/10", "review": "Waiting was definitely worth it! The Last Jedi perfectly fits into the well-established atmosphere of Star Wars, but at the same time it is different. Rian Johnson's revenue is clearly visible. Unlike The Force Awakens, where it was set to be more secure, here the director allowed himself to insert entirely new things that make up the big universe of Star Wars.The movie is noticeably darker, as was clear from the release of the first poster, the trailer and the ad campaign. Seeing that the movie is darker, which is not a minus, even makes it more interesting, because the last such movie was Episode V. Of course there are many fun moments that can not be missed.The fans will be happy because things they've been waiting for years become a reality in this movie. Every fan will be happy with the movie. The way our well-known galaxy heroes interact with those who build themselves are shown in an incredible way. In this way the universe is expanding.The Last Jedi answers a lot of questions, but there are many unknowns that we will not know until 2019.I dare say that The Last jedi easily enters my top 3 Star Wars movies and is also one of the best, if not the best, film for 2017."}, {"score": "9/10", "review": "The story is excellent and you will not believe some of the twists and turns of it. Everyone is unbelievably great but Mark Hammil steals the show. Great practical effects. John Wiliams score shines as always. I have many things to say but ill let you watch this amazing movie. Yes, its that good!"}, {"score": "7/10", "review": "For film fanatics like myself, The Last Jedi is a great film for people to see, regardless if they've witnessed the originals or not. On the other hand, if you've never seen the original Star Wars films and are just a casual moviegoer that have thought of the promotion for this film as being an action-packed thrill ride, then I'd have to warn to stay far away from this 2 and a half hour motion picture. It's very hard to review this film without getting into specific plot details, but that's exactly what makes this film worth the price of admission alone. For nearly every reason a film fan should be excited about a movie, here is why The Last Jedi is a must see as soon as possible. Before dropping you into this world with our characters, there is text at the beginning that will fill you in on the history of the events in the past and what has taken place during the past time. But even though that information is given to you, your experience just won't be the same without having viewed the first film and remembering the emotional core of it. Rey's character uncovers mysteries and secrets from the past, inevitably involving Kylo and the First Order while training with Luke. Quite honestly, that's the plot in a nutshell and the specifics of the film will lead to ruining your experience, so let's get technical.If not for anything else, The Last Jedi benefits from some of the best cinematography I've laid my eyes on in years. From the addition of the seamlessly blended visual effects, to the mind- blowing scenery constructed by the entire art department, I have nothing but praise for this film. Whether or not you find yourself enjoying your experience, the visuals alone should have you applauding, due to their incredibly detailed nature. I personally found the overall film to be magnificent, but when certain scenes were dialogue-free and asking you to gasp at the imagery, that's exactly what I was doing, as I feel many audiences members will. Again, without giving anything away, once Kylo, Finn and Poe enter the picture, the way both stories sort of interconnect was brilliant in my opinion. It does justice to any loose ends that fans may have wanted in the past, as well as create a new story to gawk at in the process. With a terrifically restrained performance by Adam Driver, you'll find yourself sucked into this world as a fly on the wall, as he uncovers mysteries about Snoke. With the addition of Mark Hamill giving one of his most sincere and memorable performances, as well as Andy Serkis in a role that really took me by surprise, this film was cast to the nines from beginning to end. Some may complain about Oscar Isaac and Gwendoline Christie not being included as much, but I felt as though the served the story quite nicely.In the end, this movie aims to impress Sci-Fi fans and Star Wars fans across the world, but I feel as though the people who will be looking back on this as a possible classic or at least one of the best sequels ever made, are those who've had the pleasure of indulging in the greatness that is 1980's Empire Strikes Back. I don't say this about films very often, especially when talking about sequels, but I haven't been this immersed in a theatrical experience in quite some time. This is definitely a superior film than the previous, it's one of the better films of 2017, and I'll be revisiting it very soon. The Last Jedi is getting a lot of praise and awards consideration from critics and film goers across the world, and every bit of it is deserved. Aside from being very long, this is pretty much a perfect film if you don't try to nitpick how it connects and certain questions that aren't blatantly answered. If you know what type of film you're in for, or you've at least seen the original and enjoyed it, I can't recommend this movie enough."}, {"score": "10/10", "review": "From all aspect this is by far the most attractive movie of star wars series to me. Not that i haven't seen all the movies , rather i am a real fan of star wars movies and i have seen all old and new movies very attentively. Also enjoyed those as well. But to me this is the movie of near perfection and ultimate action to go for.This movie is about a suspenseful united adventure of rey and Luke with other companions after their entry to jedi world. This adventure is full of twist and turn and sets a real exciting space opera of high voltage conspiracy , actions including different space instruments and arms, and overall a composite world of fantasy and drama. Their adventure brings many past secrets to light and many hidden facts are revealed by this.The movie is not absolutely concerned with actions and fantasy but it has a good build up of story around a very good plot and the acting as well as the direction , special effects are reasonably well performed.Those who like to watch fantasy movie will obviously like it. But it is the star wars lovers who will enjoy the most."}, {"score": "10/10", "review": "First of all, let me alleviate the concern that this film is a rehash of Empire Strikes Back by affirming that it is indeed not. The Last Jedi is by far the most original, surprising and exhilarating Star Wars film since the Disney-Lucasfilm acquisition in 2012. It's also a high point in the Star Wars saga, and I have no doubt it will be remembered as one of the most consequential chapters in the Star Wars mythos in the years to come.Which is why, I must implore audiences to please please please for the love of God, avoid spoilers at all costs. If you're a fan, and if you're reading this before going in, then I can assure you that spoilers will most definitely affect your movie-going experience, as there is quite obviously a lot that happens in this film that has so effectively been kept under wraps for the same reason.The Last Jedi could not have been what it is without Rian Johnson. It's very clear he's a massive fan of Star Wars, and this film is honestly more like an impassioned labor of love. His writing, the way he's directed this film, it all shines as some of the best I've seen this year. This is also a beautiful, beautiful looking film with what is quite possibly the best cinematography and visuals of any Star Wars film ever made.It's also incredibly well acted- Mark Hamill absolutely kills it. Daisy Ridley and Adam Driver also perform their roles as Rey and Kylo Ren perfectly. The rest of the cast is sound, and Carrie Fisher in her final role is every bit the Leia we've come to know and love, and then some.The score by John Williams is wholesome. There's really no other way for me to describe it. A wonderful mix of brand-new as well as familiar motifs and themes. Despite the great score and visuals, however, The Last Jedi manages to make your jaw drop several times with some of the most surprising moments in the saga thus far- there's a line that Luke Skywalker says in the film, that is the title of this review and is most definitely applicable to this film: \"This is not going to go the way you think.\" And that it is not, Rian Johnson has assured that with this story that's continually unexpected, a story that indeed changes the way you look at these films, which is precisely what it shares in common with The Empire Strikes Back, and that's every bit a good thing.I am incredibly lucky to have watched this movie premiere, but I truly think it's a lucky time for Star Wars fans all over. Watch this as soon as you can and try your best not to be spoiled. Of course, if you're a fan, you won't need convincing."}, {"score": "8/10", "review": "I attended an advanced press screening of the movie a few hours ago. It won me over! And bear in mind that I hated \"The Force Awakens\" (honestly thought it was a Episode IV rip-off). Here, director Rian Johnson doesn't play it safe, and it pays off. If I must point out a certain highlight, it's without a doubt Mark Hamill's performance. I really admired his ability to convincingly convey so many different emotions throughout the film; hats off to this guy. I'll be rooting for him in the future.After I had seen \"The Force Awakens\", I figured out I would never like a new Star Wars movie again. Boy, was I wrong. I loved \"The Last Jedi\"! This film had clever humour (there was a certain hilarious moment between General Hux and Kylo Ren that I couldn't stop laughing at; you'll totally know when you see the film yourselves), good cinematography and great characters (just see how developed Benicio Del Toro's minor character is) that I could care about. It also had a very good plot for the most part, with many unpredictable and surprising elements. The action was good, and the fighting scenes even better (great choreography).Although the ideas weren't always original, the experience felt real. Therefore, I often struggled to control my emotions. It was the ideal farewell to Carrie Fisher.I mean, what more could I ask for?"}, {"score": "10/10", "review": "This review is spoiler-free meaning it does not contain spoilers, but I will genuinely share with you how \"Star Wars: The Last Jedi\" affects me as a movie fan, as a Star Wars fan,.. and whether or not it does what it's supposed to do. Audiences around the world tend to agree with the statement that \"Empire Strikes Back\" is one of the best sequels ever made, well, I think \"The Last Jedi\" can easily take that honor now. This movie is astonishing and spectacular. It pushes many of this franchise's familiar elements to their limits and it really digs deep into the key characters and brings forth everything that stands out about them. Writer/director Rian Johnson is an impeccable storyteller.The story picks up after the events in \"Star Wars: The Force Awakens,\" by this time the First Order grows stronger as it corners the resistance to an impossible situation. Poe Dameron, Finn and Rose come up with a plan that could work but time is of the essence. Meanwhile Rey is doing her best to convince Luke Skywalker to join in on the fight, but Luke doesn't want to be a jedi or a master, let alone the resistance's final hope.Ok, so if you're wondering what happens with Kylo Ren, Rey, Poe Dameron and Finn and how they affect each other this time around, without giving it away, what \"Star Wars: The Last Jedi\" does is essentially flesh out these characters. Not only will you get to know some of their history and their background and what truly compels them, but this time they're also facing some very difficult choices. And the film also lays out judgement on some of them, it puts an end to some parts of the story that doesn't need to be continued anymore in the next episode. And what's brilliant about the story that Rian Johnson has crafted is that it makes you the audience think that each of those characters has their own respective path that they're going on, you expect them to see it through but bam, other plans take over but turns out these new unexpected plans actually make sense to the overall arc. Johnson wants these characters' personal journeys to be a refined in the fire type of journeys. Each revelation, each aspect, brings them one step closer to being the lead stars, front and center of this new trilogy as the old icons take a step back further away from the spotlight. Speaking of whom, it's so awesome Mark Hamill be Luke Skywalker again, he has a bigger role this time, such a larger than life legend, and Hamill actually gives his best performance in years in this one.I know that a lot of fans consider \"Star Wars: The Force Awakens\" to be more or less a rehash of \"A New Hope\" and I don't blame them for thinking that because to a certain extent, it was a rehash. But it's a necessary one because after the super boring parliamentary-heavy prequels by George Lucas. So it was important for \"Star Wars: The Force Awakens\" to remind us that this franchise was once super fun and exciting. So because that problem was taken care of, so now Rian Johnson doesn't need to do such reminder anymore with \"Star Wars: The Last Jedi.\" It is not a Empire Strikes Back rehash. Rian can freely do what he does best, similar to what he did with \"Brick,\" \"The Brothers Bloom,\" and \"Looper, and that is to further explore the possible consequences of the characters' decisions while at the same time amplifying everything you love about Star Wars, it even brings back some familiar faces. If you've always been fascinated with the force, this movie emphasizes the force all the more. If you miss Carrie Fisher, this movie has heavy dose of general Leia, if light speed gets you stoked, there's plenty of those here, and if you're a big fan of jedi mindtrick, boy does \"Star Wars: the Last Jedi\" have a big motherload surprise for you or what!Such incredible breathtaking new locations as well, especially that vast salt land in Bolivia that serves as the backdrop for the planet Crait. The battle sequences in this film are pulse-pounding, explosive and intense. The light saber fights are thrilling, you just get enough of it, you'll be begging for more, you'll want the film to display more of those laser swords in action. The way the new characters integrate themselves with the stories of Kylo Ren, Finn and Poe Cameron is quite seamless. Whatever conflicts amongst them or their collision only lead to some of this film's most heroic moments which are highlighted by the remarkable sound mix and sound editing. This is a movie that entirely looks and moves and feels and breathes like a Star Wars movie with an Oscar level deeply affecting drama that stays with you long after the end credits roll. The force is strong with \"Star Wars: the Last Jedi.\"-- Rama's Screen --"}, {"score": "5/10", "review": "I am giving this movie 7.4 out of 10 stars but I kind of want to give it 6 out of 10 stars. The film looks great, and OMG the space battles are freaking awesome and.. that is about it. This is a spoiler free review so I'm going to try my best here. The acting is a mixed bag. Some of the actors are brilliant and others are sort of just there; but I'm not sure it is the actor's fault or if the fault belongs to the fact the story doesn't make you care or connect with some of the characters. It is hard to explain without spoiling things. The movie starts out great however the middle drags like a mother thanks to a subplot which is just meh. There are major things that happen, major things that are discovered and I am almost tempted to watch the film again just to see if eliminating the shock factors deflates the film even more when it comes to plot. Here is the thing, I am just going to come out and say it; I think the current trilogy (and extended SW universe) has no direction at all and each film they put out changes based on fan reaction. Say what you want about the prequels, at least they had a strong core story (Episode 1 is weak, Episode 2 is one of the worst films ever made; just so you know I am not a prequel fanboy). These new films feel like they have conveniently gelatinous core elements holding them together which are expendable based on viewer reaction. For example, if fans go completely insane and demand Episode 9 be a romantic French comedy shot in black and white - we are going to get just that. There is no backbone. Story wise this film is a bit of a jellyfish."}, {"score": "8/10", "review": "The middle film in a trilogy is, almost always, a tough one to pull off. Its predecessor gets to introduce characters and ideas and themes; its successor gets to finish off the tale and tie up all the loose ends. Often, this awkward second movie ends up treading water, padding out a story without the benefit of including either its first chapter or its last. For a while (quite a long while), it feels like writer-director Rian Johnson's The Last Jedi has fallen prey to this very syndrome. Fortunately, he pulls it all together in the film's final hour, firing off a series of crackerjack narrative twists that are as surprising, heartfelt and spectacular as anything you'll see in a cinema this year.The Last Jedi opens right where The Force Awakens left off. The First Order remains hellbent on extinguishing the remnants of the Resistance, led by General Leia Organa (Carrie Fisher). Attempts to evade the military forces commandeered by General Hux (Domhnall Gleeson) cause friction among the rebels, as the charmingly impulsive Poe Dameron (Oscar Isaac) clashes with flinty war hero Vice-Admiral Amilyn Holdo (Laura Dern). Meanwhile, Rey (Daisy Ridley) tries to drag the legendary Luke Skywalker (Mark Hamill) out of his self-imposed exile - but finds him broken and bitter following his failure to keep his nephew, Ben Solo a.k.a. Kylo Ren (Adam Driver), from turning to the Dark Side.The first 100 minutes are the strangest - and potentially most offputting - thing about The Last Jedi. For much of its first half, the film feels almost as if it's been stitched together from a handful of very different movies. It may open on an exhilarating intergalactic space opera, but it also dives deep into the shifting moods of an existentialist drama (featuring a 'hall-of-mirrors' sequence straight out of a drug-drenched arthouse flick), before landing smack in the middle of an odd-couple road-trip comedy. That's not to say Johnson doesn't handle this peculiar patchwork fairly well. He unearths moments of heart and heroism as his characters wage war amongst the stars, and he quite effectively plumbs the dark depths of Luke's despair and Rey's desperation to understand her place in the world. There are moments of quiet joy and sensitivity, too, on the mission undertaken by Finn (John Boyega) and Rose (charming newcomer Kelly Marie Tran) that otherwise comes across as a bit of an unnecessary detour. Johnson even keeps proceedings chugging along by infusing the film with a sly humour - courtesy of MVP BB-8 and a flock of adorably annoying Porgs.Nonetheless, the film does suffer, at least initially, from this awkward mish-mash of genres and tones. As Rey follows Luke up yet another mountain, or Finn and Rose bond over a stable full of soulful space horses, it's hard to shake the feeling that The Last Jedi is stuck in a holding pattern - busy and yet slow, overstuffed but also sluggish.Thank goodness, then, that Johnson makes it all come together beautifully as the film enters its masterful third act. Suddenly, as the many disparate story threads spin into one another, the movie roars into heart-stopping, spine-tingling life. Choices and sacrifices are made. Alliances crumble in the face of ambition. Final stands are taken. Goodbyes - hard ones, sad ones, final ones - are said. While it's best not to give much more away (this film's most heart-wrenching twists are experiences unto themselves), suffice it to say that every element of it works. Johnson also draws excellent performances from his cast. Hamill's raw, powerful turn as a man haunted by his failures is easily one of his finest yet. He sells Luke's trepidation and tenderness, hinting at a broken heart that's somehow still whole enough to care. Ridley has settled more confidently into Rey's bones, while Driver continues to add shade and colour to what could easily have been a one-note antagonist. Together, they make the moments their characters share, from the distinctly odd to the unbearably tense, believable.There is, of course, a thread of bittersweet sadness that runs throughout The Last Jedi because it is, by default, the final film starring the deeply missed Fisher as the iconic Leia Organa. It's not quite a fitting farewell to a beloved character - the film leaves little doubt that Leia would have taken centre stage in Episode IX if only it were humanly possible. But, for what it's worth (and it's worth a lot), Fisher lends Leia what she always has: a rich, glorious mix of her own unmistakable strength, light and humour. All in all, The Last Jedi is a remarkable achievement. It may take a while to really get going, but the pay-off for toughing it out through every twist and turn is tremendous. Johnson's film doesn't simply make a compelling case for giving a trilogy's middle installment the benefit of the doubt. As it draws to a close, The Last Jedi also explores and explodes Star Wars mythology in ways both reverential and revolutionary. Simultaneously an ending and a beginning, it's going to be a tough act to follow."}, {"score": "9/10", "review": "Following the Force Awakens which was both a critical and fan hit, Rian Johnson's The Last Jedi had the highest bar to climb, and it manages to go a lot higher than the its predecessor. Rian Johnson's touch has elevated The Star Wars franchise by daring to take risks, and taking our beloved characters to a new level. \nThis is a unique Star Wars film in its story telling aspects, in its humor, and in its style. This will drop as many jaws as I assume The Empire Strikes Back originally did. This is also the most beautiful Star Wars movie to date, with breathtaking Cinematography, Fight Choreography and Visual Effects. But Most importantly, all of these technical aspects are only there to elevate the gripping story and character arcs that Johnson has created. \nThe Last Jedi is absurdly entertaining, gripping, and is also a mind bender. It will trick you, confuse you and ask you questions, only to pay them off and answer them in the most surprising and satisfying way possible. None of the main characters are one sided, as Rian Johnson manages to make you feel empathy for all of its characters, specially the main Villain, Kylo Ren. He remains a strong antagonist who is conflicted, but driven and you could say the same about our hero, Ray. Luke Skywalker is handled masterfully, and that's all I can say about him without going to spoilers. So much happens with him that is surprising, but fitting to his character. Mark Hammill shines bright, but the brightest star is the Late Carrie Fisher, as General Leia. It is difficult not to feel emotional every time you see her on the screen. She plays her iconic character as well as ever, and could not be in a better movie as her last. \nThe Last Jedi has grand emotional gut punches, followed by great action sequences, including my all-time favorite _and for a lack of a better fitting word the most Badass_ scene in the franchise. However just like any film it has its flaws and I can summarize my main problem with the movie in one word: Porgs. These cute birds are only there to be adored and are only there so Disney can sell Toys, which we know brings a surprisingly large amount of revenue to the studio. In Contrast to the Porgs, I loved the cute droid BB_8 because he as so much purpose and he is vital in the story. The story also loses some of its emotional build up in one particular heavy scene towards the end, to throw in a joke which felt forced and unnecessary. Happily these two minor complaints get lost in this fantastic story. This is truly a great film, and you don't have to be a Star Wars fan to love it. Rian Johnson's different vision for this movie, has made me a lot more optimistic about the future of Star Wars, and his original trilogy.\n"}, {"score": "10/10", "review": "This movie, whoa!!! My second favourite movie of this decade sitting just below Andy Muschietti's adaptation of IT released earlier this year. Everything about it was amazing. The director really nailed this movie really well, the acting of the characters especially Rey (Daisy Ridley) and Luke Skywalker (Mark Hamill). They both deserve Oscars for this movie, great job! With saying that, I must also say that it was an emotional film, being Carrie Fisher's final film before she passed away last year, and watching her performance made it really sad because it was so good aswellRest in Peace Carrie:("}, {"score": "8/10", "review": "THE GOOD\nWell that was most certainly a shock! After the phenomenal Force Awakens, The Last Jedi had a lot to live up to, and it most certainly delivered the hype in terms of story, characters and twists. It gave us some excellent development on the existing characters like Finn, Kylo, Leia and Luke, as well as giving a great new character in the form of Rose. The acting is excellent throughout, particularly from the veteran cast members. Looking back, Daisy Ridley as Rey was one of the weaker actors in The Force Awakens, but absolutely bring her A-game in the new film, running the whole range of emotions to incredible effect. As excited as I am for JJ to come back for IX, after this film Rian Johnson deserves to make this new trilogy he's announced.The big worry about this film was the same as the last, being that it was looking too much like other films in the original trilogy which I'm happy to say it most certainly isn't, it's created it's own tight, self-contained story which could quite easily have been the finale. But being the midpoint it leaves a lot of threads open to be resolved in the next film. Without spoiling anything there are three major twists, one of which is going to either excite fans or majorly annoy them. I for one am excited to see the ramifications of that particular twist in Episode IX. It's really difficult for me not to give spoilers, but one minor thing without saying too much is a familiar face comes back and it's one I was really happy to see when things were going downhill for one of the leads. A lovely little surprise!There are a lot of action set-pieces in the film and most of them deliver in terms of excitement, special effects and even some humour. When it came to the quieter moments, talking about the lore of the Force, Rey wanting to find out who she is and the connection between her and another character, the staging and effects reflect that fantastically, bringing a scene very reminiscent of the Mirror of Erised from the film Harry Potter.One of the controversies of the films was Mark Hamill's reaction to where Luke Skywalker, as a character was going, with him disagreeing on a moral level. It's easy to see why he would think that given how the film plays out but given what the character went through with Kylo Ren, I understand the arc Luke goes through and leads to a wonderful climax involving him, harking back to a scene in the very first film.THE BAD\nPorgs....so many porgs...Only joking, I didn't mind the porgs, but there were some moments of humour that really didn't need to happen, including the odd line between Kylo Ren and Rey.A couple of characters who were hyped really don't get their time to shine, one from the previous film and one introduced here. They're not bad but definitely deserved more. It's probably the main problem with the film in that there are so many characters we have to care about and some of them get neglected, particularly in the storyline involving the Resistance on the run from the First Order, which runs far too slow for my liking and is made that way in favour of the thread involving Finn and Rose.There's also a scene with Leia that I'm still not sure what to make of, it's a bit of a weird one.THE VERDICT\nFor this generation's Star Wars it is definitely the most shocking film so far, and an absolutely incredible sequel to the Force Awakens. Do I prefer this film to VII? Not quite, but it's incredibly close. A fantastic film, and a wonderful send off to the late, great Carrie Fisher. We'll miss you Princess."}, {"score": "9/10", "review": "The last jedi has definitely my favorite star wars movie since disney bought lucasfilm. Ep 8 is also the most surprising movie of the saga since empire. It is the funniest one by far, which you would not expect from seeing the trailers. there is definitely some beautiful shots in here that i will definitely consider as my wallpaper. Very beautiful movie, especially the fight scenes and lighsaber scenes.Brilliant work Rian Johnson."}, {"score": "7/10", "review": "\"The Last Jedi\" truly have some awesome scenes to behold, the opening sequence made me feel like a kid again, something \"The Force Awakens\" never managed, because it was just a remade \"A New Hope\" with lack of direction. There is big differences in these two films. And here i will talk about some things i think separates them.The Acting:\nIn TFA it was almost like everyone on set had been running around yelling \"WE ARE MAKING A NEW STAR WARS MOVIE WEEEEEE\". And in the massive confusion and joy, someone forgot that they are making a movie. The Entire TFA felt odd, and it didn't help that it's basically a reboot which made the entire film predictable and boring.But in TLJ someone stepped up and took charge. Because now the actors have suddenly upped the ante and are delivering powerful performances. Carrie Fisher for example, completely different here, more believable, more emotions. Same with Daisey Ridley, she is now showing she's an excellent actress, something that was not shown in TFA, which is a damn shame!. Because she was IMO the best thing about TFA. And Mark Hamill might be delivering the best performance of his life here. Adam Driver as well, he suddenly went from Darth Emo to a really scary and unpredictable villain, showing of a wide specter of emotions. And again, this is stuff that should have been shown already in TFA!So when it comes to acting, TFA and TLJ are miles apart.The story:\nThe story is better in TLJ, by far. But far from perfect, the story itself from where it starts to where it ends up is full of surprises and memorable moments, but it also has a lot of scenes i felt had no place in the film, scenes that either could have been filmed differently, or scrapped all together. Because the film starts off so well, but about 30 minutes in, the story starts to drift, and the suspense and the natural flow get interrupted, which the movie then will suffer for, all the way through.There are times where the story manage to get back on it's feet, but it can't fully recover. Yet still, it has a strong story at it's core, and i must congratulate the staff for bringing the Star Wars universe in this direction, this is new territory and interesting. Or to say it like this, TLJ is something new, TFA was a remake.There are lots of humor in the film, and done more clever than in any Star Wars film before it. This director has a fresh take on Star Wars, and i'm glad Disney trusted in him, Star Wars IMO was in real trouble after TFA, some of it was \"fixed\" with \"Rogue One\" but it was this film that had to really nail it, prove that Star Wars still can deliver, and it almost does, so close.The music is also better than in TFA, John Williams seem to have been more inspired this time around, and has made a score that sounds like the old films, but it also feels new. The effects in the film isn't even worth talking about, it's absolutely amazing of course. And the cinematography is also really good.What dragged the film down a bit for me, was the way the story was told. It became quite boring at times, but for the most part this movie is awesome to watch, with lots of variation in the scenes. It is worth a look. but don't expect a new \"Empire Strikes Back\", we might never see that again I'm afraid. But i do love watching them try.7/10 - Good"}, {"score": "1/10", "review": "Star Wars: The Last Jedi (2017, Rian Johnson)Well this film is a very mixed bag and somewhat a disappointment. After JJ Abrams brought back the magic with a somewhat overly familiar kick off to the new trilogy I had been looking forward to seeing it go in new directions for the next episode. However whilst it did go in some new directions (as well as mirroring previous chapters), I did not like where it went or think it was executed very well.I am not really a fan of the director and this did nothing to change it. The visuals bar the space battles were not memorable, the design of creatures was often poor and going backwards with an over reliance of cgi is such a shame after how good The Force Awakens looked. The humour in the Force Awakens was much mover over the top than we had ever seen before in Star Wars but it still worked but in The Last Jedi it kicks off with Marvel Cinematic Universe style humour that doesn't fit and continued to sprinkle that in throughout. The magic was missing and the beats just felt all wrong for large sections of the film. I did not care for the script but it was the directorial execution that was more uninspired and I am happy that JJ will be back in the directors chair for the last part.There were things I did like though... as in most all of the scenes on the Island with Luke Skywalker and Rey. As mentioned before the space battles looked very slick, especially the opening one. A couple of new characters shone like Rose (Kelly Marie Tran) and DJ (Benicio Del Toro) but some disappointing characters from The Force Awakens were still quite bad like Snoke (Andy Serkis), Captain Phasma (Gwendoline Christie) and Admiral Hux (Domhnall Gleeson). One thing that was a pleasant surprise was the little furry creatures known as Porgs that have caused much debate were actually pretty good and used sparingly.In the end it was a very messy unfocused film that did not wow outside of the space battles with a mixed bag of performances and too much silly humour which should not be confused for charm. A huge disappointment but some seeds are set that could easily be steered into a rousing final chapter in two years time."}, {"score": "7/10", "review": "I think 8.3 is too high, 7 is more adequate! It is too long, it will be better if it's 120 minutes! I think Star Wars is on its way to a dead end, because there's no more story to tell! The Last Jedi is just repeating all the old stories! Snoke has to be the wimpiest dark lord! Mark Hamill is just an old turd. Leia's face looks fake, perhaps its done by CGI?I went to see it with high hope now I want my money back! It is just not good enough!"}, {"score": "8/10", "review": "This film would have been a masterpiece if it weren't for the completely inconsequential adventure we're forced to take with Finn and a girl named Rose. This detour achieves absolutely nothing in the movie: none of the action or story development is of any consequence whatsoever to the larger plot or themes and to add to the tedium of it is that the settings and special effects in these parts are completely amateurish and juvenile. Honestly, they feel like the prequels. Any producer worth his or her salt should have cut that storyline altogether, thus trimming the film back by thirty minutes and letting it be exactly what it is otherwise: a well-paced story with an awful lot of heart and wisdom graced by powerful performances and breathtaking visuals. The Finn and Rose storyline will keep me from seeing this over and over again. That being said, I'll definitely watch it at least twice more in the theater because honestly everything else is pretty much perfect. Ren and Rey, Rey and Luke, Luke and Ren - the scenes in the throne room. Wow! I loved Poe's storyline and the entire chase between the First Order and the Resistance was spot on. But nothing, no nothing, was ever more beautiful than the ultimate showdown of good versus evil. The final 30 minutes of \"The Last Jedi\" are as perfect a piece of film making as it gets.Maybe I'll just purchase a movie editing software and cut out the whole Finn/Rose adventure altogether. Then I could enjoy over and over again a 2 hour masterpiece instead of a great, but flawed, 2.5 hour epic. Truly, and unfortunately, none of Finn's storyline would be missed in this otherwise flawless film.8.5/10"}, {"score": "5/10", "review": "First I'm gonna say I honestly don't really like the dynamic of the first 1/3 portion of the movie. It kinda out of place. Maybe I have to watch again to REALLY see what happened. But from the very beginning the visual and the soundtrack are amazing, it kinda sold me to watch the rest of the movie. Those two components are consistent throughout the ending, making it more epic.I love Carrie Fisher in this movie, she portrays Leia exactly like what I've always think of Leia. Strong and funny. For Luke, I felt weird seeing him, after years in exile, suddenly likes to throw some jokes here and there. It's like seeing Mark Hamill, not Luke Skywalker, but that's not that big of a deal. I still love how Mark put his emotions in his act. Adam Driver is perfect in this, his acting is top notch, they developed Kylo Ren perfectly and we can really understand Kylo Ren more from watching The Last Jedi. Now the twists are surprisingly good. At first I'm afraid it will be just another OG Star Wars, (like The Force Awakens). Johnson didn't play safe and put something new for Star Wars fans to process and develop another crazy theory. I'm looking forward to know another unsolved mysteries in 2019 Star Wars."}, {"score": "10/10", "review": "I will keep this review spoiler free but from start to finish the movie keeps you guessing. Characters still relatively new to the Star Wars franchise become really something in this movie. If any doubts were had as to where this trilogy was headed all doubts are gone.Now I wouldn't say its as good as Empire but its still very up there in terms of Star Wars movies. The action was great right from the start with some of the greatest space combat this series has ever had.The movie takes some very interesting twist and turns and leaves you wanting more. Mark Hamill's return to the franchise for more than just an ending scene was great as well. Every scene he had was very memorable.Many of us grew up with the original trilogy and have carried it with us and always watched it throughout our lives and held it in the highest regard. This new trilogy is so far brilliant for bringing new people into the franchise and a great trilogy for a new generation.I would easily give it 10/10 being one of the most enjoyable experiences ive had with a movie in years and look forward to many future watches.My movie experience with this was amazing and im sure yours will be too so if you haven't seen it already, you are missing out. Take the time and watch the movie, you definitely won't regret it."}, {"score": "9/10", "review": "What can I say? I was totally satisfied with the movie. It was exciting to see everything throughout the movie. From the start of first 15 minutes it already was very intense. Apart from some slower pace drama combined with brief action here and there, the rest of the movie was totally awesome. From the middle till the end, it was almost constantly full of action, but not the kind that was making you strapped to your seat, but more like a \"cannot wait to see the next thing that would happen\" kind of actions.Despite not having a jaw dropping surprising twist like in Star Wars: Force Awakens this movie still has some surprises. And that climax? OMG, that was one of the best climax I have ever seen in a movie. Definitely worth the wait. My most favorite thing about this one was the fact that the movie was quite loyal to the original Star Wars movies. In fact I felt there were some similarities with The Empire Strikes Back, especially with the appearance of a surprise character.This time, I got to say that I like the new characters of this trilogy. I love the characters of Finn, Rey, Poe and I loved the new droid BB8 whom I think was very refreshing. I even like/hate Kylo Ren's character. Oh and the new characters in this episode, i.e Rose and Vice Admiral Holdo were remarkable. The special effects by Industrial Light Magic as usual never failed. Those space war scenes and the final scenes were amazing. However, I am a bit disappointed with the creatures effects. I do not know why but those cute creatures in that island seemed unreal and looked really robotic and some of the aliens species did not seemed believable which was quite a let down from the previous Star Wars movies. The musical effect was done nicely and really felt they were made for this movie. The sound effects were good but oddly not spectacular. There were some funny moments that would make us laugh and there were few touching moments before the end.\nThere was no end credit scene to this movie just like in all other Star Wars movie. It did give you the nostalgic feeling of listening to that special Star Wars music. And there was a brief lovely tribute to the late Carrie Fisher (some of the audience also clapped their hands when they saw this part).Overall, I personally felt that this Star Wars movie was awesome. Though not the most perfect movie, but it is certainly up there. And I really really REALLY cannot wait to see the final episode of this trilogy. I truly recommend all of you who love Star Wars to see this one in the theater as soon as you can. For my complete review, pls have a look at michaelnontonmulu.blogspot.co.id"}, {"score": "3/10", "review": "I first need to state that as a Star Wars Fan I'm thrilled to witness all those new sequels,\nfor instance I didn't praise The Force Awakens however I thought back then that rebooting such an old franchise is a hard task, I really enjoyed Rogue One which I'm thinking is maybe one of the best Star Wars movie ever even compared to the first trilogy.So I've been watching this morning and my words can't describe how much of a letdown I think this movie is.The movie is riddled with pranks, bad humour, making fun of the Star Wars universe in a bad way, I usually like humour but here it's not subtle enough.There are lots of realism issues, for instance people surviving in space with no gear, a single stupidly modded X-Wing taking down a Capital ship, I know Star Wars is a fantasy but this is too much.I feel like the new characters are out of place, I don't get them, moreover, they evolve too quickly, adding to the realism issue.Some creatures, items unveiled into this movie don't add any value to it, they're here just to sell more merchandising itemsThe villains on the dark side are ridiculous, a boy and a creature that could play in one of Disney movies, they really don't compare to Vador nor PalpatineParts of the Story don't make any sense, how come Snoke fleet couldn't keep up with resistance fleet rusty ships?? they chased them for like 8 hours, seriously??Moreover it's still recycled from previous Star Wars Movies.Ship design is not on par with the previous movies."}, {"score": "9/10", "review": "The Last Jedi buids on all that made TFA great and does away with the bits of it that weren't so great. It manages to upset many expectations in a good way, and pays homage to Empire and ROTJ.Negative reviews: \"As if a barely trained girl could use the force against Kylo Ren\" etc, etc, etc, other plot holes, implausibilities.Yet the same people have no problem with: \nA New Hope: \"Of course Luke, the farm boy, could expertly fly an X-wing with no training and the rebels who he's just met would let him lead the mission against the Death Star\".Return of the Jedi: \"Sure, four foot furball creatures throw rocks and shoot small stick arrows at armoured professional soldiers and kill them.\"The Phantom Menace: \"Sure, the Jedi tacitly condone slavery and cut a deal where a 6 year old has to win a high speed equivalent to F1 race to earn his freedom\". And so on for every aspect of every Star Wars movie.It's all made up fantasy BS with glaring inconsistencies, since 1977. This movie is no different. Let it go and just enjoy it for what it is, a swashbuckling sci fi/ fantasy space adventure. Go an watch The Martian if you want some hard sci-fi. (Also, love the number of negative reviews about strong female leads - says more about the reviewer's insecurities than the movie.)"}, {"score": "10/10", "review": "To be honest, I only watch the trailer once because I'm afraid to put so much expectation and it fails me like TFA. But hey, it's beyond EPIC!The movie has an emotional and breathtaking plot. It's like I'm riding a roller coaster and the suspense is so damn real. It's unfortunate that I can't explain the plot details because of its epicness and of course, it will ruin your movie experience.The stars? Oh my God. The charisma between Mark Hamill and Carrie Fisher is gold. They succeed to hypnotize me for bringing the good old memories. Don't forget to mention Daisy Ridley, Adam Driver, John Boyega, Oscar Isaac, The Collector of MCU, and the woman in Jurassic Park. But, among them, Adam Driver has a great character development as Kylo. Totally better than the previous one.The lightsaber choreography, the fighter battle, and CAPTAIN PHASMA totally freaked me out in the movie. Oh God, the movie is good in so many levels. The movie is near perfect. Is it right if I say this movie can replace ESB as the best sequel in SW franchise? Maybe yes. 10/10"}, {"score": "4/10", "review": "Somewhat disjointed. There are some good parts, but it was a bit \"try hard\" on how many items/characters they could interject from the earlier movies that mostly seemed out of place. Most of the humour was lame. Have not been this disappointed in a Star Wars movie since Jaja Binks took some of my life that I will never get back."}, {"score": "3/10", "review": "I was incredibly disappointed with Stars Wars: The Last Jedi (TLJ). I cannot believe some people are saying this is the best one since Empire, bcoz it's not even close. There are so many problems with the movie; the writing, the poor structure, the lack of innovation and focus.But first, I'll start with the positives. I think Daisy Ridley and Mark Hamill gave a wonderful and committed performance to their roles, despite qualms I have about the material they've been given. Daisy in particular really shines throughout; she has great screen-presence and is very enigmatic. Secondly, I was surprised by the abundance of humor in the movie. I really enjoyed the comedy and found all the jokes really funny and organic to the story in a way that never feels out of place. Also, the Porgs were kinda cute. Lastly, I thought there were two great action set pieces that really elevated the film above TFA & RO. The opening space battle was quite amazing and well-done. The dogfights and ship battles were very thrilling and suspenseful. Then there's a lightsaber fight towards the end that was just spectacular and could rank as one of the best set pieces in a Star Wars movie. It was also one of the most beautifully shot scenes in the movie, with really impressive lighting, wide angles and long takes to really highlight the complex but excellent choreography.Now the negatives. Overall, I found the movie to be incredibly messy and badly paced. The story is incredibly boring and feel like they're threading the same ground as the original. There were many plot lines that felt lifted whole cloth from Empire and Return of the Jedi, and when they happened I was like \"Are we really doing this again?\" It quickly becomes evident that these movies feel like The Hobbit to the Star Wars franchise - in that, there's not enough material to warrant a new trilogy. TLJ never feels like the 2nd book of a trilogy. It feels more like the 2nd act of an incomplete story. Like TFA, this movie will leave you incredibly dissatisfied. Entire subplots were invented for our main characters, only for the outcome to yield absolutely no results. There were also way too many new characters introduced in the movie, all of whom took significant screen time away from characters that we already know. A character is introduced and is given the kind of epic send-off that should have been given to an established character we know and love, but bcoz we don't know this new character, that send-off lacks any impact. Also, too much time was spent on the island with Rey and Luke and nothing was accomplished. Rey's talents also remains largely unexplained.My biggest issue with the movie however is the depiction of Luke Skywalker. Prior to this, I had read that Mark Hamill was really unhappy with Rian Johnson's direction for his character, and it's true. The Luke Skywalker in this movie IS NOT THE LUKE SKYWALKER WE KNOW & LOVE. Many of Luke's actions seem very out-of-character and contradicts everything that George Lucas had established about him in the originals. There is one particularly egregious act that Luke commits that feels like an absolute betrayal to that character. It undermines all the goodwill of Luke's arc in the originals that Lucas worked so hard to build-up and complete. Also, they seemingly established Luke as the main character and give him the same hero's journey as ROTJ again, only for him to be missing for 45 mins in the movie. And boy, do they really abused the classic John Williams Luke theme in this. You won't go for 5 mins without hearing his theme over and over again.So overall, I did not enjoy watching TLJ. You're probably going to watch it once bcoz it's a Star Wars movie but trust me, there won't be any repeat viewings on this one, bcoz it lacks substance. My theatre audience was silent for the entire movie, saved for a few laughs at jokes that were effective, but there were at least 3 fan service/ shocking moments that should have elicited a response from the crowd, but everyone was dead quiet. You know the movie is incredibly ineffective when even the things fans want to see lands like a thud.So I'm giving it a 3 out of 10; two points for that amazing 3rd act lightsaber battle, and 1 point for both Mark and Daisy. For those who are seeking a true sci-fi action adventure experience, I recommend watching Luc Besson's Valerian (2017) instead. That movie is bursting with creativity and feels like it's blazing a new path for the sci-fi genre that these new Star Wars movies should be doing but aren't. Most importantly, that movie feels fresh and innovative, two things that TLJ were seriously lacking."}, {"score": "1/10", "review": "Well, this is the end of Star Wars for me. I will never pay to see another one of Disney's movies. They have done the impossible...and killed my childhoodGeorge Lucas is probably kicking himself for selling the franchise knowing now that Disney has ruined it for alot of people.My suggestion? Just pretend all the other Star Wars movies, besides the originals and prequels, do not exist and never watch another one til the cash grab that is Disney sells the rights to Star Wars.I will now go home, curl up in a ball, and watch the originals and try to forget this horrible film"}, {"score": "3/10", "review": "I got the chance to see it last night at the European premiere.It was a great night (and my first premiere) but it certainly didn't offer me any real emotional satisfaction. Yes, it was entertaining, there were some moments when I gasped out loud at how cool something was or clapped at an action that a character did yet it did feel a little baggy in the middle.There was some rather heavy handed virtue signalling within it where you just felt the creep of being educated/lectured to rather than being entertained. There were also a couple of scenes where the credibility of characters abilities were a little strained.As I said it had some memorable moments but for me it wasn't as mesmerising and raw as Empire or as rewarding as Return."}, {"score": "8/10", "review": "The visual aspects of the film are stunning, the use of colour, beautiful landscapes, and gorgeous lighting, for me, the best looking Star Wars film to date, really adding to the spectacle, I cannot stress enough that you must watch this on the big screen. It fills you with nostalgia and immerses you into the universe againThe film once again introduced us to some new characters locations and animals, some of which are a direct scheme to sell some more merchandise and toys, but luckily that does not spoil these creatures at all. The only critique on the additions is the new character, Rose, who provides us with some rather 'cheesy' acting and moments, but other than the acting, she added nicely to the narrative, further increasing some character arcs. The only other critique to the film I have is I found the battle sequences quite repetitive, where we would see one side get battered, until there was little hope, then bang! Hope is restored by an emerging saviour.The acting overall was really good, Mark Hamill as Luke Skywalker, was excellent, and Carrie Fisher was beautiful. Daisy Ridley as Rey performed her demanding role very well, much better than her previous Star Wars film in my opinion."}, {"score": "5/10", "review": "First of all, these are my own opinions.I watched whole saga more than six times except rogue one and the force awakens.If I disappoint you I'm truly sorry.The film was totally disappointing and it's waste of time.It's not what I expected.I thought they take lessons from The Force Awakens disaster, but it's worse than The Force Awakens.While I was watching the film I was extremely bored.Nothing was exciting.In almost every movie there was a feeling that is connect you to film, but in this film there was non.The only thing they've done is earning money with the title.But the real thing what they've done is humiliate the film.The film is losing their legendary and the value.I think the solution is not continue to this.Stop making films over the saga.You should've start making solo movies.I mean like Life of Obi Wan or else.With that you ain't ruin the scenario and maybe you can fit it with scenario like rouge one by the way in the last three movies so far, the best one is rogue one.Even the solo movies are may complete the missing parts of saga.Believe it or not it was most effective way.Well, these are my opinions like I said it in the beginning,I hope I don't disappoint you.Wheter I like it or not I'll probably go to the next episode.I hope it'll better than the others."}, {"score": "7/10", "review": "I want to start with saying The Force Awakens was not just the worst Star Wars movie I have ever seen. It is the worst movie I have ever seen in my whole life. So some of you may have bad expectations from this movie because of the first movie of this trilogy. Don't be afraid, it is not going to be a waste of your money or your time. It is definitely worth to see!\nDuring the movie, some of the characters has their own conflicts. We see that it is not that easy to be the bad or the good. Making a choice between two sides is never really easy. I think this is one of the things that makes us human. I loved to see this conflict inside the characters during the movie. \nThe story is above the avarage. I don't think this is the best Star Wars story or movie but The Last Jedi has a different style. You will be shocked in some scenes. This movie made me feel very excited for the final episode of this trilogy. \nThe Last Jedi is way better than The Force Awakens and you really need to see this movie. You won't be disappointed. Star Wars is back!"}]