[{"score": "9/10", "review": "Acting: 10/10. Surprised?Action: 10/10. Are you really!?Comedy: 9/10, taika waititi hit my funnybone in many scenes, but sometimes missed in some key moments in the story. I still laughed my ass offCamera-work/cinematography: wow... a few mindblowing shots and a lot of kirby inspired set pieces that put me right back in 1991 reading my comics like a supernerd i wasStory: 9/10 The First and the last act are both so so exciting that the second act lacks the speed the first and last were going on. Im not used to that nowadays where the third act always slows down the film. It is a cool change up. It does tie in to infinity war, you whiney nerds. they actually listen to your dopey wishes. the post credit scene will bblow your damn mind and make you jizz your pants.all in all, go see it opening nights because it has LOADS of sppoilers for future stuff. you'll love it. in the conversation for best marvel films for sure. even superhero films."}, {"score": "10/10", "review": "I know some people are worried about the humour on this movie.But they used it excellently in this flick.This movie to me,is at least on the same level with Guardians of the Galaxy 1.I mean both guardians and Thor 3 made me laugh but never felt cringe or sensed any forced jokes.There were also very intense and emotional moments in this Thor movie.The fight sequences were so damn epic.When it comes to action,this movie is close to Lord of the Rings 2.They did a good job on reflecting the epicness of the Ragnarok event. The last trailer of the movie got my attention.And I made one of the best decisions of my life by watching it.Hela,Valkyrie,Hulk,Thor,Loki,Grandmaster they all did pretty good job.Especially Hela.She was so gorgeous and menacing at the same time. Tessa Thompson kinda surprised me with her great performance btw."}, {"score": "10/10", "review": "First of all I wanna say,Hela is amazing.Best villain I ve ever seen since the Joker(Of course not the God awful joker from s.squad.The joker from dark knight)Action scenes were so incredible.Fenrir,Surtur,Hela,Sakaar,Hulk,Thor, Gladiator-battle arena,demolition of Asgard etc..so damn epic.I am glad they put comedy on this last Thor movie cause the Thor 1 and 2 were all serious movies,especially Thor was a serious character.This didn't work out so they tried to make a funnier,more entertaining movie.In my opinion it was a great move.Cause there were so many emotional moments and deaths in this movie.Btw,be ready for very surprising deaths and cameos.I didn't mind the comedy cause they put all the jokes in right places.Just like they did in Guardians of the Galaxy,Ant man and FOX did in Deadpool.Also I am not allergic to comedy or having fun if they make it right.I am not one of those moody,goth/emo,depressing people with boring,dull life.I am very satisfied with this movie.Now it is time for JUSTICE LEAGUE.I really hope that movie will be great too. I liked WONDER WOMAN a lot,hope J.L will be as good as that."}, {"score": "10/10", "review": "This movie really exceeded my expectation.For me it is already the second best comic book movie,right after Logan.When I ve watched the both of the trailers,I ve thought Thor 3 has the best trailer in this genre so far.Trailers really met with my expectations.You are gonna see epic showdowns just like the way you imagined.Glad they didn't go on serious,boring mode like they did in Thor 2.Cause that movie bored me to death just like man of steel did.Lastly,I just wanna say that Taika Watiti is pretty damn good director who can make both good stories/plots and brilliant jokes/references(just like deadpool's humor).Thanks again for all the joy you gave me Marvel."}, {"score": "1/10", "review": "Starting from the basics.What does the title mean?From Wikipedia: In Norse mythology, Ragnarök is a series of future events, including a great battle, foretold to ultimately result in the death of a number of major figures (including the gods Odin, Thor, Týr, Freyr, Heimdallr, and Loki), the occurrence of various natural disasters, and the subsequent submersion of the world in water. the fact that our film and characters are quite literally the same as those mentioned in the Norse mythology one would hope to see such cataclysmic disasters of monumental proportions on screen from \"The House of idea\" right? WRONG!! Well our characters have either gone fully insane or the performers were bound by contracts and buried under the pile of of cash that they didn't tried to borrow or adapt anything remotely from the source and that spelled Ragnarok (ironic in this case) for the film. The performances are trite and pathetic except for Hemsworth who showcases his natural talent of comic relief. He has proved time and again that he has the talent for what it takes to be a powerhouse and his boastful resume speaks of Rush,Thor, In the Heart of Sea, etc. But sadly the \"GOD of Thunder\" has been reduced to a self aware parody that only leads to ennui for the audience.This feels more like what the \"GOD of blunder\" would do.Mind you, this film is mostly targeted for children and teenage audience so humor, colorful C.G.I scenery which are glaringly obvious and plainly distracting in some cases in the film and retro infused soundtracks are enough on the platter to cater to them. Hulk's character is forced in the film as he doesn't feel natural midst all the chaos. Even his motion capture looks cheap as low budget corny effects.his struggling with his humanity and monstrosity sides has been sidelined and likely won't be addressed further as his presence in ANY film is just to have a bruiser to smash.Tessa Thompson's Valkyrie looks NOTHING like her comic counterpart since she should have been a tall musclebound warrior with sinewy physique not some glamour model walking the catwalk cos-playing her new Walmart sale. ODIN the all-father, one of the most powerful characters is conveniently sidestepped so as to circumvent his true potential like taking head on with Galactus the \"Devourer of Worlds\", taking a full on brunt from Silver surfer and Thanos and acting like nothing ever happened. But sadly Anthony Hopkins looks tired and bored to continue and even expressed disappointment regarding this very fact not once but twice!!Then why bother casting him in the first place??All in all a \"seen it all before\" repeating formulaic garbage from MCU. i don't understand how the director said in the first place this will be darker than all previous THOR movies. did i mention Karl urban was in it? Yes he was as forgettable as his character was that of a mindless grunt henchmen of Hela. No personality or development just boom boom pow."}, {"score": "10/10", "review": "I don't know what s wrong with some people.This movie had nothing against Europeans or Europe culture/history.Cause if it had,then this wouldn't be approved by European critics.Anyway,this movie and the Logan are the grand jewels of comic book movies of this year.Logan was deep,emotional,brutal with intriguing story.Thor is pure epicness,filled with action and the comedy side fits perfectly to tone of the movie.From the trailer I thought Guardians of the Galaxy will have lots of cringe jokes and cheesy moments but they used the comedy perfectly.Same can be said for Thor 3 too.They managed to have an impact on the audience with sentimental stuffs,at the same time they made us laugh in right places. This movie has already gotten itself carved to my memory.A memorable movie for me.Just like dark knight,Logan and guardians of the galaxy 1."}, {"score": "10/10", "review": "Ragnarok is a neon-infused fantasy of what superhero films could look like. There are gigantic monsters and beautiful women; zombie armies and a big spooky dog; an evil witch and Jeff Goldblum, but this isn't just a wacky movie made for the sake of wackiness. Ragnarok is the child of confident filmmaking and understanding of what the Thor franchise could have always been.It takes a character that could have always been more and makes good on that promise through competent storytelling and unbridled enthusiasm for the world. This is exactly how we should be rewarded for their fandom. There has never been a clearer example of throwing the entire kitchen sink at a single title and having every single washer and lug-nut of that porcelain mechanism land in perfect order than Ragnarok."}, {"score": "10/10", "review": "Let's get rid of this \"\"Aw,but the Ragnarok event in mythology has great battles, foretold to ultimately result in the death of a number of major figures (including the gods Odin, Thor, Týr, Freyr, Heimdallr, and Loki), the occurrence of various natural disasters\"\" nonsense.Cause these movies don't have to stick to the myth or comic books,100%.They should make changes for the sake of the movie.For instance,in NORSE MYTH,fenrir(the giant dog) is the son of Loki and hela is also the child of Loki. Now tell me how the hell Marvel is gonna show us Hela and Fenrir as Loki's children??Loki is already a well established and grounded character.At this point,I don't think any director/writer could change Loki's past and introduce Fenrir and Hela,as Loki's kids cause this would also bring tons of questions,plot holes and flaws.For the sake of MCU continuity,Marvel HAD TO make changes in the Norse Myth and in the comics.The performances of the main cast are impressive and exceptional.This movie also showed us the real \"God of Thunder\".For the first time he was extremely powerful without his hammer.That lighting streaming all over his body was pure awesomeness.This movie is mostly targeted for everybody except for joyless,moody,edgy people who are allergic to have fun and have a boring,dull life. The CGI,fight scenes,epic battles,monsters etc..kinda remind me LOTR.Also,when I ve read the first reviews of this,some critics were praising the soundtracks too.Wow..they were completely right this movie's soundtrack list is on the same level with GotG 1 which was perfect.They finally gave hulk a personality.Even though he looks all big,formidable and scary,he was kinda adorable every time he talks:).So glad they finally made him talk.They really improved his CGI.The best version of Hulk in MCU.The haircut made him better too.Tessa Thompson surprised me with her performance.I still hear some people complaining about the color of her skin.Cause she doesn't look like Valkyrie in myth.Well,she doesn't have to actually.All I care about is,her performance.And she did really good.So put another major hit on MCU.They did it again.We have another MCU movie approved by critics and audiences.They have successful track record since 2008.Unlike some people's petty,shallow claims,I don't think marvel is always using the same formula again and again since 2008.Cause if they fallowed that path since 2008,people wouldn't watch their movies for the past 9 years.And they definitely couldn't create the highest-grossing franchise of the planet without their major players like Fantastic 4,X-men and Spider man."}, {"score": "10/10", "review": "\"Fun\" isn't a dirty word. It's also not a word that means \"not art\" or \"lacking drama.\" And the word \"funny\" likewise doesn't negate artistic integrity or drama. Anyone who thinks these words are contrary to great filmmaking or \"true art\" simply doesn't know what they're talking about, and should probably stop trying to discuss cinema. Humor, comedy, and satire not only have a long and glorious history in art and expression, they are in fact very hard to do correctly. Writing comedy and directing comedy is every bit as difficult, if not more so, than straightforward drama in many ways. And to whatever extent fun and comedy in films can also serve to purely entertain sometimes and to add levity to situations, that's not bad nor limiting of art either.It speaks to the absurdity of modern film debate and fandom that I even need to point out such glaringly obvious, fundamental truths about storytelling, movies, and art. But such is the nature of rabid, narrow personal preference driven by bizarre loyalty to one publishing corporation over another. Fandom is always -- generally speaking -- turning everything into \"us versus them,\" but the extent to which it's devolved into outrageously uninformed and limited claims of what is or isn't \"art,\" is a newer development and a sign of the shallowness of so much of our modern discussion of cinema when it comes to genre storytelling.Thor: Ragnarok is fun, and it's also funny. It is also dramatic, it is also terrific art, it is also the best Thor movie by a wide margin, and it is one of the best Marvel sequels released so far.If those statements or words bug you, then get over it and grow up"}, {"score": "10/10", "review": "Thor: Ragnarok plunges headfirst into unbridled comedy and Waititi gives his actors ample room to showcase their natural comedic talents, especially Hemsworth and Blanchett, who are rarely seen having so much fun. Jeff Goldblum, Karl Urban, and Ruffalo also shine, and Tessa Thompson steals scenes as Valkyrie, a hard-drinking Asgardian bounty hunter and former member of Odin's elite guard. Overall, the film benefits from its director's distinct style and measured irreverence, giving Thor a welcome boost of vitality."}, {"score": "9/10", "review": "Another win for Marvel. Phase three shows no signs of slowing down. The movies itself is a great stand alone film, but also does its part for the wider MCU. Thor has evolved from the serious, god-like character we knew after spending some years on Earth. His new found humor fits well without throwing away the development that has occurs in previous appearances. The dynamic between Thor and Loki continues to flourish; the latter remains a key factor into the franchise success. Hulk/Banner gets enough screen time to warrant a spot in the title. No one will ever tire of seeing Hulk smash on a scale as large as this. Stand out performance from Valkyrie. Excellent portrayal of a lesser-known character that shall no longer be lesser-known. Grandmaster goes full Goldblum. That should be enough to sell you on that character. Hela does not fit the mold of weak antagonist roles from past Marvel movies. Too powerful to disregard with motives to back her actions. Epic actions scenes on a larger than life scale. Worth a watch in IMAX. Some overuse of comedy but it's what you come to expect from a blockbuster appealing to the masses. Not once does it distract you from the threat at hand. A nice set up for Infinity War without seeming like a prequel. 9/10."}, {"score": "10/10", "review": "Really enjoyed the first 'Thor' and loved even more its bigger, darker and bolder follow-up 'Thor: The Dark World'. 'Thor: Ragnarok' manages to be the best of the three, and is not just a strong contender for the funniest Marvel Cinematic Universe film (yes even more so than the 'Guardians of the Galaxy' films) but also one of their best to date.As said in my review for 'The Death of Stalin', 2017 has been very hit and miss for films, the best ones being wonderful (I.e. 'God's Own Country', 'The Farthest', 'The Death of Stalin', 'Blade Runner 2049', 'Wind River', 'IT', 'The LEGO Batman Movie') and the worst ones being dreadful (i.e. 'Baywatch', 'The Snowman', 'The Emoji Movie', 'Stratton', 'Flatliners', 'The Mummy', 'Transformers: The Last Knight'). 'Thor: Ragnarok' is to me up there with the year's best. Would even go as far to say that it's one of the best and most entertaining \"superhero\" films so far, whether in Marvel, DCU or anywhere.On a visual level, 'Thor: Ragnarok' is the best-looking of the three 'Thor' films and of Marvel in general. Asgard looks colourful and atmospheric. The photography and editing are stylish and the locations are stunningly vivid. The special effects and stunts are not just dazzling and have substance and purpose rather than just being thrown in for the sake of it, they are among the best of any Marvel film. Just for the record, Marvel get a lot of hate, particularly in the ridiculous and blown completely out of proportion DCU vs Marvel war, have personally enjoyed a lot many of their efforts. The music pulsates thrillingly and is also catchy and rich in atmosphere and emotion.'Thor: Ragnarok', as said, is a contender for Marvel's funniest film. The dialogue crackles in wit and deadpan deliciousness, and absolutely loved Thor's quips and the clever in-jokes (Loki's horrified reaction at coming face to face with Hulk was a standout). They are all placed adeptly, placement is never questionable.It's not just about the humour that makes 'Thor: Ragnarok' so great though. Like 'Thor: The Dark World' in particular of the previous two films, the action is absolutely thrilling and breath-taking in spectacle (almost 'The Lord of the Rings'-like in scale). There is plenty of bold dark-natured tension and the emotional moments give the film a lot of heart and are genuinely moving.Taika Waititi balances humour, action and drama with ease and it shows in the compelling and tightly structured and paced story. The characters are even more expansive in development, both intrigue and entertain and their well fleshed out personalities make them easy to care for them. Thor and Loki are beautifully realised characters while Hulk is the most interesting he's been in a long time. Hela is not just the best non-Loki 'Thor' villain (so much better than the one-dimensional and underwritten villain of 'The Dark World) but also one of the best villains in the Marvel canon, not just posing a threat, interesting in personality and having a motivation that nobody will scoff at but she is also one of few Marvel villains to actually have an arc. Korg (with Waititi writing himself in to portray) is a bit random but is a lot of fun.Chris Hemsworth is at his most relaxed and charismatic, while Tom Hiddleston is terrific as Loki and pitches his mellifluousness and serpentine-like malevolence perfectly. Anthony Hopkins continues to bring welcome gravitas to Odin and doesn't ham up. Cate Blanchett relishes the character of Hela, and makes her a character that's menacing, entertaining and oddly rootable.Mark Ruffalo is a strong presence as Hulk, Benedict Cumberbatch brings everything that was good about his Dr Strange in the first place and Jeff Goldblum is suitably playful. Karl Urban comes off least but does his best with the relatively little he has (which to me was nowhere near distracting enough to bring the film down).Overall, a brilliant film with Thor and Marvel being at the top of their game. 10/10 Bethany Cox"}, {"score": "9/10", "review": "This movie shows something I've never seen in MCU. It's amazing for its plot setting, pace, visual effect, music etc. They are telling the story right, and making it hilarious and exhilarating. Every role is developed and paid adequate amount of attention. So glad to see that Hulk was finally given more personality. I also liked the female characters in this one, both very bad ass fighters, no unnecessary romantic entanglement as the previous works. (I mean, it's not about Jane herself, she's fine, but was written in a way that doesn't really fit in or helpful to the plot.)btw I watched it in BFI IMAX. It was such an experience! Would highly recommend 3D or IMAX for it's visual effects."}, {"score": "10/10", "review": "My God..what is going on in Marvel Studios HQ.They really improved themselves in CGI and in color palette.By the way,I am glad they moved the place of \"hammer destruction\" scene from city to field.Cause in the first trailer it came to my attention that while hela was destroying the hammer the blast that came from it didn't effect the alley at all.Now it made more sense that they are doing in a field. The concept is one of the best you can see in superhero movies.They balanced the humor and seriousness perfectly.There were also brutal moments which will surprise you.Especially the 3rd act is pretty brutal.I heard the laughter of audience almost on every funny moment of the movie. I never thought a Thor movie would have an awesome soundtrack.I can tell that it really gives you the Guardians of the Galaxy 1 vibes. So in general,the movie is one of its kind in this genre and very unique."}, {"score": "9/10", "review": "I have to admit this blew me away , I wasn't expecting to enjoy it but this was a really funny enjoyable piece of entertainment. Definitely worth seeing . This is not my genre but this will appeal to those who love films like the LOTR trilogy as well as those who love the humour in Guardians of the Galaxy . Jeff Glodblum stood out as Grandmaster. As well as the Stone revolutionary South African gladiator . Kate Blanchet was superb , there was even a small cameo role for Scarlet Johansen completing the Avengers assemble . As a complete novice to the genre and knowing very little about the franchise - it came across as a mix of Sci Fi ( of the Star Wars ilk ) mixed with myth and fantasy tied together by an excellent script and great comic lines .Chris Hemsworth and Tom Hiddleson were great as was the Hulk / Banner and Valkyrie . The only let down was Anthony Hopkins - his performance was below par for such an excellent actor . Plenty of action and CGI for those who like their cinematic fix .It's a film I'd definitely see again maybe in 3D or in the reclining seats :) Pad.A 9/10"}, {"score": "7/10", "review": "So I saw Thor Ragnarok last night. I have given it 7/10 Pros: .Funnier than most marvel films .Amazing visuals .Thor being amazing .Fantastic fight scenes .More hulk .threat seemed more real (unlike civil war and homecoming)Cons: .Too many reminders of guardians of the galaxy like the music and planet scenery .Too much forced humour which didn't need to be thereIt was very enjoyable overall But I miss marvel movies like winter soldier and ones going back before the avengers as none relied on humour."}, {"score": "8/10", "review": "Three Thor movies, three quite different films. On this occasion, after the much lauded success of other films in the franchise like Guardians and Deadpool. (Which I love.) It is easy to see why they would choose to duplicate the comedic style.This is my favourite of the three Thor films by a clear margin. I was chuckling quite regularly from the very first scene. However I did think are they taking the balance of comedy and drama a bit too far at times. Often you feel yourself hanging on waiting to see if there is a punchline coming even in the more dramatic moments. Even when the bodies are piling up. (The Sokovia Accords have no jurisdiction in the wider universe.) For the most part the directors approach of encouraging improvisation does appear to work very well. But sometimes it does feel like there is a real lack of the \"straight man\" to add structure to the chain gun of gags.On the whole I enjoyed Thor Ragnarok. It falls into the top five of my fav Marvel movies."}, {"score": "8/10", "review": "Thor Ragnarok leaves the bland formula from it's first two films for an exciting and self-aware redemption story, traversing through the trash heap planet Sakaar and an Asgard under siege. Sakaar was my favorite setting out of any recent Marvel films, with Jeff Goldblum giving a hilarious performance as a playful dictator and the arena-centric atmosphere providing an intriguing set piece. Blanchett plays the best villain of the Thor trilogy, Elba's character is essentially Aragon from LOTR, and Tessa Thompson and Marc Ruffalo/Hulk are respectively well- motiaved and solid comic relief."}, {"score": "6/10", "review": "I'm not a big fan of superhero films. They take themselves too seriously; and when they don't, everyone watching them takes them too seriously. I only went to see this film because my friend wanted to see it, and he wouldn't let me re-watch BR:2049 with him (which I've reviewed, quite negatively, but I'm willing to give a second watch).Thor: Ragnarok is a very likable film. The action is surprisingly fun: the fight scenes have engaging editing, which is a big step up from whatever was going on in the Avengers, five years ago. There are some imperfect editing choices, but the film's exciting nonetheless The fight with the Hulk was pretty damn brilliant.In fact, that's the best thing about this film: it's not the Avengers. It's Thor and his buddies going on an adventure, and I like that. It's not all like, \"ooh it's me Mr. McPantherman Mysterion Superdude the third, I'm interesting.\" There are some cameos from other Marvel characters, and stuff like that, but you don't have to see their respective films to find their cameos entertaining. I didn't.Yes, the plot probably doesn't make a lot of sense when you think about it, but these films are about bloody big green people fighting lightning bois. They are clearly not meant to be thought about too hard, and I have nothing against that. There was only one time I found myself asking \"seriously?\" and that was when Thor made this big, spoilerific decision that could've been solved with Hulk.The humour, as you've probably heard, is pretty spot-on. The comic relief character Corg was actually really funny, and Chris Hemsworth delivered some lines with brilliant timing, although Jeff Goldblum was a little painful.Look, I'll end with this: Thor Ragnorok is a big, fun film. It's big and it's fun. It's not the most fun you'll ever have at the movies, because it's not a perfect film. But it is fun. And I think it's awesome that this film is dumb and kinda silly. So don't act like it's anything more than that."}, {"score": "8/10", "review": "After seeing the trailers for this film I was so hyped that this film may have been my most anticipated film of the year, and yes it falls short of those expectations but it is still a great fun marvel film. The film sees the goddess of death hela released on Asgard leaving Thor stranded and having to get a team together to stop her. Chris Hemsworth has always been great as Thor, but this is easily his best performance in the role. The film totally encapsulates his humour and charisma in a massive way that it makes him very likable and easy to root for. Tom hiddleston is back as Loki and he is great too, there chemistry is very good here and I've always liked how there brotherly relationship has developed. Mark ruffalo plays the hulk/banner in this film and this is easily the best hulk we have ever seen. Adding humanity to the hulk makes him easily the best part of this film, mixed with amazing effects that make him look incredible. Also banner is still as fun as he had always been, even though he plays second fiddle to the hulk in this film. Tessa Thompson plays Valkyrie and she was so much fun to watch, she is a rebellious drunk who is full of charisma and likability. Cate blanchett plays hela in the film and even though she is clearly having fun with the role and is pretty menacing, she didn't really stand out that much to me. Special mentions for Jeff goldblum as the grandmaster and taika waititi as korg who were absolutely hysterical and had me laughing throughout the film. The story is definitely a mixed bag in this one, I really enjoyed how the story develops in sakaar the gladiator pit as it shows Thor in a different light and he recruits his team. But the overall plot is pretty weak, which isn't helped by its focus on fun action and forgetting about a serious plot really. Which gets me to the script, this is possibly marvels funniest movie as it had me laughing pretty much the whole way through. But, this definitely comes at the cost of any real drama that those other films had, there wasn't that moment that made me emotionally care about the situation. The style of the film is a big plus, the more vibrant colours and massive scale actions scenes work for the most part and it really embraces its more sci-fi roots. Overall I had a lot of fun with Thor Ragnarok, and I do believe it is the best Thor film which is definitely worth a watch."}, {"score": "10/10", "review": "The third film of Thor, the God of Thunder, finds him assembling a team of \"Ravengers\" (which here means he's reuniting with his brother Loki and another avenger, Hulk) in order to save Asgard from Hela, the Goddess of Death and the coming Ragnarök.What director Taika Waititi brings to the table is very unique and interesting. Not only is this the funniest movie in the MCU, it's also the most entertaining and the most emotional one. It has plenty of jokes (all of which are hilarious) but it also has some emotional depth that I wasn't expecting.The cast is obviously perfect. Hemsworth's comedic talent is insane and he has great chemistry with Ruffalo's Hulk. Cate Blanchett's Hela offers a great cbm villain. The rest of the cast is great too. The visuals are out of this world, the action is some of the best I've seen all year and the movie as a whole is a must-see event. For what seemed like a filler movie until \"Infinity War\", Ragnarok more than blew me away. I can't wait to experience it again."}, {"score": "8/10", "review": "I'll say it again. This lord of thunder movie is ridiculously marvelous, you know, because it's Marvel? OK I know where the door is. But before I get out, let me add a couple of things.I don't remember much, but as far as I can tell, this is a second super heroes movies that the soundtrack really hit the spot, Led Zeppelin's Immigrant song is kick ass, and its really help to create perfect atmosphere while Thor kicking ass.This movie do provide more color than usual, literally, and throw a lot of comedies, showing that it's okay for a big scary dude to act dork, I'm looking at you Hulk, you're kinda cute there, you too lord of... err, god of thunder. Thor, we still like you even though you're not a strongest Avengers (that's what quinn jet says).All in all, this movie is gooood. There, 'nuf said, I'm out of here, maybe to watch it again. Or maybe later, when I'm sure I can pick a good position, rather than forced to take the last available chair."}, {"score": "8/10", "review": "I saw this film at the Beckenham Odeon in London. The beginning of this film was as impactful as the bullet-time opening of Swordfish. So that set the movie off at with very high expectation indeed. Hela's part in the story was as expected, and nothing changed from the trailers. She's very powerful, and also very single-minded. Hulk's treatment in the film was in two parts - when he was the Hulk, he was a star, but when he was not hulk, he was a bit part player. I'm not sure I liked how his role was handled in the film, but I suppose anymore exposure of the Hulk, would have taken the shine off Thor himself. So maybe its understandable. I personally felt that more could have been made of the Hulk's character. What did make the film stand out though was the comedy. It was very unexpected, and also brilliantly done! Along the way, Thor meets a minor gladiator, who turns out to be the funniest guy ever! You'll have to see for yourself, but his deadpan delivery turns the film almost into a comedy, every time he's on the screen! The battle scenes were good, but not to the level of LOTR, for scope and spectacle. I enjoyed it, but I feel that it fell just a little bit short of the standard that Wonder Woman delivered. But it did set up the forthcoming space-based Marvel films very well (Black Panther was not referenced)."}, {"score": "10/10", "review": "Both missing in action since the end of Avengers: Age of Ultron, Thor and Hulk could be seen as the forgotten children of the MCU, and when they're two of the most popular characters with fans, that seems quite criminal to me. The two haven't really been done justice in their solo films yet, even though I'm a big fan of Thor, but with Taika Waititi on board to direct Thor: Ragnarok, my expectations were sky high.Imprisoned on the planet Sakaar, Thor (Chris Hemsworth) is pitted against the Hulk (Mark Ruffalo), a former ally, in a gladiatorial duel to determine whether he can travel back to Asgard and put a stop to Hela (Cate Blanchett) and her apocalyptic tendencies toward Asgardian civilisation.It's testament to Marvel Studios that, even with Thor: Ragnarok being the seventeenth film of the MCU, they can still produce work as unique and exhilarating as they have here. Taika Waititi has worked wonders to inject the Thor solo films with such vibrancy of colours and characters, leading to Thor: Ragnarok becoming one of my favourite entries into the MCU so far.With Waititi involved, I was expecting this film to be funny however, I was nowhere near prepared for just how funny it ended up being. Seriously guys, there are plenty of moments that caused raucous laughter from the audience, Thor and Hulk giving the Guardians of the Galaxy a run for their money as the funniest MCU heroes. It's the screenplay from Eric Pearson that should take most of the credit, along with some of the brilliant new characters we're introduced to, Korg in particular played by Waititi himself being one of the MCU's most welcome additions.The action, of which there is plenty, is driven by the retro vibes of Mark Mothersbaugh's score and even Led Zeppelin's Immigrant Song, which kicks the finale into overdrive particularly well. Javier Aguirresarobe's cinematography combines seamlessly with the expectedly stunning visual effects to create an almost psychedelic sense to the action sequences.Coming to the performances, Thor: Ragnarok features a strong ensemble cast, pretty much all of them showing some fine comedy instincts at one point in the film. Chris Hemsworth leads the film with such a confident performance, matching both the cockiness and naivety of his character to great effect. Much like people say Robert Downey Jr. is Tony Stark, I just can't imagine anyone else playing Thor.The supporting performances make this such a special film, Mark Ruffalo doing some great work as the Hulk/Bruce Banner, keeping his place as one of the best actors within the MCU. Tom Hiddleston returns to the role of Loki and he's expectedly wicked, making it easy to see why he's such a favourite with the fans, while MCU newcomer Tessa Thompson shows plenty of potential to become a future fan favourite with a performance full of grit and fire as Valkyrie. If you're a fan of Jeff Goldblum then I'd just like to say you won't be disappointed with his performance as Grandmaster, a character just as eccentric as Goldblum himself.I really liked Cate Blanchett as Hela, the villainess of the piece. While she may succumb to the weak villain syndrome that plagues superhero films these days, I felt that she suited the tone they were aiming for with Thor: Ragnarok. If the heroes can have some fun, why can't the villains have some as well?Thor: Ragnarok finally gives Thor the solo film he deserves as one of the original Avengers, full of laughs and plenty of heart, the road to Avengers: Infinity War is nearly complete. I, for one, cannot wait."}, {"score": "2/10", "review": "this movie is just another nonsense drunk story filled with special effects, repeated music and cheesy lines. I guess it was meant to be a comedy rather than an action movie but at least is entertaining. Not bad if you have cheap tickets with free popcorn/drinks but wouldn't pay any extra for IMAX/3D"}, {"score": "8/10", "review": "I'm neither a Marvel fan, nor (in particular) a Thor fan\u0085.. but I have to admit \"Thor: Ragnarok\" was brilliant from beginning to end. Thor (Chris Hemsworth) has been travelling the universe in search of\u0085 stuff\u0085 (I neither remember nor care)\u0085 but returns to his home planet of Asgard with a dire warning of impending 'Raganrok': this being the 'End of Days' for Asgard. But he finds the court engaged in serious leisure time!Things go from bad to worse when Hela (Cate Blanchett, \"Carol\") – someone with more than a passing relationship to Thor – arrives with a mission to assume the throne. Teamed uncomfortably with half-brother Loki (Tom Hiddleston, \"High Rise\"), the brothers get cast millions of light years away to a planet lorded over by a 'grand master' (a lovely performance, that I will leave anonymous here) who pits new gladiators in an arena against his latest champion. You'll never guess who his champion is? Well, OK (cos the trailer gives it away)\u0085 he's big and green! The film's script is hilarious. It generates an enormous volume of entertainment with laugh-out loud moments throughout; the unforeseen involvement of other Marvel characters; some startling cameos all mixed with the usual brand of spectacular fights and action. Some of the action is surprising: a real eye-opener you might say.The lead cast (Hemsworth, Hiddleston, Blanchett and Ruffalo) all perform admirably and are joined by heavyweight cameos from Anthony Hopkins (\"Westworld\") and Idris Elba (\"Bastille Day\") reprising their roles from \"Thor: The Dark World\". Particularly impressive is Tessa Thompson (\"Creed\") as Thor's Valkyrie warrior side-kick and Karl Urban (\"Star Trek: Into Darkness\") as the turn-coat Asgardian Skurge.Directed by young New Zealander Taika Waititi (behind last year's successful indie hit \"Hunt for the Wilderpeople\") it's a breath of fresh air for the Thor franchise, more similar to the style of \"Guardians of the Galaxy\" rather than the previous films in the series. Waititi also saves all the best comedy lines for himself as the 'rock warrior' character Korg: his New Zealand twang delivering just side- splitting dialogue. As with most Marvel films, its a little bit flabby in places, running to 130 minutes: some of the dialogue, particularly scenes between Hemsworth and Ruffalo, feel like they needed tightening up in the editing suite. This time of course includes the scrolling of endless teams of visual effect artists in the closing titles which – naturally – 90% of the audience stay for to see if there are any \"monkeys\". In fact,there are two: one fairly early on; the other right at the end. (To be honest, I thought neither of them was particularly worth waiting for). However overall the movie is highly recommended for a fun night out at the cinema. By the way, this is a film best viewed cold\u0085 if someone tries to tell you the surprises, cut them off quick!(Thor (sic) the full graphical review, please visit bob-the-movie- man.com. Thanks!)."}, {"score": "9/10", "review": "I mean seriously, no kidding! that breathtaking opening action scene, that exhilarating fight scene between Thor and Hulk on the arena, those countless hilarious scenes that literally made me laugh out loud (seriously!), that touching moment with Odin, that sad but satisfying ending, that shocking first post-credit scene, and the list goes on and on and on made this movie the greatest, the most epic, and the most awesome superhero movie of the year! (whether or not \"Justice League\" could live up to that title, I guess we'll never know until November the 17th arrives) Some critics (or maybe just one, I dunno) say that \"Thor Ragnarok\" is the boldest Marvel movie to date, in which I say it's true! I mean, how they stir and twist one of the greatest and the most well- known mythology in the world into a super-hilarious comic book movie (that perhaps upsets some people in the Scandinavian countries, from which the epic tales of Thor originated) that people and fans love is the key to Marvel Studios success. I never knew who Taika Waititi was before, but after I saw his movie yesterday, I can confidently say that he is one of the most promising new names in fully-packed- action-movie genre in the history of Hollywood.now that I have watched this movie yesterday, I'm now looking forward to watching other Marvel Studio movies in the years to come such as Black Panther, Ant-Man and the Wasp, Guardians of the Galaxy vol. 3, Captain Marvel, and the most importantly, Avengers: Infinity War and its sequel. The wait is killing me, wake me up when those movies arrive on the theater, will ya?"}, {"score": "8/10", "review": "Thor has always been a little too serious and self-important. And Disney-Marvel have decided enough is enough.Storyline, Blah. Baddie, Blah. Action sequences, Blah. Length, Groan. But it's FUNNN!! This should have been a summer flick coz it's pure popcorn fun.Hulk is a hoot but for me, Jeff GoldBlum steals the show.Go have a blast."}, {"score": "9/10", "review": "*TWO* POST CREDIT SCENES TO WATCH!Great starting sequence was pure magic, the banter, cinematography and the ACTION! What I admired about this film is Taika Waititis brilliant humor, being from New Zealand appreciating it even more so. The action sequences were slick, crisp, and actually watchable - as opposed to many other movies who cover up the action with motion blur, too much camera work or just not enough scene time to appreciate the spectacle. Hulk and Thor were brilliant in this film, CGI was the best I've seen for the Hulk, and his scenes with Thor are hilariously funny. Hella was hellish and I loved it, her story interestingly made sense tying her into the movie and not making it feel forced. Supporting cast of Valkyrie, Skurge, Korg, Grandmaster, Loki, Odin etc... all had their place and they all had their moments to shine, which is hard to do in a movie with a plethora of characters. Only thing to note is the pacing is sometimes a bit abrupt going to and from other stories happening within the movie, but it's not a biggy at all. One small thing is some impactful and emotional scenes (which you'll know what I'm talking about) didn't feel like it had the depth or impact that it should of – Maybe it's just me, but I'll see this movie a few more times over and maybe edit this as I would have had more time to reflect on it. All in all, from start to finish Ragnarok is a roller coaster ride of beautiful action pieces, quirky and snappy humor and a flagship for other Superhero movies to strive Thor!"}, {"score": "8/10", "review": "Thor: Ragnarok is the third standalone Thor movie and the fifth film in Phase 3 of the Marvel Cinematic Universe. Directed by Taika Waititi (Hunt for the Wilderpeople), this installment gives the Thor films a much needed jolt of life that was lacking greatly in its two predecessors.Two years after the events of Avengers: Age of Ultron, Thor (Chris Hemsworth) finds himself imprisoned on a distant planet where he is forced to do battle in a gladiatorial duel against his former friend, The Hulk (Mark Ruffalo). Meanwhile, Thor's home realm of Asgard is under attack by the powerful Hela (Cate Blanchett), who plans to bring it to an end during the oncoming apocalyptic event known as Ragnarok.Considering how bleak and serious the first two Thor films were (mainly the second film), Thor: Ragnarok thankfully takes a different route by injecting more humour and colour into the story to become one of the most fun and entertaining films in the MCU to date. All of the film's comedic moments worked well, and didn't feel as though they were just inserted for the sake of generic comic relief. Another issue I feel is that the original two focused too much on Loki (Tom Hiddleston), making us forget that Thor was supposed to be the main character. Thankfully, Loki, while still having an important and amusing role in the story, is merely a supporting character and Thor himself is given the proper development needed to move the film along nicely. As with all films in the MCU, be sure to stay after the credits for two bonus scenes.I rate it 8/10"}]